1: b'And it\xe2\x80\x99s goodnight for us! We\xe2\x80\x99ve got more to come tomorrow, including another Ones to Watch H2H, a summary of our picks, a Q&A session and more! Bring it on # GW16! # FPL # FPLCommunitypic.twitter.com/xdOenaovT6'
2: b"REVEALED: the players you definetely don't want this GW, because I own them 0 transfers used after last weeks wildcard (C) Aubergine edges out 'Arry Steele, Wan Biscuit, Brooks and the Rory Delap # FPL # GW16 pic.twitter.com/54BQPw1keb"
3: b'Good luck to all this Gameweek! May you end up with green arrows a-plenty! # FPL # GW16'
4: b'Play Kenedy or Wilson? Have Double Liverpool defence... # FPL # GW16 @ LetsTalk_FPL @ FPLFamily @ FFCommunity_ @ FPL_physio @ FPLBoffin @ VionylRichie @ FPLTIPZpic.twitter.com/YrLLSYlTGw'
5: b'My friend has possibly the worst, most depressing question for you lot: Who to start: Marouane Fellaini (FUL) or Isaac Success (eve) # FPL # GW16 # FPLcommunity'
6: b'# FPL Take the Hit Ep12 # GW16 Out Now Kane banks, Auba blanks Rotation strikes Joff-spiracies Pellegrini wheeled in Who is @ CallumWilson Arnie & Aguero injury woes Laca or Auba # podcast # Fantasypl # FPLCommunity # fantasyfootballhttps://itunes.apple.com/au/podcast/fpl-take-the-hit/id1436811882 \xe2\x80\xa6'
7: b'Transfers for # GW16 done Martial, Arnautovic Lacazette, Camarasa Might Lacazette -4 hit taken # FPL # FPLcommunity # fantasypremierleague # fantasypl'
8: b'My # GW16 punt before I wildcard is... # FPL # FPLCommunitypic.twitter.com/kJ82n86PNj'
9: b'All six meetings between Newcastle and Wolves in the Premier League have seen both teams score \xe2\x80\x93 it\xe2\x80\x99s the most played fixture in the competition not to see a clean sheet. NEW DEF WOL DEF # FPL # GW16 # FPLCommunity'
10: b"Could go with this for # GW16. Can't see a green arrow though - imagine it would be damage limitation. I have \xc2\xa31.3m ITB but not sure on Arnautovic replacements. I'm keen on Lacazette but not on downgrading Salah to Sterling this week to fund it. How are your teams looking? # FPL pic.twitter.com/9DdogqOCLz"
11: b'Salah vs Kane vs Auba last Game week. Goals 0-1-0 Assists 1-1-0 Shots 2-3-2 Pen touches 5-5-1 Chances created 3-1-0 Salah played just 25 mins compared to 90 for the other 2 Captaincy decision decided # FPL # GW16 # MoSalahpic.twitter.com/7Txjc1jKth'
12: b'# gw16 # fpl # fantasyfootball'
13: b'Who to bench for Camarasa? (I\xe2\x80\x99m also starting 2 Liverpool defenders) # FPL # GW16'
14: b'\xd9\x84\xd8\xb9\xd9\x84 \xd9\x88 \xd8\xb9\xd8\xb3\xd9\x89 \xd8\xaa\xd8\xb6\xd8\xa8\xd8\xb7 \xd8\xae\xd9\x84\xd8\xa7\xd8\xb5 # GW16 # FPL pic.twitter.com/j7jGjOy96Q'
15: b'# GW15 (-4) OR 61,167 1 FT Wilson Sane Arni Hazard Kane A solid hit was taken ahead of GW15, which saw me come out 14 points ahead of if I hadn\xe2\x80\x99t made it. Transfers for # GW16 already made, Arni to Kamara, Camarasa to Anderson for my 3rd hit in a row. # FPL pic.twitter.com/RzqKDpTIwJ'
16: b'# GW16 Lacazette & Sterling Firmino & Salah Captain Lacazette or Kane? 1.8 in bank to strengthen midfield for GW17 # FPL pic.twitter.com/Bo0T5dYwP6'
17: b'The top 4,194,304 scorers in Gameweek 16 will qualify for the # FPL Cup. 1.8million players to miss out. # GW16 pic.twitter.com/HKkNHmZ7TE'
18: b'Best option for a one week punt for # GW16? # FPL'
19: b'Cheeky little -4 to do Kolasinac in for Ricardo Pereira? # fpl # GW16'
20: b'# GW16 -8 taken might of jump the gun but price rises played a part. # FPL pic.twitter.com/SYTWsESjsz'
21: b'# GW16 Transfer: Lacazette That Arsenal fixture run is too good to turn down and he\xe2\x80\x99s a great captain option this week. Even if he\xe2\x80\x99s benched he\xe2\x80\x99s shown he can come on and get points # FPL'
22: b'Leicester and Spurs both won their respective home Premier League meetings last season \xe2\x80\x93 there were 12 goals scored in matches between the sides, with only Arsenal vs Everton (13) producing more last season. # FPL # GW16 # FPLCommunity'
23: b'All six meetings between Newcastle and Wolves in the Premier League have seen both teams score \xe2\x80\x93 it\xe2\x80\x99s the most played fixture in the competition not to see a clean sheet. NEW DEF WOL DEF # FPL # GW16 # FPLCommunity'
24: b"This is the squad for # FPL # GW16 Arnautovic Kane Salah (vs BOU) OR 49.856 ITB 0.6 After an unbelievable # GW15, anything is possible. Let's see what happens. Good luck everyone!pic.twitter.com/aGSeZcfc3f"
25: b'NEW POST - fantasy premier league \xe2\x80\x93 the FFGeek team for GW16 You may need to sit down when you read this. I certainly needed to https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-team-selection-gw16-ffg-team/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW16 # eplfantasy # fplMYpic.twitter.com/2oFmkv471J'
26: b'-4 done! Murray and Alonso OUT Lacazette and Bellerin IN Between Lacazette and Kane for (C)! # FPL # GW16'
27: b'Formazione chiusa per la # GW16 Wildcard giocata Capitano Harry Kane Dobbiamo fare una grande GW Speriamo nel nuovo capitano e nei nostri grandi centrocampisti https://fplitalia.wordpress.com/2018/12/07/gw-16-formazione/ \xe2\x80\xa6 # fpl # fplitalia'
28: b'Subota, Brkati pab, od 18:00. Okupljanje Fantazi zalu\xc4\x91enika. \xc4\x8celzi - Man\xc4\x8dester Siti. Proverite va\xc5\xa1e poznavanje Premijer lige u zanimljivom kvizu. Poeni igra\xc4\x8da koje imate donose vam popust na popijeno pi\xc4\x87e. # FPL # GW16 # CHEMCI # fudbal # fantasyludnica'
29: b'*** Lineup Lamentations - # GW16 *** Our Transfers, Captains, and Starting 11s for the week. http://fmlfpl.com/post/180901903055/lambs120718 \xe2\x80\xa6 # FMLFPL # FPL # FantasyPremierLeaguepic.twitter.com/1LlkG4oMaO'
30: b'Ready for # GW16 . It was hard to sell Salah, but at \xc2\xa313m I expect more. As a LFC fan I feel little guilty to not have an attack. player, but strike force Kane-Auba just looks good. Salah, Arnie Auba, FA (-4). Plan for GW17 is either Alisson/Ederson or Fabianski. 1,4 ITB. # FPL pic.twitter.com/k20umJaRJV'
31: b'Bilva did not travel with the squad although he took part of training this morning. He might still join tomorrow (unlikely) or was dropped for unknown reason! # FPL # GW16 # CHEMCI'
32: b'Despite excellent WHU fixtures still not fully convinced but I will bring Fabia\xc5\x84ski in for # GW16 30k overall so no risk - Kane (C), Sterling (VC) # FPL'
33: b'# FPL # GW16 Weekly Differentials Article @ HypeTrainSam explores a hidden Fantasy gem in each Premier League fixture ahead of the upcoming weekend round of # PL fixtures that might make the difference in your squad. Read here http://www.thehypetrain.co.uk/single-post/2018/12/07/WEEKLY-WILDCARDS-201819-FPL-Gameweek-16 \xe2\x80\xa6pic.twitter.com/CSJ0vqmwtf'
34: b'This tweet says that Bilva has not been pictured with Man City squad heading to London. # FPL wise, this would mean Fernandinho Dilva and Mahrez in Midfield, Sane Sterling and Jesus up front. # FPL # GW16 Normally this is a trusted source in Middle East @ DavidMunday815 @ FFScout_Joehttps://twitter.com/EPLworld/status/1071154385227563013 \xe2\x80\xa6'
35: b'# FPL # GW16 Captaincy Picks @ HypeTrainRob rounds up our essential, alternative and wildcard captaincy selections, for # FPL players ahead of the upcoming weekend games. Read here http://www.thehypetrain.co.uk/single-post/2018/12/07/CAPTAINCY-HYPE-201819-FPL-Gameweek-16 \xe2\x80\xa6pic.twitter.com/lCc7NcVMl1'
36: b'Arnie to Rondon this week then Hart to Kepa for Chelsea coverage in the next set of fixtures. Thoughts? # FPL # GW16 # GW17pic.twitter.com/IjVA8VzpTq'
37: b'My head all this week... Captain Kane Captain Aubameyang Captain Kane Captain Aubameyang Captain Kane Captain Aubameyang Last nigh ok, I\xe2\x80\x99m set Captain Kane This morning wait....Captain Aubameyang # GW16 # FPL # FPLCommunity'
38: b'To all; Complaining that OR in the top 20K is the worst ever, Thinking you are jinxing certain players, Crying about a price rise, Moaning over a bad Captain choice. Remember # FPL is a game and we have fun playing it...and that real problems belong in the real world Enjoy # GW16 pic.twitter.com/pTSZoRx5YC'
39: b'In case you missed it last night, make sure to check out our latest episode, 19. It seems so crazy that we are almost on episode 20 already. This one was recorded Wednesday night immediately after the final games of GW15. We assess the # FPL landscape ahead of # GW16 https://twitter.com/fplhangover/status/1070809949654171649 \xe2\x80\xa6'
40: b'Excellent column as always by @ FPLStag for # gw16 # fpl https://twitter.com/FPLStag/status/1071012447560089600 \xe2\x80\xa6'
41: b'Looking for Premier League injury & team news ahead of Gameweek 16? Look no further. @ BenDinnery is the best around. # gw16 # fpl # MyDanielLarussohttps://twitter.com/BenDinnery/status/1071153280158453761 \xe2\x80\xa6'
42: b'The last 18 months or so of FPL have been brutal. It\xe2\x80\x99s gotten to the point I\xe2\x80\x99m genuinely worried about my team qualifying for The Cup. Frustrating. # FPL # TheCup # GW16 pic.twitter.com/zZabhk9gYd'
43: b'Team locked in for # GW16 In: Wilson and Anderson. Out: Arnautovic and Mane. (-4 hit). Captain: Sterling. Best of luck to all! # FPL pic.twitter.com/vG31OELXpp'
44: b'Is it a bad idea to okey kokey Kane/Auba over the next few weeks. Would captain them each week. Auba this week. Kane home Burnley next week then Auba home Burnley the week after # FPL # FPLcommunity # GW16'
45: b'K\xc3\xbcn Karam and Chicharito agent have approached a verbal agreement to sign the forward as part of the Xmas deal. The forward will land in the next few hours to sign the contract. Fees expected to be around 6.3M! # FPL # GW16'
46: b'Remember fellow Managers The first round of the cup will be # GW17. Qualifying: The top 4,194,304 scorers in # GW16 will enter the first round. If there are more than 4,194,304 qualifiers then there will be a random draw amongst the lowest scorers to see who qualifies. # FPL'
47: b'NEW POST - Fantasy Premier League \xe2\x80\x93 Potential Premier League Team Lineups for GW16 Big thanks to Jordan Sadler @ JordanSadler95 for doing this https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-lineups-gw16/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW16 # eplfantasy # fplMYpic.twitter.com/Loei99KG3W'
48: b'I just can\xe2\x80\x99t bring myself to ditch Salah. Need to to fund for an Arsenal forward # FPL # FPLcommunity # GW16'
49: b'Form Vs Fixtures? # FPL # FPLCommmunity # fantasypremierleague # GW16'
50: b'The -4 I took in # GW15 did not work out. So the obvious thing is to do it again right!? Salah and Arnie out for Anderson and Kane in for # GW16 Oscillating between Auba and Kane captain # GW16 # FPL pic.twitter.com/YeFO9GGtaJ'
51: b'Ur short haul flight EP. 19 of Captain\xe2\x80\x99s Pick: The FPL Podcast is now ready to board... \xe2\x80\xa2 # GW15 review \xe2\x80\xa2 Aub or Haz \xe2\x80\xa2 # GW16 preview # FPL # FPLCommunity # FPLFamilyhttps://itunes.apple.com/gb/podcast/captains-pick-the-fpl-podcast/id1428570511?mt=2&i=1000425351244 \xe2\x80\xa6'
52: b'LEGIONS OF POOM # GW16 Top rope - Bellerin (sponsored by Urban Outfitters) Leg drop - Hoedt Ringleader - Salad Evening maniacs! Struggling on my first 11 this week. Karate Kid apparently a doubt so Muzza likely to start! What you saying brother!! # FPL pic.twitter.com/fB6ML4FNNV'
53: b'Early reveal for # FPL # GW16 I\xe2\x80\x99m just playing for pure enjoyment and risk taking now. Terrible rank so new aim is just to finish inside Top 100k and have fun. I\xe2\x80\x99ve screwed up by not leaving any room for premium forwards so no Kane or Aubameyang here, which will kill me. pic.twitter.com/m6WrhY8LNz'
54: b'Inplay Juventus vs inter milan Over 0.5 match goals # Canlibahis # FPL # InPlay # GW16'
55: b'Give us a hand please # FPLCommmunity , got a bit of a transfer dilemma here! Taking a hit this week, but which pair should I go for? # FPL # GW16 @ hailcheaters @ FPLSurgery'
56: b'# GW16 FPL TEAM TRANSFERS: Arnautovic \xe2\x86\x92 Wilson Salah \xe2\x86\x92 Sane Billing \xe2\x86\x92 Son Aubameyang (may change!) Start Rank: 74k Good luck everyone # FPL pic.twitter.com/B3s0ZnCj3j'
57: b"NEW POST - # Fantasypremierleague \xe2\x80\x93 FFGeek contributors show their GW16 teams part 1 there's @ Thefpl_vet @ alexwaterbaby @ JordanSadler95 @ MleichtD Yaniv & @ jwcrilley who made his transfers at his work Xmas party https://www.fantasyfootballgeek.co.uk/fpl-team-tips-gw16-ffg-contribs1/ \xe2\x80\xa6 # fpl # FantasyPL # fplcommunity # GW16 pic.twitter.com/0mJTVYbGOt"
58: b'# FPL # GW16Thoughts: Head says Richarlison Heart says Richarlison Gut says Richarlison Y Balls says Filipe Mrs vs says Kane'
59: b'# FPL # GW16Thoughts: Head says Richarlison Heart says Jiminez Gut says Salah Y Ball says Sterling Mrs Fly says Kane'
60: b"And @ samuelluckhurst reckons Martial won't be fit for United game v Fulham # FPL # GW16 # MUFC # MUNFULhttps://twitter.com/samuelluckhurst/status/1071138793535758341 \xe2\x80\xa6"
