1: b"Anyone care to throw a suggestion my way? A. Camarasa - > Brooks. Start Jimenez B. Jimenez - > King. Start Camarasa C. Jimenez & Camarasa - > King & Brooks (-4) Will lose 0.6m on Jimenez but not even certain I'll buy back yet. # FPL # GW30"
2: b'Beidh m\xc3\xa9 ag scr\xc3\xadobh i nGaeilge don ch\xc3\xa9ad deich l\xc3\xa1 eile mar chuid de Seachtain na Gaeilge. \xc3\x81dh m\xc3\xb3r an tseachtain seo i peile fantais\xc3\xadocht. # FPL # GW30 pic.twitter.com/YwLWpQpY8Q'
3: b"It's # InternationalWomensDay so make sure you check out the latest episode of the # FPL Pop In Pod w/ @ NymfriaTV...oh and @ Migtavius too Discussing the blanks & doubles, and a few snippets of # wisNymdom # GW30 # KeepPopInhttps://soundcloud.com/fpljournal/fpl-pop-in-pod-s2-ep21-gw29-betsy-pognah-bruv \xe2\x80\xa6"
4: b'# FPL # GW30 Vardy has been confirmed fit, done Jimenez>Vardy following earlier Jota>Brooks making -4. That brings me up to 8 players for GW31. Will probably do just 1 FT next week as 9 players could be sufficient. Effectively damage limitation exercise after losing FH by accident.'
5: b'CRP 2-0 BRI CAR 0-2 WHM HUD 0-0 BOU LEI 2-0 FUL NEW 1-1 EVE SOU 1-3 TOT MCI 3-1 WAT LIV 2-0 BUR CHE 1-1 WOL ARS 0-0 MNU # GW30 # FPL @ OfficialFPL'
6: b"NEW ARTICLE @ TheFPL_Analyst presents you with the calculated projected pts returns of all the players for # GW30 using the bookies odds and past performance data Who's predicted to score the most this GW? Find out here # FPL https://fplconnect.blog/2019/03/07/fpl-prediction-tool-gameweek-30/ \xe2\x80\xa6"
7: b"Hudderfield Huddersfield have no asset you would want unless you need their 4.2m defender's or midfielders for budget reasons. Be aware they are getting tighter in defence so opponents will find it harder to score then they did previously. # FPL # GW30"
8: b'Everton/Burnley Do u still have Richarlison, if so why? Joking aside he did play well against Liverpool Sigurdson could looks like the standout Everton option, the defence also looks decent recently. Ashley Barnes is great budget enabler and in form. # FPL # GW30'
9: b'Chelsea Wolves & Everton in the next 2 games, a clean sheet & attacking returns are possible. Higuain & Hazard are the obvious targets, it really depends on your squad, how easy it is to get one of them in. Azpilicueta is back on the radar with 3 assists in 4 games # FPL # GW30'
10: b'Newcastle\xe2\x80\x99s defence Newcastle have the most clean sheets (9, along with Palace) outside of the top 6 clubs. They only play 2 games against a top 6 until the end of the season, there should be more clean sheets. Schar is one booking away from a 2 games suspension # FPL # GW30'
11: b'Bournemouth\xe2\x80\x99s attack Bournemouth have one of the best fixture run until the end of the season. With no news on Wilson yet but the return of Brooks to the team last week plus we have the option of King or Fraser I think we might need at one of them in our squads # FPL # GW30'
12: b'Leicester\xe2\x80\x99s attack Vardy scored last week and Maddison has good stats which indicates returns might be forthcoming. Barnes looks too raw from an fpl pov, Gray could be a differential if he can get into the starting lineup. Nice fixtures plus an attacking manager # FPL # GW30'
13: b'Leicester\xe2\x80\x99s defence 1 clean sheet in 11 games, sounds like relegation form. They might have a new manager but I can\xe2\x80\x99t trust their defence to keep a clean sheet anymore. However Leicester play Fulham & Huddersfield in GW30/33, so something to think about # FPL # GW30'
14: b'Felipe Anderson With only 1 assist in 10 games, Anderson is a rank killer. He has only ONE shot in 4 games, regardless of fixtures I would avoid transferring IN Anderson. I will go as far saying if you own get rid of him but this depends on your team situation # FPL # GW30'
15: b'FPL GW30 Preview Part 1 With 1 week to go until FPL\xe2\x80\x99s biggest blank week in GW31. FPL managers will hope to make some gains in GW30-35. With more idea of form/data of certain teams/players I\xe2\x80\x99m going to revisit some potential targets for GW30 with GW31/33 in mind: # FPL # GW30'
16: b'Who to captain...? I also have Pogba and Felipe Anderson, no Ag\xc3\xbcero. # FPL # GW30 # LivBur'
17: b'# FPL Gameweek 30 FISO preview # GW30: https://www.fiso.co.uk/fpl-season-2018-19-gameweek-30-preview/ \xe2\x80\xa6'
18: b"# FPL # FPLCommunity # GW30 , Team Ready for # GW30 - As mentioned in my last GW tweet - I've made 2 transfers to get rid of suspended Bennett & non playing Puncheon for Brooks & Adam Smith pic.twitter.com/2cNI3P2mMp"
19: b'NEW POST - fantasy premier league blanks and doubles \xe2\x80\x93 an update https://www.fantasyfootballgeek.co.uk/fpl-blanks-doubles-update/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW30 # eplfantasy # fplMY # epl # premierleague # fplupdates # fplislife # fantasypremierleagueislife # FPLus # fpltreview # wildcardpic.twitter.com/azHZE4e8AZ'
20: b'Hopefully Lacca is well rested now for # GW30 # FPL'
21: b'# GW30 transfers: Most transferred in player: TAA Most transferred out player: Aubameyang # FPL # FPLCommunityhttps://foomnianalytics.com/tactivity.php'
22: b'Chelsea XI to face Dynamo Kyiv: Arrizabalaga, Zappacosta, Christensen, Luiz, Alonso, Kovacic, Jorginho, Barkley, Pedro, Giroud, Willian. Eden Hazard and Gonzalo Higuain are among the substitutes. # FFScout # FPL # GW30 # CHEDYN # ChelseaFC'
23: b'# FPL # FPLCommunity # BGW31 , # GW30 Should take an additional hit in preparation for # BGW31 ?'
24: b'# FPL # GW30 Weekly Differentials @ HypeTrainSam explores a hidden Fantasy gem in each Premier League fixture ahead of the upcoming Gameweek that might make the difference in your squad. Read here https://www.thehypetrain.co.uk/single-post/2019/03/07/WEEKLY-WILDCARDS-201819-FPL-Gameweek-30 \xe2\x80\xa6pic.twitter.com/DyEfJen8sk'
25: b'Son owners; are you intending to keep him for # GW30, or are you going to sell him before Spurs\xe2\x80\x99 away match against Southampton? # FPL'
26: b'In our Emergency room you can find all the injuries and suspension, as well as find alternatives for all those players with just 1 click! # FPL # FPLCommunity # GW30 https://foomnianalytics.com/temergency.php'
27: b'# GW30 Transfer Maddison IN Pogba OUT # FPL'
28: b"# GW30 transfers Here is my previously announced big changes to the team: In : Higuain 9.6\xc2\xa3 # CHE Van Dijk 6.6\xc2\xa3 # LIV Boruc 4.0\xc2\xa3 # BOU Out : Aguero 11.6\xc2\xa3 # MCI Bednarek 4.0\xc2\xa3 # SOU Button 4.0\xc2\xa3 # HUD Bank: 2.5\xc2\xa3 Now I'm fully prepared for # gw31 # FPL # FPLCommunitypic.twitter.com/F72UdrKEjE"
29: b'Southampton won\xe2\x80\x99t risk Ings against Spurs\xe2\x80\xa6 https://www.eveningexpress.co.uk/sport/southampton-wont-risk-ings-against-spurs/?utm_source=twitter \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW30 # eplfantasy # fplMY # epl # premierleague # fplupdates # fplislife # fantasypremierleagueislife # FPLus # fpltreview'
30: b'A hilarious comparison between life and # FPL How Brendan will get right behind a fox in the box Physical threats of violence against @ FantasyYIRMA And a lucky dip All you need for # gw30 right here! https://twitter.com/FantasyYIRMA/status/1103712725568536578 \xe2\x80\xa6'
31: b'Ignoring the tough fixture of Liverpool up next, Barnes has a good looking run of fixtures subsequently, with Leicester and Wolves at home. Having only blanked in one of his last 6, Barnes offers great consistency for excellent value. # FPL # GW30 # FPLCommunitypic.twitter.com/xybKimS14W'
32: b"Feelings on Kolasniac? Not started last 2; confirmation he's no longer nailed or a good sign for the weekend? Only 4.9 so no massive issue # FPL # GW30 # Arsenal"
33: b'Who will score more # FPL points in # GW30?'
34: b'Player Status Change Kiko Femen\xc3\xada DF WAT 4.2 # FPL # GW30 http://www.fpl247.com'
35: b'We mentioned several times our Power Index! Over here you can actually find more details about it: https://foomnianalytics.com/findex.php # FPL # FPLCommunity # GW30'
36: b'Javi Gracia: "Today is a good day for me because I can say, today, all my players are available for the next game." # FFScout # FPL # GW30 # WatfordFC'
37: b'Alex Oxlade-Chamberlain will play for the Liverpool under-23s against Derby County on Friday. Jurgen Klopp also told the club\'s website that Joe Gomez "is close" to a return. # FFScout # FPL # GW30 # LiverpoolFC # LFC'
38: b'Arsenal XI to face Rennes: Cech; Mustafi, Sokratis, Koscielny, Monreal; Xhaka, Torreira; Mkhitaryan, Ozil, Iwobi; Aubameyang. # FFScout # FPL # GW30 # ArsenalFC # RENARS'
39: b"Here's you chance to have your say on # FPL's biggest talking points right now... VOTE HERE https://www.fantasyfootballscout.co.uk/2019/03/07/how-fpl-managers-plan-to-tackle-blank-gameweek-31/ \xe2\x80\xa6 # FantasyPL # GW30 # BGW31"
40: b'Most Transferred out Today 1) Aubameyang FW ARS 10.9 8120 2) Jim\xc3\xa9nez FW WOL 6.9 6905 3) Bamba DF CAR 4.7 5466 4) Rashford FW MUN 7.7 5331 5) Son MF TOT 8.8 5271 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
41: b'Most Transferred in Today 1) Lukaku FW MUN 10.7 8189 2) Alexander-Arnold DF LIV 5.5 8056 3) Zaha FW CRY 6.9 6393 4) Rice DF WHU 4.6 5961 5) Brooks MF BOU 5.0 5459 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
42: b'Looking for a new # FPL podcast for your daily commute? Check out the @ fplhangover. Our latest episode (#31) is now available and we discuss all the main FPL options ahead of # GW30 with one eye on the upcoming blank and double GWs. https://soundcloud.com/user-768411468/fplhangoverep31 \xe2\x80\xa6'
43: b"Vardy's injury update has thrown spanner in the works of my transfer plans ahead of # GW30 deadline. Playing against shambolic Fulham at home is too good to turn down. Plan was to go with Higuain as a premium differential or possibly triple up on Liverpool instead with Mane! # FPL"
44: b'Inplay # Canlibahis # FPL # GW30 # GW30 pic.twitter.com/NFBu32gKf3'
45: b'With Hogg, Stankovic and Smith out for Saturday I can see Bournemouth causing us problems. I imagine Hadergjonaj will be at right back, which could allow Fraser to get some joy down the left flank. He will probably be my transfer for Hojbjerg this week. # FPL # GW30 pic.twitter.com/20YrvbO0Md'
46: b'Thanks for reading! Has this change your mind on putting the armband on/off Salah? Vote in the poll below. Likes/RTs appreciated # FPL # FPLCommunity # GW30 # Salah # LFC'
47: b'To cap or not to cap Salah. That is the question. # FPL Some thoughts for and against Salah, to hopefully help us make the decision. *Disclaimer: Looked at Salah and Liverpool in isolation for # GW30. Feel free to disagree, or clarify/comment etc. 1/ pic.twitter.com/xQ85hDgnsP'
48: b'My current plan for # GW30 is to bring on Mane for Pogba. But I have to rethink it again as I might losing some big values selling Pogba. # FPL # FPLCommunity'
49: b"GW30 FANTRAX CHAPS CHOICES Our Alternative XI for @ Fantrax_EPL is now live ahead of Saturday's deadline Check out our starting XI of differential players ahead of # GW30 - all players with 60% ownership or below!! # Fantrax # FPLDraft # Togga # FPL https://wp.me/p9fTDR-1Bc"
50: b'Currently plan to play Barnes instead of Son - choosing form over opponent. What do you think? # FPL # GW30 # FPLCommunitypic.twitter.com/3UyRcc0Qla'
51: b'NEW ARTICLE Still planning your team ahead of the BGWs & DGWs? Check out my Ones to Watch article for @ FFEyeTest where I look at 4 more players ahead of # GW30 Cherries x2 GK & MID Swiss DEF FWD onunder the radar # FPL # FPLCommunityhttps://wp.me/parXFx-jd'
52: b'Fantasy Premier League - BLANKS & DOUBLE GAMEWEEKS - FPL BLANK GAMEWEEK 31 FREE HIT PLAYERS https://youtu.be/W0B-EWpQIYg # fpl # gw30 # gw31 # bgw31 # fplcommunity # fantasypremierleague # teamflock # fpltodaypic.twitter.com/TOe6MtWEhW'
53: b'Player Status Change Baines DF EVE 5.0 Jagielka DF EVE 4.3 # FPL # GW30 http://www.fpl247.com'
54: b"Non-City Captain Poll It's a straight shootout \xe2\x80\x94 GO! Salah vs BUR Higuain vs WOL Vardy vs FUL Place your armband now! # FPL # GW30 # FPLCommunity"
55: b'The @ FPLGeneral eyes up how to make up lost ground as the season draws to a close... READ HERE https://www.fantasyfootballscout.co.uk/2019/03/07/why-bournemouth-could-help-us-make-up-lost-ground/ \xe2\x80\xa6 # FPL # FantasyPL # GW30'
56: b'Marco Silva: "Leighton [Baines], not ready. Started to work with the team but not fully. Jags [Jagielka] is out of the last two sessions, also. All the others are okay." # FFScout # FPL # GW30 # EvertonFC'
57: b'Pochettino on Harry Winks/Kieran Trippier\'s availability: "I think Trips, no. He suffered a small problem but I think Trips is going to be out. Tomorrow we need to assess Harry Winks again. It\'s a similar situation to what it was before Dortmund." # FFScout # FPL # GW30 # THFC'
58: b'Mauricio Pochettino on Dele Alli: "It is very good news that he is going to be available. We need to wait till tomorrow, the last training session. I hope that he\'s going to be available and maybe he can play Saturday." # FFScout # FPL # GW30 # THFC'
59: b'Player Status Change Vardy FW LEI 8.9 Ings FW SOU 5.4 # FPL # GW30 http://www.fpl247.com'
60: b'The Injury Table has been updated to reflect the latest news https://www.premierinjuries.com/injury-table.php \xe2\x80\xa6 Seven down with Marco Silva and Javi Gracia still to come. # FPL # GW30 pic.twitter.com/xhnGVdDcLF'
61: b'Vardy has been declared fit to face Fulham # FPL # GW30 https://twitter.com/BenDinnery/status/1103659059515924481 \xe2\x80\xa6'
62: b'Brendan Rodgers on Jamie Vardy: "He is fine. He took a bad knock and had a couple of stitches in his tongue from the collision he had. He\xe2\x80\x99s trained very well and he\xe2\x80\x99ll be fine for the weekend.\xe2\x80\x9d # FFScout # FPL # GW30 # LCFC'
63: b'NEW POST - fantasy premier league GW30 \xe2\x80\x93 the bandwagons and sinking ships We analyse the 5 most transferred in and out players so far in the gameweek https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-gw30-tips-sinking/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW30 # eplfantasy # fplMY # fplupdates # fplislifepic.twitter.com/Mtw3nfWZuZ'
64: b'Vardy is fit for GW30. # FPL # GW30 https://twitter.com/BenDinnery/status/1103659059515924481 \xe2\x80\xa6'
65: b'Pellegrini on Hernandez/Arnautovic: "Maybe one of them for different reasons must wait in this moment or they can play both together, but in having good options for a manager, it\'s a solution, not a problem." # FFScout # FPL # GW30 # WHUFC'
66: b'Player Status Change Depoitre FW HUD 5.1 Cresswell DF WHU 5.0 Balbuena DF WHU 4.2 Duhaney DF HUD 4.0 Johnson DF WHU 4.0 # FPL # GW30 http://www.fpl247.com'
67: b'Minus 4 taken. Boruc IN for Patricio. And Higuain in for Auba. Gives me a keeper for 31 & 33 as well as a precious extra 0.5 ITB. Next week I\xe2\x80\x99m thinking minus to bring Brooks, Mane and Hazard in for Townsend, Pogba and Sterling. What do we think? # fpl # gw30 pic.twitter.com/OZr7kc6JOR'
68: b'# GW30 UNDER THE RADAR - Column is LIVE Each week Jared takes a look at his favourite # FPL stealth picks! Under the Radar - Check it out @ FPLFujtownhttp://fplbet.com/under-the-radar-stealth-picks-for-fpl-gameweek-30/ \xe2\x80\xa6'
69: b'Jan Siewert said that Jason Puncheon "trained this week" and is available for selection, adding that there were no problems between the two. # FFScout # FPL # GW30 # HTAFC'
70: b'Jan Siewert on Jon Stankovic: "He had problems but he could train this week. Yeah, he\'s available." # FFScout # FPL # GW30 # HTAFC'
71: b'Player Status Change Balogun DF BHA 4.2 Trippier DF TOT 6.1 Sch\xc3\xbcrrle MF FUL 5.5 Babel MF FUL 5.5 # FPL # GW30 http://www.fpl247.com'
72: b'Jan Siewert: "I think we are short on numbers! Hoggy still has problems with his ribs, isn\'t good at all. Demeaco with his hip, he\'s not able to play. Depoitre has a problem with his foot, I\'m not quite sure if it\'s possible for him at the weekend." # FFScout # FPL # GW30 # HTAFC'
73: b'Chris Hughton: "At this moment only Pascal Gross is unavailable this weekend. We\'ll see how it goes this week, he\'s not training but has been doing some good work. He has a chance for [the FA Cup tie versus] Millwall. Leon Balogun is now back in training." # FFScout # FPL # GW30'
74: b'Anyone able to explain why when I bought Doherty for 5.1m I cannot sell him for his current price (5.5)? # FPLCommunity # FPL # GW30'
75: b'Scott Parker: "There are no fresh injuries: Marcus Bettinelli, Alfie Mawson and Andre Schurrle are out. Andre has a virus, and could be back in contention next week." # FFScout # FPL # GW30 # FulhamFC'
76: b'Painful owning Felipe Anderson last 3 GWs. Shambolic underlying stats but reluctantly holding for car HUD. Arguably 2 easiest opponents and Bamba absence should weaken Cardiff # FPL # GW30 # FantasyPL'
77: b"More attacking returns for Lukaku and Rashford last night. Here's how United's Champions League win affects their busy upcoming schedule - and surely increases the risk of # FPL rotation. https://www.fantasyfootballscout.co.uk/2019/03/07/six-goals-in-three-games-for-differential-lukaku-but-a-hectic-april-awaits-united/ \xe2\x80\xa6 # GW30 # MUFC"
78: b'Spurs report that Kieran Trippier (gluteal muscle strain) is undergoing treatment, while Harry Winks (groin) will be assessed ahead of the weekend. Dele Alli (hamstring) returned to training earlier this week. # FFScout # FPL # GW30 # THFC'
79: b'Thread # FPL # GW30 # GW31https://twitter.com/UtterlyTC/status/1103638897110724608 \xe2\x80\xa6'
80: b'Despite going well under the radar this season, Sigurdsson has still managed to show his FPL pedigree, managing 6th spot overall for midfielders so far. With Richarlison out of form, we expect Siggy to be Everton\xe2\x80\x99s focal point in attack. # FPL # GW30 # FPLCommunitypic.twitter.com/bQDPBm1SDE'
81: b'Jan Siewert says that he will be without Demeaco Duhaney (hip), Adama Diakhaby (hamstring), Isaac Mbenza (calf) and Tommy Smith (suspended) in # GW30. Jonathan Hogg\'s rib injury "could take time", while Laurent Depoitre (illness/foot) hasn\'t trained. # FFScout # FPL # HTAFC'
82: b'Pellegrini on Jack Wilshere: "We are going to give him the time to recover 100 per cent. Maybe next week he will start doing some work on the pitch, but we want him to be 100 per cent." # FFScout # FPL # GW30 # WHUFC'
83: b'See our # GW30 Q&A with @ FootballAdvice5 for thoughts on Which to target Is it time for a Vardy Party Best mid-priced midfielder Keep or sell players Best option for the weekend # FPL # FPLCommunityhttp://www.footballadvice.co.uk/gw30-fpl-guest-question-and-answer/ \xe2\x80\xa6'
84: b'Pellegrini on Manuel Lanzini: "It wasn\'t my original idea as I wanted him to play 65-70 minutes maximum but he said he was OK and he worked without any problems and played the whole game. He is ready to go again." # FFScout # FPL # GW30 # WHUFC'
85: b'Manuel Pellegrini: "Cresswell worked with the team the last two days so he won\'t have any problems. Balbuena played 45 minutes for the under-23 team on Monday, also without any problems. I think they are both available for selection." # FFScout # FPL # GW30 # WHUFC'
86: b'# GW30 Guest Q&A article We are joined by regular @ LetsTalkSoccer2 tackling your questions: Time to sell Wolves assets? Vardy or Higuain? Buy Bournemouth? Best mid priced GW31 midfielder Captaincy pick http://www.footballadvice.co.uk/gw30-fpl-guest-question-and-answer/ \xe2\x80\xa6 # FPL # FPLCommunity'
87: b'Who to bench? # FPL # GW30'
88: b'Planning my FPL chip strategy like. # FPL # BGW # DGW # GW30 pic.twitter.com/16hMeYIcio'
89: b'Stepping in for @ ColmVHayes to discuss the GW30 fixtures for @ thestatszone @ fantasy_bet @ solelyfpl @ FPL_BoxToBox @ FPLPlayer_ @ FPLFairy @ FPL_Heisenberg @ FPL_Womble @ ColFpl @ FPLDougal @ fplchancer @ FPL_Connect @ FRemotebot TY all https://www.thestatszone.com/fpl-gameweek-30-the-fixtures-18-19 \xe2\x80\xa6 # FPL # GW30'
90: b'Player Status Change Longstaff MF NEW 4.5 # FPL # GW30 http://www.fpl247.com'
91: b'Who to play? # gw30 # fpl'
92: b'RT @ FFScout: Newcastle United confirm that Sean Longstaff is likely to miss the rest of the season with a knee ligament injury. # FFScout # FPL # GW30 # NUFC'
93: b'Newcastle United confirm that Sean Longstaff is likely to miss the rest of the season with a knee ligament injury. # FFScout # FPL # GW30 # NUFC'
94: b"NEW POST - Paul Williams 'Diary of an FPL Manager' \xe2\x80\x93 Chip Strategy Paul finished with an OR of 412 last season, 1,382 in 16/17 & 7,164 in 15/16 https://www.fantasyfootballgeek.co.uk/paul-williams-fpl-manager-chip-strategy/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW30 # eplfantasy # fplmy # fplus # fplislifepic.twitter.com/VUWq99qCCN"
95: b'We\xe2\x80\x99ve hit 1500 followers on twitter! Thanks so much for the support Cheers to you all! On to # gw30 # fpl pic.twitter.com/KLkYEySte6'
96: b'Latest column is up on @ Rotoworld_PL # GW30 # FPL https://twitter.com/Rotoworld_PL/status/1103578500693401601 \xe2\x80\xa6'
97: b'Most Transferred out Today 1) Aubameyang FW ARS 10.9 2188 2) Jim\xc3\xa9nez FW WOL 6.9 1878 3) Rashford FW MUN 7.7 1791 4) Bamba DF CAR 4.7 1659 5) Son MF TOT 8.8 1449 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
98: b'Most Transferred in Today 1) Lukaku FW MUN 10.7 3199 2) Alexander-Arnold DF LIV 5.5 2127 3) Zaha FW CRY 6.9 1838 4) Rice DF WHU 4.6 1580 5) Brooks MF BOU 5.0 1411 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
99: b"NEW # FPL ARTICLE Ahead of the # GW30 transfer deadline, have a look at @ James_FPL's eye test review of some key performers from GW29! Includes a couple of Chelsea players and a United star who is back in the frame!https://wp.me/parXFx-iq"
100: b'Press conference times Siewert - 12:30pm Pochettino - 12:30pm Pellegrini - 12:30pm Parker - 1pm Hughton - 1:30pm Rodgers- 1:30pm Hasenh\xc3\xbcttl - 2pm Silva - 3pm Garcia - 5pm Sarri - Post-match # FPL # FFScout # GW30'
101: b'Top Form Players before # GW30 8.5 (\xc2\xa3 6.8m) Mkhitaryan 8.5 (\xc2\xa3 5.6m) Deulofeu 8.0 (\xc2\xa3 6.9m) Zaha 7.8 (\xc2\xa3 6.0m) Alisson 7.3 (\xc2\xa3 5.9m) Deeney 7.0 (\xc2\xa310.7m) Lukaku 7.0 (\xc2\xa3 5.5m) Alexander-Arnold 6.5 (\xc2\xa3 6.2m) Wood 6.5 (\xc2\xa3 4.9m) Matip # FPL # FPLCommunitypic.twitter.com/uaOKH05rhc'
102: b'# GW30 Guest Q&A dropping today It\xe2\x80\x99s a good one so be sure to check it out! # FPL # FPLCommunity'
103: b'This lent instead of giving something up why not add a new # FPL Pod to your rotation. It will still feel like a punishment to some # GW30 https://twitter.com/RenegadesFpl/status/1103318189163851776 \xe2\x80\xa6'
104: b'Overnight price fallers Aurier DF TOT 5.7 Lookman MF EVE 5.0 # FPL # GW30 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
105: b'@ FFScout_Paul, @ FFScout_Joe, @ SkontoRigga and Peter Kouwenberg have each drawn up an 18-man squad ahead of the Scout Picks selection on Friday. You can read which # FPL players they have backed to shine in # GW30 here: https://www.fantasyfootballscout.co.uk/2019/03/07/the-scout-squad-for-fpl-gameweek-30/ \xe2\x80\xa6'
106: b'Overnight players unavailable Bailly DF MUN 5.0 # FPL # GW30 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
107: b'# LEGIONSOFPOOM # GW30 Top rope - Mad Son Count out - Old Son Ringleader - Mad Son OR - 107k # FPL pic.twitter.com/dTDhc185nN'
108: b'Take the Hit # FPL Podcast Ep 24 is live - # GW30 The horror of # GW29 Our VAR solution Sticking to the plan The Fridge is back Gone with the wind TC City options Futsal stories Undertaker @ FPLFujtown https://itunes.apple.com/au/podcast/fpl-take-the-hit/id1436811882 \xe2\x80\xa6 # FantasyFootball # FantasyPL'
109: b'Unpopular opinion: Fight me. # FPL # GW30 pic.twitter.com/5E9QHktpQ1'
110: b'Price Changes (3/7/2019) Risers: - Fallers: Lookman \xc2\xa35.0m Aurier \xc2\xa35.7m # FPL # GW30 # FPL_Price'
111: b'FPL OFFICIAL Price Changes (3/7/2019) Overnight Risers: None Overnight Fallers: Lookman \xc2\xa35.0m Aurier \xc2\xa35.7m # FPL # GW30 # FPL_PriceChanges # Aye'
112: b'# MistarGawang episode ke-39 . . . . . Segera rilis!! . . # FPL # GW30'
113: b'@ OfficialFPL Price Changes (645 am IST - 7th Mar 2019) Price Rises: None Price Drops: Aurier # COYS \xc2\xa35.7 Lookman # EFC \xc2\xa35.0 # FFEPriceChanges # FPL # GW30'
114: b'Player Status Change Bailly DF MUN 5.0 # FPL # GW30 http://www.fpl247.com'
115: b'Rashford close to a price drop despite scoring the game winning pen # FPL # FPLCommunity # gw30'
116: b'123rd EPISODE OF THE # FPL SURGERY PODCAST!! The Surgeons are joined by @ ellisiantheory 3 time top 10k finisher in # FPL and Moolah owner seed. We discuss Salah/Bournemouth/Leicester/Value and the all important captain decision https://soundcloud.com/fplsurgery/123rdEpi \xe2\x80\xa6 # upthepod # GW30'
117: b'Gameweek 30 Ones to watch: David Brooks via @ premierleague # FPL # GW30 # BGW31https://www.premierleague.com/news/1087190'
118: b'Cannot be selling any United players after that! Good luck Arsenal!!! # fpl # gw30'
119: b'The @ FPLWildCats are now # Live on @ YouTube Come chat all things # FPL # GW30 & the Chip Strategies with us now: https://www.youtube.com/c/FPLWildCats/live \xe2\x80\xa6'
120: b"If you haven't made up your mind yet about your strategy for the upcoming BGW & DGW, I think you'll go crazy. So many strategies floating around is mind boggling. Glad I sorted myself out early # FPL # GW30"
121: b'NEW POST - Fantasy premier league GW30 captain poll \xe2\x80\x93 plus a transfer in and out poll Who will be your captain for GW30 and who are you transferring in and out? https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-gw30-captain-poll-transfer/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW30 # eplfantasy # fplupdates # Fpluspic.twitter.com/xF391mGGW4'
122: b'Continuing with # FFETrivia for # GW30 we captured the \xe2\x80\x9cform factor\xe2\x80\x9d of # PremierLeague teams from a # FPL point of view! Probably this will make u final transfers before the deadline! pic.twitter.com/Svu7twDPBt'
123: b"Here's my # GW30 # FPL team. Considering Shaw > Chilwell but would create benching headache. So probably gonna bank transfer. Plenty to ponder between Salah or Sterling captain! # FantasyPLpic.twitter.com/8qDIKVnfGo"
124: b'SUPER DIFFERENTIAL! Lanzini offers probably the best differential factor of anybody in FPL right now. Less than 0.2% owned (at time of writing), he is West Ham\xe2\x80\x99s key playmaker and had prime fixtures vs Cardiff & Huddersfield to demonstrate that. # FPL # GW30 # FPLCommunitypic.twitter.com/0xRYL4kbFa'
125: b'With JNO making it clear that he was planning on moving on Rashford and Aguero by # GW31 , news is now coming to us that Joshua King & Ashley Barnes have joined the shortlist as their replacements. # FPL # GW30 # teamflockpic.twitter.com/BhxJloXg8U'
126: b'6 potential captains.. nice problem to have.. Who would be you Captain & Vice? # GW30 # FPL # Salah # Aguero # Hazard # Mane # Brooks # Vardy pic.twitter.com/jyvjAeWan4'
127: b'So many options to pick from ahead of # GW30 deadline. I want a Leicester, Chelsea & Bournemouth player in a 3-move transfers but I get priced out of all the combinations I have put together so far # FPL'
128: b'NEW CAPTAIN METRIC ARTICLE We crunch the stats on Salah v Sterling v Ag\xc3\xbcero and provide 2x differential captain options Find out all the relevant underlying numbers and who wins the metric here # GW30 # FPL https://fplconnect.blog/2019/03/06/fpl-captain-metric-gameweek-30/ \xe2\x80\xa6'
129: b'Most Transferred out Today 1) Bamba DF CAR 4.7 5727 2) Aubameyang FW ARS 10.9 5464 3) Rashford FW MUN 7.7 5393 4) Jim\xc3\xa9nez FW WOL 6.9 4577 5) Doherty DF WOL 5.5 4249 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
130: b'Most Transferred in Today 1) Alexander-Arnold DF LIV 5.5 6418 2) Zaha FW CRY 6.9 5514 3) Rice DF WHU 4.6 4839 4) Man\xc3\xa9 MF LIV 9.8 3973 5) King FW BOU 6.5 3834 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
131: b"So with three attacking blanks since Kane's return, should I play, bench or sell Son? # FPL # FPLCommunity # GW30 pic.twitter.com/OkIkiGqkLF"
132: b'\xd8\xa7\xd9\x84\xd9\x84\xd9\x8a \xd8\xb9\xd9\x86\xd8\xaf\xd9\x87 \xd8\xa7\xd9\x8a \xd8\xa7\xd8\xb3\xd8\xaa\xd9\x81\xd8\xb3\xd8\xa7\xd8\xb1 \xd8\xa7\xd9\x88 \xd9\x8a\xd8\xa8\xd9\x8a \xd9\x86\xd8\xb5\xd8\xa7\xd9\x8a\xd8\xad \xd9\x84\xd9\x84\xd8\xac\xd9\x88\xd9\x84\xd8\xa9 \xd8\xa7\xd9\x84\xd8\xac\xd8\xa7\xd9\x8a\xd8\xa9 30 \xd9\x8a\xd8\xaa\xd9\x81\xd8\xb6\xd9\x84 \xd8\xa7\xd9\x84\xd8\xad\xd9\x8a\xd9\x86 \xd9\x85\xd9\x88 \xd9\x8a\xd8\xac\xd9\x8a \xd9\x82\xd8\xa8\xd9\x84 \xd8\xa7\xd9\x84\xd8\xaf\xd9\x8a\xd8\xaf\xd9\x84\xd8\xa7\xd9\x8a\xd9\x86 \xd8\xa8\xd8\xb3\xd8\xa7\xd8\xb9\xd9\x87 \xd9\x88\xd9\x84\xd8\xa7 \xd8\xb3\xd8\xa7\xd8\xb9\xd8\xaa\xd9\x8a\xd9\x86 \xd9\x8a\xd9\x82\xd9\x88\xd9\x84 \xd9\x88\xd8\xb4 \xd8\xa7\xd8\xb3\xd9\x88\xd9\x8a \xd9\x81\xd9\x8a \xd8\xaa\xd8\xb4\xd9\x83\xd9\x8a\xd9\x84\xd8\xaa\xd9\x8a \xd9\x85\xd8\xa7 \xd9\x8a\xd9\x85\xd8\xaf\xd9\x8a \xd8\xa7\xd9\x84\xd8\xad\xd9\x8a\xd9\x86 \xd8\xae\xd8\xb0 \xd8\xb1\xd8\xa7\xd8\xad\xd8\xaa\xd9\x83\xd9\x83 \xd9\x88\xd8\xae\xd8\xa8\xd8\xb1\xd9\x86\xd8\xa7 \xd8\xb9\xd9\x86 \xd8\xa7\xd8\xb3\xd8\xaa\xd9\x8a\xd8\xb1\xd8\xa7\xd8\xaa\xd9\x8a\xd8\xac\xd9\x8a\xd8\xaa\xd9\x83 \xd9\x84\xd8\xac\xd9\x88\xd9\x84\xd8\xa7\xd8\xaa \xd8\xa7\xd9\x84\xd8\xa8\xd9\x84\xd8\xa7\xd9\x86\xd9\x83 \xd9\x88\xd8\xa7\xd9\x84\xd8\xaf\xd8\xa8\xd9\x84 \xd8\xb9\xd9\x86 \xd9\x86\xd9\x81\xd8\xb3\xd9\x8a \xd8\xb1\xd8\xa7\xd8\xad \xd8\xa7\xd9\x83\xd8\xaa\xd8\xa8 \xd9\x84\xd9\x83\xd9\x85 \xd8\xae\xd8\xb7\xd8\xaa\xd9\x8a \xd8\xaa\xd8\xad\xd8\xaa \xd9\x87\xd8\xa7\xd9\x84\xd8\xaa\xd8\xba\xd8\xb1\xd9\x8a\xd8\xaf\xd8\xa9 # FPL # GW30 pic.twitter.com/n0z65X1mWh'
133: b'Quick Captain Poll Are people confident enough to captain Salah for GW30? Burnley have only kept 2CS in their last 10GW, but... Salah has only score 1 Goal in his last 6GW. Who is brave enough to give him the armband this week? # FPL # GW30 # FPLCommunity'
134: b'Fantasy Premier League - My FPL Team 2018/19 Blank Gameweek 30 - Transfer Thoughts https://youtu.be/_9r5QDefQEk # fpl # gw30 # gw31 # bgw31 # fplcommunity # fantasypremierleague # teamflock # fpltodaypic.twitter.com/tywFNM3Y1W'
135: b"Hector Bellerin (knee), Rob Holding (knee) and Danny Welbeck (ankle) are Arsenal's only injury-related absentees for their Europa League match against Rennes, though Alexandre Lacazette is still suspended. # FFScout # FPL # GW30 # ArsenalFC"
136: b'Maurizio Sarri has no injury concerns ahead of Chelsea\'s game against Dynamo Kyiv, though added that some of his players are "tired". # FFScout # FPL # GW30 # ChelseaFC'
137: b'Episode 16 # GW30 We started this one stone cold sober, went on a night out mid pod & finished it completely hung over. It was a slog Appreciate all listens/shares/feedback & as always we stand over the content despite the chaotic delivery Cheers # FPL https://open.spotify.com/show/3USE27LntiiUXwrXBVPb9c \xe2\x80\xa6'
138: b"Don't miss this week's # GW30 deadline!! 9 Mar 11.30am UK Time 9 Mar 7.30pm SG/MY Time # FPL # FPLCommunity"
139: b'Who is your # GW30 captain? \xe2\x80\xa2\xe2\x80\xa2\xe2\x80\xa2 # premierleague # fantasypremierleague # fplcommunity # fantasypl # fpl # fantasyfootball # football # soccer # futbol # liverpool # manchesterunited # mancity # arsenal\xe2\x80\xa6 https://www.instagram.com/p/Buq17IeBAmG/?utm_source=ig_twitter_share&igshid=x6hslqqn2389 \xe2\x80\xa6'
140: b"We're just 10 days away from the carnage of BGW31.... And 11 days away from the next international break ... # FPL # GW30 # fplcommunitypic.twitter.com/YQd30cQFRR"
141: b"Help with my next transfers! # FPLCommunity # GW30 # FPL Here's my team: Guaita Robertson, pereira, wan B Salah(C), mane, hazard, pogba Auba, Jimenez, rondon Subs: foster, bednarek, torreira, Bennett"
142: b'Check our # GW30 # FPL Preview Worth a read, plenty of info to help transfers! Tips, wisdom and lol\xe2\x80\x99s Happy reading! # epl # gameweekpreviewhttps://fpltakethehit.com/gameweek-preview/ \xe2\x80\xa6'
143: b'After successfully recommending Mkhitaryan (3rd time lucky), the scout has gone mad and gone for Steve Mounie (inb4 he scores a hattrick at the weekend ) # FPL # GW30 https://twitter.com/OfficialFPL/status/1103285537178296321 \xe2\x80\xa6'
144: b"The fixtures are piling up for Spurs after they qualified for the Champions League quarter-finals. Here's how their # FPL schedule is shaping up after the international break and where rotation could potentially occur: https://www.fantasyfootballscout.co.uk/2019/03/06/spurs-set-for-a-busy-april-after-finishing-job-in-dortmund/ \xe2\x80\xa6 # GW30 # THFC"
145: b"Brooks' return offers arguably the best bargain enabler til the end of the season. Priced perfectly at 5.0m, he offers Fraser\xe2\x80\x99s return potential for 1.1m cheaper. 1 goal & 3 assists in his 5 games prior to injury, he could repeat this form once again. # FPL # GW30 # FPLCommunitypic.twitter.com/jeCFmVFPRa"
146: b'NEW POST - Andrew Ferguson @ Fergi222 reviews his GW29 teams in # FPL, TFF, Sky & Sun + outlines his plans for # GW30 Andrew finished top 1k in TFF, Sky & FPL + 15k in Sun in 17/18. https://www.fantasyfootballgeek.co.uk/gw30-fantasy-football-tips-andrew-ferguson/ \xe2\x80\xa6 # sundreamteam # telegraphfantasyfootball # skysportsfantasyfootballpic.twitter.com/bI9xICFbyP'
147: b'Tonight\xe2\x80\x99s the night! The @ FPLWildCats will be # LiveStreaming around 8:30pm Discussing all things # fpl # GW30 and chip strategies in the # FantasyPremierLeague! Any questions for the panel or the polls? We\xe2\x80\x99d love to hear them pic.twitter.com/HbpiPjcI4R'
148: b'Blank gameweek planning, chip strategy, Bournemouth assets, GW30 captain picks & plenty more discussed in our latest FPL podcast Thanks to @ MatthewJHolmes, @ ZGalliford, @ RyanMullan86 & @ davidevans for sending in your questions Listen herehttp://bit.ly/2H2HO6Q # FPL # GW30'
149: b'Jimi or Hayden to start in my XI for # GW30 ? @ FootballAdvice5 @ FPLSecrets @ SecretFPLplayer @ FantasyPLWolf @ QueenBanger @ LetsTalkSoccer2 # fpl # FPLCommunitypic.twitter.com/fUQdCXMszo'
150: b'Submit your poll suggestions here https://www.fantasyfootballscout.co.uk/2019/03/06/introducing-fpl-think-tank/ \xe2\x80\xa6 # FPL # FantasyPL # GW30'
151: b'Who should be benched for Gw30 # fpl # gw30'
152: b'# gw30 # fpl thoughts?? pic.twitter.com/srmR9EQGf4'
153: b'Most Transferred out Today 1) Bamba DF CAR 4.7 1724 2) Rashford FW MUN 7.7 1520 3) Aubameyang FW ARS 10.9 1417 4) Doherty DF WOL 5.5 1194 5) Jim\xc3\xa9nez FW WOL 6.9 1171 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
154: b'Most Transferred in Today 1) Alexander-Arnold DF LIV 5.5 1709 2) Zaha FW CRY 6.9 1458 3) Rice DF WHU 4.6 1337 4) Man\xc3\xa9 MF LIV 9.8 1075 5) King FW BOU 6.5 1038 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
155: b'Overnight price risers Zaha FW CRY 6.9 # FPL # GW30 http://www.fpl247.com/player/price/weekly?change=rise \xe2\x80\xa6'
156: b'Who to captain for gameweek 30 # fpl # FPLCommmunity # gw30'
157: b'Overnight players available Dier MF TOT 4.7 # FPL # GW30 http://www.fpl247.com/player/returning \xe2\x80\xa6'
158: b'Price Changes (3/5/2019) Risers: King \xc2\xa36.5m Alexander-Arnold \xc2\xa35.5m Rice \xc2\xa34.6m Fallers: Salah \xc2\xa313.4m Son \xc2\xa38.8m Llorente \xc2\xa35.3m Price Changes (3/6/2019) Risers: Zaha \xc2\xa36.9m Fallers: - # FPL # GW30 # FPL_Price'
159: b"# FPL 53pts(-4) GW29, OR: 280th # GW30 1FT, Rashford & Jimenez the ones to go for BGW31, probably for Vardy & King. Happy to hold this week, both are against teams in between Europa League last-16 legs. Bournemouth not in great form and can't afford Vardy without a hit. pic.twitter.com/eCw8DZBw9X"
160: b'@ OfficialFPL Price Changes (645 am IST - 6th Mar 2019) Price Rises: Zaha # CPFC \xc2\xa36.9 Price Drops: None # FFEPriceChanges # FPL # GW30'
161: b'Pellegrini is screwing my team. Arnie is getting cameos and Antonio is getting benched. Planning to save my FT for this week. # GW30 # FPLCommunity # FPL # FPLFamilypic.twitter.com/I3LfT2Vg8u'
162: b'Player Status Change Dier MF TOT 4.7 # FPL # GW30 http://www.fpl247.com'
163: b'# FPL # GW30 CAPTAIN PICKS is now online on the Polestar Football youtube channel. # PremierLeague # Gameweek30 # FPLCommunity # FollowThePolestar Click here to watch https://youtu.be/KDZPaUvbLxY pic.twitter.com/xRTSo4yvhB'
164: b'Who to bench? # gw30 # fpl # fplcommunity'
165: b"A lot of things can happen after midweek euro competition games, but here is our # GW30 Dream Team selection! I doubt it'll look the same by Friday evening. # FPL # FPLCommunitypic.twitter.com/zOwKmMvkZN"
166: b'Our preliminary Team to Watch for # GW30 is up! # FPL # FPLCommunitypic.twitter.com/AzDGfuwSS9'
167: b'NEW # FPL VIDEO # GW30 | Liverpool Defence Double-up! https://youtu.be/VTFa4myUlww pic.twitter.com/SjPFv9Efn4'
168: b'At this time, King is only owned by under 7% of FPL managers \xe2\x80\x94 We expect this to grow! With arguably the easiest fixtures between now and the end of the season, facing only 1 Top 6. Averaging over 2 Shots/90, plus pens, we expect him to return points. # FPL # GW30 # FPLCommunitypic.twitter.com/pxkpPG9HHx'
169: b'With # FH32 still the plan for # teamflock , moves are being considered for # GW30 Rashford looks like the man to make way for either Higuain or Vardy depending on his injury. # FPL pic.twitter.com/oj1Pe8hRo2'
170: b'Player Status Change S\xc3\xa1nchez MF MUN 10.0 # FPL # GW30 http://www.fpl247.com'
171: b'What are your plans for Salah over the next few GW\xe2\x80\x99s? # FPL # GW30'
172: b'NEW POST - fantasy premier league \xe2\x80\x93 underlying stats form tables GW30 We rank players and teams by their underlying stats over the last 10 gameweeks https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-form-underlying-stats-gw30/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW30 # eplfantasy # fplMY # fplupdates # fplislifepic.twitter.com/wBXbUHwJTm'
173: b"What's the latest on Callum Wilson? Would be so easy to move from Jimenez to Wilson but without confirmation, it's a pointless move. # FPL # GW30"
174: b"With two Gameweek's now gone with DeAndre Yedlin doing nothing of worth, JNO is already considering moving the right back on. Schar was touted as his replacement but the Suspension tightrope is cause Team # FPL Today to look at other options for # GW30 pic.twitter.com/fbXLBR3QxG"
175: b'| Solskjaer on S\xc3\xa1nchez injury: "It was a bad knee injury so it\'s four or six weeks, hopefully he\'ll recover quickly." # FPL # FantasyPL # FFScout # GW30 # mufc'
176: b'Latest video is up! # FPL # GW30: Team Review (-12 Hit!) & Transfer Plan | Fantasy Premier Leagu... https://youtu.be/aAXS3X-jiTI via @ YouTube'
177: b'Mkhitaryan as a differential? # FPL # GW30 # FPLCommunity'
178: b'Question Time is back to help you prepare for # BGW31 one week early, featuring... @ hailcheaters @ FPLFamily ANSWERS HERE https://www.fantasyfootballscout.co.uk/2019/03/05/fpl-question-time-how-to-prepare-for-blank-gameweek-31/ \xe2\x80\xa6 # FPL # FantasyPL # GW30'
179: b'Most Transferred out Today 1) Rashford FW MUN 7.7 6969 2) Aubameyang FW ARS 10.9 6862 3) Jim\xc3\xa9nez FW WOL 6.9 5163 4) Salah MF LIV 13.4 4965 5) Bamba DF CAR 4.7 4855 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
180: b'Most Transferred in Today 1) Alexander-Arnold DF LIV 5.5 7960 2) Zaha FW CRY 6.8 6990 3) Rice DF WHU 4.6 6439 4) Ag\xc3\xbcero FW MCI 11.8 5278 5) Man\xc3\xa9 MF LIV 9.8 5255 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
181: b'Going off topic here (not a # fpl # podcast) but @ FPL_Dave puts out a great stream and then provides a detailed TLDW text version. Well worth a watch and/or read. # FPLCommunity # GW29 # GW30 # GW31https://www.reddit.com/r/FantasyPL/comments/axctvo/the_monday_after_thoughts_for_gw2930/ \xe2\x80\xa6'
182: b'or possibly Bednerak to Chilwell? # FPL # GW30'
183: b'Any thoughts on my team heading into # GW30 and beyond? Need to get in some more players for the # BGW31, thinking about Doherty to Luiz? Will most likely keep Rashford and Jimenez because of their value... # FPL pic.twitter.com/r8jNasx1rS'
184: b'Fantasy Premier League - My FPL Team 2018/19 Gameweek 30 - Points & Performance https://youtu.be/57-37cjxpXE # fpl # gw30 # gw31 # bgw31 # fplcommunity # fantasypremierleague # teamflock # fpltodaypic.twitter.com/FyWalwKFnM'
185: b'# FPL # GW30 # FPLCommunity Plan change ! Welcome aboard TAA After watching you play in the last 2 games... Back to triple Pool defense! Sorry again Mane...pic.twitter.com/uesTLuWcSl'
186: b"# FPL # GW30 # FPLCommunity My line-up... Can't bench the phenomenon which is Jimenez, so Felipe gets 1st sub. Thinking Sterling Tielemans in # GW31. Would like Brooks instead of Felipe, but that would require a hit.pic.twitter.com/u6xVp1ViNT"
187: b'Player Status Change Bamba DF CAR 4.7 # FPL # GW30 http://www.fpl247.com'
188: b'Looking at selling those Wolves assets? Check out our thoughts in our squad preview http://www.footballadvice.co.uk/fpl-gameweek-30-preview/ \xe2\x80\xa6 # FPL # FPLCommunity # Wolves # Doherty # Jimenez # GW30'
189: b'NEW POST - Fantasy premier league GW29 review \xe2\x80\x93 the best underlying stats from GW29 We look at the players and teams who performed best in GW29 plus highlight players from the weekends lineups https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-gw29-review-only/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW30 pic.twitter.com/Bt0rSo0jK8'
190: b'Ryan Fraser pomimo serii 8 kolejek na blanku, wci\xc4\x85\xc5\xbc jest jednym z najcz\xc4\x99\xc5\x9bciej skupowanych pi\xc5\x82karzy na # GW30 w # FPL! Deadline w sobot\xc4\x99, a ju\xc5\xbc teraz zakupi\xc5\x82o go ponad 30k os\xc3\xb3b. pic.twitter.com/wY4M6CP1rM'
191: b'Podcast Alert - Episode 31 While many managers are suffering an # FPL Hangover after a low-scoring GW29, we both are smiling with green arrows. Elsewhere that dastardly blank GW31 is influencing our transfer thoughts ahead of the # GW30 deadline. https://soundcloud.com/user-768411468/fplhangoverep31 \xe2\x80\xa6'
192: b"Felipe Anderson's underlying stats don't make for great reading, as we discuss in our latest Scout Notes. Also: Lanzini re-enters # FPL radar Possible ban for Snodgrass Schar one YC away from two-game ban Injury updates https://www.fantasyfootballscout.co.uk/2019/03/05/the-key-stats-behind-andersons-poor-form-as-lanzini-catches-the-eye/ \xe2\x80\xa6 # GW29 # GW30 # WHUFC"
193: b'Most # FPL managers must be planning their transfers for # GW30 Some historical stats do make it easy to make ur picks when u r torn between choices! Here\xe2\x80\x99s our latest edition of # FFETrivia Our Picks: 1. # WHU to win 2. @ HKane to score 3. # MCI win & Kun to score, if he startspic.twitter.com/C5O019KMsO'
194: b'Sat: Watford (H) (GW30) Tue: Schalke (H) Sat: Swansea (A) City have the potential to go 4 points clear on Sat evening, they then don\xe2\x80\x99t play in the league again until the 30th vs Fulham (A). Got to assume Jesus starts v Swansea No worries on City rotation for me this # FPL # GW30 pic.twitter.com/zLcWxU2fdD'
195: b'Here\xe2\x80\x99s the # FFEFDR from # GW30 onwards for # FPL managers planning their transfers. Word of caution with respect to # GW32 & # GW33 as fix will get added & removed for sure. Follow the legend @ BenCrellin to know the \xe2\x80\x9cchances of blanks/doubles\xe2\x80\x9d we will also share a post on the same!pic.twitter.com/B5EOcxtiTt'
196: b'Plan for # GW30 # FPL Preparing for bgw. Shaw > TAA Jiminez > King?'
197: b'CAPTAIN POLL With 1 return in his last 6 GWs, will you be putting the armband on Mo? # GW30 # FPL'
198: b'Vote in the latest captain poll https://www.fantasyfootballscout.co.uk/2019/03/05/liverpool-and-man-city-to-contest-gameweek-30-captaincy-debate/ \xe2\x80\xa6 # FPL # FantasyPL # GW30 # lfc # mcfc'
199: b"Sergio Kun Ag\xc3\xbcero have scored 18 goals in the Premier League this season. 15 of these 18 goals have been at home. Next up: WATFORD (H) Think I've just decided my captain for # GW30. # FPL pic.twitter.com/vBD8vXZN29"
200: b'Our site is now updated with the latest # FPL data ready for # GW30 ! Create your own custom graphs on your laptop (all free), including: Mins per Goal or Assist Frequency of Returns Team Comparison Matrix And much more.... http://FPLSecrets.co.uk pic.twitter.com/rKNlTFmCWj'
201: b'# GW30 # fpl who would you Bench? Retweets appreciated!'
202: b'Given the number of votes, people not losing faith in Salah like earlier in the season when he went through a series of blanks before hauling big over the next series of games.. once bitten twice shy I guess. # FPL # Salah # GW30 https://twitter.com/FplFreddo/status/1102699240336310272 \xe2\x80\xa6'
203: b"WHO'S YOUR CAPTAIN FOR # GW30? # FPL"
204: b"Renegades Captain poll # GW30 The usual someone who won't be widely captained but you fancy to bring in the # fpl points. Kirk's - Almiron Willy - Maddison Drew - Jimenez"
205: b'Most Transferred out Today 1) Rashford FW MUN 7.7 2403 2) Aubameyang FW ARS 10.9 2187 3) Jim\xc3\xa9nez FW WOL 6.9 1744 4) Bennett DF WOL 4.2 1708 5) Pogba MF MUN 9.0 1638 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
206: b'Most Transferred in Today 1) Alexander-Arnold DF LIV 5.5 2789 2) Zaha FW CRY 6.8 2420 3) Rice DF WHU 4.6 2088 4) Ag\xc3\xbcero FW MCI 11.8 1730 5) King FW BOU 6.5 1717 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
207: b'Get it while its hot!! # GW30 Operation Marz BreakOut with @ Marz05, @ KylieFPL & @ TheMarpleCurse! # FPL https://soundcloud.com/user-37374889/gw30-operation-marz-breakout?utm_source=soundcloud&utm_campaign=share&utm_medium=twitter \xe2\x80\xa6'
208: b'Overnight price fallers Llorente FW TOT 5.3 Salah MF LIV 13.4 Son MF TOT 8.8 # FPL # GW30 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
209: b'Overnight price risers Alexander-Arnold DF LIV 5.5 King FW BOU 6.5 Rice DF WHU 4.6 # FPL # GW30 http://www.fpl247.com/player/price/weekly?change=rise \xe2\x80\xa6'
210: b'# GW29 review \xe2\x80\xa2 More benched points \xe2\x80\xa2 Last minute move to swap Jota out for Felipe \xe2\x80\xa2 Captain blank \xe2\x80\xa2 4k to 11k overall rank \xe2\x80\xa2 2 FTs ahead of # GW30 \xe2\x80\xa2 Shaw \xe2\x86\x92 TAA \xe2\x80\xa2 Kolasinac \xe2\x86\x92 Rice \xe2\x80\xa2 BGW starters. -4 next week to field . # FPL pic.twitter.com/91MHTE9Bqy'
211: b'# WestHam fans, has Chicharito cemented his status as first team striker, or will Arnie regain his spot ahead of # GW30? # FPL'
212: b'@ OfficialFPL Price Changes (645 am IST - 5th Mar 2019) Price Rises: Rice # WHUFC \xc2\xa34.6 Alexander-Arnold # LFC \xc2\xa35.5 King # AFCB \xc2\xa36.5 Price Drops: Llorente # COYS \xc2\xa35.3 Son # COYS \xc2\xa38.8 Salah # LFC \xc2\xa313.4 # FFEPriceChanges # FPL # GW30'
213: b"It's too early but my # FPL team is ready. Armband might change though. # GW30 # GW31 pic.twitter.com/hx1eemt2W9"
214: b'10 players catching our eye ahead of # GW30. What players are you thinking about for the upcoming weekend? \xe2\x80\xa2\xe2\x80\xa2\xe2\x80\xa2 # premierleague # fantasypremierleague # fplcommunity # fantasypl # fpl\xe2\x80\xa6 https://www.instagram.com/p/BunCy8phy2H/?utm_source=ig_twitter_share&igshid=1hkavnlot3z9c \xe2\x80\xa6'
215: b'# FPL Bought Son at 8.6, hope this is his last fall before # GW30, 99% sure I will sell him before # BGW31https://twitter.com/FPLTracker/status/1102739531693023232 \xe2\x80\xa6'
216: b'Player Status Change Ings FW SOU 5.4 # FPL # GW30 http://www.fpl247.com'
217: b'Good to have them all back together - really cannot get over the fact that someone arranged their wedding during # fpl season smh. # GW30 preview and usual gut punts, whipping boys, clean sheet, captain, and transfer discussion. https://twitter.com/FPLFFFanatics/status/1102668059595010048 \xe2\x80\xa6'
218: b'On The Beach Rating # OTBR, 1st pass, for # GW30: # CRYBHA 2 # CARWHU 2 # HUDBOU 1 # LEIFUL 1 # NEWEVE 1 # SOUTOH 4 # MCIWAT 2 # LIVBUR 4 # CHEWOL 2 # ARSMUN 4 Higher the number the more significant the fixture. # FPL # FPLCommunity @ PlanetFPLPod @ FFScout @ ahopcroft13 @ BenCrellin @ fplkernow :D'
219: b'Fixture and form-based # FPL predictions for # GW30, # GW31 and # GW32 are available nowhttps://fantasyfootballpredictions.uk'
220: b"NEW # FPL THREAD The Cherries are on everyone's lips ahead of the # GW30 fixture swing in their favour Stats thread below looking at Home/Away form and key players. 1/11"
221: b'GW30 clean sheet odds LIV: 54% MCY: 53% CHE: 43% CRY: 43% LEI: 40% TOT: 36% BOU: 35% EVE: 33% NEW: 32% WHU: 32% HUD: 28% ARS: 26% CDF: 25% BRI: 23% MNU: 22% SOU: 19% FUL: 17% WOL: 16% BUR: 8% WAT: 7% (Provided by Betbrain) https://www.fantasyfootballscout.co.uk/comment/19981670 \xe2\x80\xa6 # FPL # GW30 # xCS # xGA'
222: b"Here's my article on captain picks for # GW30 - written drenched in sweat from the Aguero fear # FPL # FPLcommunityhttps://www.thestatszone.com/fpl-gameweek-30-captain-picks-18-19 \xe2\x80\xa6"
223: b"# FPL # GW30 is upon us this weekend and we've got 4 essential (highly owned) captaincy options to choose from. Of these picks, who would get your vote? Aguero, Hazard, Salah or Kane?"
224: b'# MyFPLCaptainsMatchUp This weeks opponent has been nominated, @ FPL_physio will go head-to-head with myself this GW! Each choosing a # GW30 team with no budget to try and outscore each other - abit of fun and extra in-game competition! Let\xe2\x80\x99s do it! # FPL # GW30 pic.twitter.com/gTMZb2ud1n'
225: b"Ahead of # FPL # GW30 this coming midweek, we are happy to have @ WhatheFPL on board as our Fantasy Forecast guests! They'll be taking The Hype Team on in # PL predictions and in selecting a Scout Picks squad. # AllAboardpic.twitter.com/UH19qOyaTb"
226: b'Jota Brooks? -Can\xe2\x80\x99t see Jota sarting both the DGWs -Brooks has no blanks -Saves money -Has potential to get big hauls with some very good fixtures # FPl # GW30'
227: b"*** Ep. 183 - On to # GW30 in a Thick Fog *** A nightmare of a # GW29 sees both hosts in despair. We're trying to figure out what the fuck is going on and we're running out of time to do it. Vamonos. http://fmlfpl.libsyn.com/ep-183-on-to-gw30-in-a-thick-fog \xe2\x80\xa6 # FMLFPL # FPL # FantasyPL # FantasyPremierLeague"
228: b"Chelsea's Fantasy assets are under the spotlight in our latest article. We also reflect on Fulham's improved display ahead of their # GW30 match against Leicester. https://www.fantasyfootballscout.co.uk/2019/03/04/attacking-returns-for-hazard-and-higuain-as-fulham-show-fight/ \xe2\x80\xa6 # FPL # ChelseaFC # FulhamFC # GW29"
229: b'King or rondon for the next few weeks? # FPL # GW30'
230: b'# GW29 was ok with 58 pts # Higuain # Jimenez # Barnes scored but now I focus on defense... So guess my next signing? # GW30 # FPL https://twitter.com/Alonsocm888/status/1102314277417807872 \xe2\x80\xa6'
231: b'# FPL team comparison poll: which # Liverpool triple up will get the most points from # GW30 till the end of the season? (assume both teams will leave the armband on Salah) Van Dijk, Alexander-Arnold & Salah or Robertson, Man\xc3\xa9 & Salah'
232: b"# GW29 results Disgusting gameweek from my team Only two bright spots are the Liverpool's TAA and Wolves Jimenez. The boys are delivering elite results so far Main disappointment - Pogba. As a captain he doubled his -1 point # FPL # FPLCommunity # GW30 # FantasyPLpic.twitter.com/MYDmjfYbn3"
233: b'Player Status Change Dier MF TOT 4.7 Alli MF TOT 8.8 # FPL # GW30 http://www.fpl247.com'
234: b'Fabian Balbuena is set for a playing return this evening. # FFScout # FPL # GW30 # WHUFChttps://twitter.com/WestHamUtd/status/1102629785287700480 \xe2\x80\xa6'
235: b'Spurs report that Harry Winks (hip) and Eric Dier (tonsillitis) have returned to training and have travelled with the squad to Dortmund. Dele Alli (hamstring) is starting to "integrate with first team training", meanwhile. # FFScout # FPL # GW30 # THFC'
236: b"Son > Brooks is the only transfer I'm considering for # GW30 A lot can change in a week, but Sonny is starting to look fatigued and the s have the plum fixture... Got the feeling Brooks will be a top # GW31 target and want to get on early. Thoughts? # FPL # FPLCommunity"
237: b"Currently looking to bring in Boruc for Foster and swap Bednarek to either WHU's Rice or Bournemouth's Smith. Team for # BGW31 almost ready and I am still fielding a fairly strong side in # GW30 # FPL pic.twitter.com/ER37fpnFvr"
238: b'Most Transferred out Today 1) Aubameyang FW ARS 10.9 15417 2) Rashford FW MUN 7.7 13894 3) Salah MF LIV 13.5 11966 4) Bennett DF WOL 4.2 11315 5) Doherty DF WOL 5.5 10650 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
239: b'Most Transferred in Today 1) Alexander-Arnold DF LIV 5.4 19657 2) Rice DF WHU 4.5 14450 3) Zaha FW CRY 6.8 13688 4) Man\xc3\xa9 MF LIV 9.8 11480 5) Ag\xc3\xbcero FW MCI 11.8 10982 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
240: b'NEW POST - fantasy premier GW30 \xe2\x80\x93 some early thoughts on the FFGeek team https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-teams-gw30-early-ffg/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW30 # eplfantasy # fplMY # epl # premierleague # fplupdates # fplislife # fantasypremierleagueislife # FPLus # fpltreviewpic.twitter.com/bzr0MZIZfF'
241: b'@ PlanetFPLPod : Declan Rice is a buy; the next Patrick Vieira. # fpl # podcasts # FPLCommunity # GW30'
242: b'Whom should I transfer in? # FPLCommunity # FPL # GW30 pic.twitter.com/jskCe7UqU7'
243: b'FPL GAMEWEEK 30 PICKS COMPETITION Open for entry, earlier than usual! https://youtu.be/LzDHKfhnsoY via @ YouTube Tweets and content from: @ FPLUpdates_Tips @ Fpl_sentralen @ OptaJoe @ OddsOnFPL @ 360FPL @ HypeTrainStats Thank you all! GW29 winner: @ anustupsikdar # fpl # gw30'
244: b'Fantasy Premier League tips Gameweek 30: Captains # FPL # GW30 http://burp.to/7ey'
245: b'Decided to hold all transfers until deadline day. Fingers are too trigger happy. # FPL # GW30'
246: b'Blanks, Doubles And Captaincy Troubles | Gameweek 30 | FPL 2018/2019 # FPL # GW30 # gameweek30https://youtu.be/p-0fTi69Rnk'
247: b'Who to play for # FPL # GW30?'
248: b'Fantasy Premier League tips Gameweek 30: Forwards # GW30 # FPL http://burp.to/7eu'
249: b'NEW # FPL VIDEO After taking 6 goal attempts against Fulham, Higuain is one of the players added to the Watchlist ahead of # GW30 https://youtu.be/2AxL6RFOf5w pic.twitter.com/LRRW1pHVTw'
250: b"I really don't know who to get IN Everyone looks good to me, maybe Higuain/Lukaku now and Kane in GW33... All 3 looks like a good differential 2 bad GW and I'm overall 220,735 @ FPLFamily @ FPLGeneral @ DannyJamieson @ FFScout # FPLCommunity # FFScout # GW30 # FPL # FantasyPL"
251: b'NEW POST - fantasy premier league GW30 \xe2\x80\x93 analysing the teams of 10 top FPL managers These FPL managers have finished in the top 10k the last 3 seasons https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-transfer-tips-gw30-10-top-fpl/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW30 # eplfantasy # fplupdates # fplislife # FPLuspic.twitter.com/Xs75mQagKb'
252: b'Clean Sheet Probabilities for # fpl # fplcommunity # GW30 https://twitter.com/OddsOnFPL/status/1102319085721960448 \xe2\x80\xa6'
253: b'# GW30 Team Preview We have looked ahead to GW30 and potential transfers for the squad We have also discussed captaincy picks and whether Salah is the main man http://www.footballadvice.co.uk/fpl-gameweek-30-preview/ \xe2\x80\xa6 # FPL # FPLCommunity'
254: b"# GW30 Methinks unless you're really forced to, you should hold on making any moves in the # FPL until the end of the week so as to assess: ->Players like Vardy for whom the extent of injury is unknown. ->Players like Rashford, Son & Lukaku who will play in the Champions League pic.twitter.com/3xThw4OGfK"
255: b'Too good to ignore surely? # FPLCommmunity # FPl # GW30 pic.twitter.com/SII9zSIVop'
256: b'Incoming brace against Huddersfield please # FPL # FPLCommunity # GW30 https://twitter.com/afcbournemouth/status/1102516723989778432 \xe2\x80\xa6'
257: b'Just brought in Arnautovic for # GW30. Can\xe2\x80\x99t decide wether I\xe2\x80\x99ve made a rash call or not fml # FPL # FPLCommmunity'
258: b'# GW30 hattrick confirmed # FPL # FPLCommunity # FantasyPL # afcbhttps://twitter.com/afcbournemouth/status/1102516723989778432 \xe2\x80\xa6'
259: b'Player to feature in plenty of hot topics this week # FPL # FPLCommunity # GW30 https://twitter.com/afcbournemouth/status/1102516723989778432 \xe2\x80\xa6'
260: b'Fantasy Premier League tips Gameweek 30: Midfielders # FPL # GW30 http://burp.to/7ex'
261: b"Last 3 Home Games: Salah - 270 min / 0 / 0 / 0 BPS = pts Aguero - 228 min / 7 / 0 / 9 BPS = pts Next GW30: Salah vs BURNLEY Aguero vs WATFORD Who's your captain? # FPL # GW30"
262: b'# GW29 UPDATE # FPL 34 all out, worst of the season! Beaten by dead teams judging by the 4.7m gw rank. Oh well, a good wk to have a bad one. Hazard cap 6 pts No Jimenez really hurt this wk Points: 1,768 OR: 19,253 from 14,191 Unsure how to salvage this in # GW30! pic.twitter.com/yOLtqG3vzk'
263: b"Here's how our # FPL Secrets league looks for the month of March ahead of # GW30 ... The top 3 managers at the end of the month will share \xc2\xa330 of prizes courtesy of @ starting11app There's still time to enter..! Click to join or enter code: 602-481 https://fantasy.premierleague.com/?autojoin-code=602-481 \xe2\x80\xa6pic.twitter.com/2vP9Io0P88"
264: b'Gameweek 29 Top Players # FPL # GW30 http://fpl247.com/page/39d7b85d-c3ba-4665-8df7-780696cd75ee \xe2\x80\xa6'
265: b'Gameweek 29 Top Teams Transfer Analysis # FPL # GW30 http://fpl247.com/page/ecb8a4ae-af73-489e-8e68-1edc8e73bce2 \xe2\x80\xa6'
266: b'Gameweek 29 Top Teams Player Analysis # FPL # GW30 http://fpl247.com/page/87884a74-f696-4830-8c30-979d4ca344e2 \xe2\x80\xa6'
267: b'Gameweek 29 Top Teams Formation Analysis # FPL # GW30 http://fpl247.com/page/b606b84d-d4dc-4751-9579-0e4c743ede40 \xe2\x80\xa6'
268: b'Fantasy Premier League tips Gameweek 30: Defenders # GW30 # FPL http://burp.to/7ew'
269: b'Most Transferred out Today 1) Rashford FW MUN 7.7 5636 2) Aubameyang FW ARS 10.9 5576 3) Bennett DF WOL 4.2 4623 4) Salah MF LIV 13.5 4453 5) Doherty DF WOL 5.5 4361 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
270: b'Most Transferred in Today 1) Alexander-Arnold DF LIV 5.4 7858 2) Rice DF WHU 4.5 5804 3) Zaha FW CRY 6.8 5452 4) Man\xc3\xa9 MF LIV 9.8 4424 5) Ag\xc3\xbcero FW MCI 11.8 3929 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
271: b'First up in a long rest week, and setting a high bar for the # GW29/ # GW30 # fpl # podcast season slice. @ UtterlyTC does a superb job coming off the bench for Josh. Essential https://twitter.com/hailcheaters/status/1102392855711092737 \xe2\x80\xa6'
272: b"Worried about Salah and co. ahead of # BGW31? We discuss the Liverpool front three's mediocre recent record away from home. https://www.fantasyfootballscout.co.uk/2019/03/04/away-form-a-cause-for-concern-for-liverpools-attacking-assets/ \xe2\x80\xa6 # FPL # GW29 # GW30 # EVELIV # LiverpoolFC"
273: b'Overnight price fallers Barreca DF NEW 4.2 Lucas Moura MF TOT 6.7 Su\xc3\xa1rez MF ARS 6.0 # FPL # GW30 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
274: b'Overnight price risers Higua\xc3\xadn FW CHE 9.6 Man\xc3\xa9 MF LIV 9.8 Robertson DF LIV 6.9 Schlupp DF CRY 4.5 # FPL # GW30 http://www.fpl247.com/player/price/weekly?change=rise \xe2\x80\xa6'
275: b'Overnight players unavailable Vardy FW LEI 8.9 Babel MF FUL 5.5 # FPL # GW30 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
276: b'Overnight players available Firmino FW LIV 9.2 Lerma MF BOU 4.5 # FPL # GW30 http://www.fpl247.com/player/returning \xe2\x80\xa6'
277: b'Another red arrow after not following my gut and instead going for the "Safe and smart" move. Somehow still in the top 50k OR after 6 red arrows in a row. Time to work my way back up!! # FPL # GW30'
278: b'Leave those behind and get ur asst machine running from next week. # FPL # GW30 # FantasyPLhttps://twitter.com/Madders10/status/1102236043246559234 \xe2\x80\xa6'
279: b"Waking up to my 1st # GreenArrow in what feels like forever. Jota as captain was a lovely pick. My team is almost in place for # BGW31. As for # GW30 surely # Salah can't blank again! Can he? # FPL"
280: b'Fantasy Premier League tips Gameweek 30: Goalkeepers # FPL # GW30 http://burp.to/7ev'
281: b"A brutal # GW29 comes to an end and I managed 48 points and a small green arrow. OR 52,583 Despite 3 captain blanks in a row my OR has stayed in the 50ks... treading Double Liv defence and Jimi the postman deliver again. Not sure what I'll do for # GW30 yet... # FPL pic.twitter.com/Dicl8JYr21"
282: b'@ OfficialFPL Price Changes (645 am IST - 4th Mar 2019) Price Rises: Man\xc3\xa9 # LFC \xc2\xa39.8 Robertson # LFC \xc2\xa36.9 Schlupp # CPFC \xc2\xa34.5 Higua\xc3\xadn # CFC \xc2\xa39.6 Price Drops: Lucas Moura # COYS \xc2\xa36.7 Barreca # NUFC \xc2\xa34.2 Su\xc3\xa1rez # AFC \xc2\xa36.0 # FFEPriceChanges # FPL # GW30'
283: b'Pls I need some advice. Is a good idea to buy TAA # LIVWAT # FPL # GW30'
284: b"Pod #163: This week we welcome special guest @ UtterlyTC to recap # GW29 and its captain fails. We also chat about # GW31 transfer targets and how they impact next weekend's # GW30. Plus, a lightning round and a look at our bus teams. # FPL # hailcheatershttps://soundcloud.com/alwayscheating/ep-163-vacation-planning-with-tom-campbell-gw29-30 \xe2\x80\xa6"
285: b'Price Changes (3/4/2019) Risers: Higua\xc3\xadn \xc2\xa39.6m Schlupp \xc2\xa34.5m Robertson \xc2\xa36.9m Man\xc3\xa9 \xc2\xa39.8m Fallers: Su\xc3\xa1rez \xc2\xa36.0m Barreca \xc2\xa34.2m Lucas Moura \xc2\xa36.7m # FPL # GW30 # FPL_Price'
286: b'FPL OFFICIAL Price Changes (3/4/2019) Overnight Risers: Higua\xc3\xadn \xc2\xa39.6m Schlupp \xc2\xa34.5m Robertson \xc2\xa36.9m Man\xc3\xa9 \xc2\xa39.8m Overnight Fallers: Su\xc3\xa1rez \xc2\xa36.0m Barreca \xc2\xa34.2m Lucas Moura \xc2\xa36.7m # FPL # GW30 # FPL_PriceChanges # Aye'
287: b'Aguero Gundohan for Rashford and Sane. # GW30 # FPL Here we go! Wkwk'
288: b'My absolute pleasure to have come off the bench for @ joshlandon tonight, to join @ bskbroiler as his guest on the @ hailcheaters # FPL podcast. Hope you all enjoy it. # HailCheaters # GW30'
289: b"Just finished recording this week's episode with the brilliant and charming @ UtterlyTC as guest co-host. Tom was such a delight. The pod should be up before everyone's Monday morning commute - can't wait for you all to hear it! # FPL # GW29 # GW30 # hailcheaters"
290: b'Jimenez to Arnautovic looks like it could be my # GW30 move... # FPL # FPLCommunitypic.twitter.com/PaxF81Pk7K'
291: b'Want King but don\xe2\x80\x99t really want to lose Rashford or Jimenez... also don\xe2\x80\x99t want to lose Son before Saints. Also need way more blank players.... What would you guys do with this sorry bunch!? # fpl # gw30 pic.twitter.com/oSoVk5sWkv'
292: b'Might be knee-jerk but had to make the changes before price increases... I was planning 2 hits in the next 2 weeks for BGW31, selling Aguero to fund Hazard. Instead I did the following tonight: Rashford Higuain Bennett Rice Lindelof Taylor 0.0 ITB # FPL # GW30 # GW31'
293: b"*When you decided to stick with the Son (2pts)/Mitrovic (2pts) combination, instead of Deulofeu (6pts)/Higuain (8pts)... with the London Derby/ # GW30 in mind)*: Here's hoping next GW will pay off (Son = SOU, Mitrovic = LEI/Deulofeu = MCI, Higuain = wol). # FPL # GW29 # FPLCommunitypic.twitter.com/FhiibhaWhZ"
294: b'Transfers done, can forget about FPL for the week now (only Son playing midweek) Pogba + Rashford > Man\xc3\xa9 + King (no hit) 0.5m left in the bank # FPL # GW30'
295: b'Player Status Change Firmino FW LIV 9.2 # FPL # GW30 http://www.fpl247.com'
296: b'Player Status Change Babel MF FUL 5.5 # FPL # GW30 http://www.fpl247.com'
297: b'Once again Salah (c) let me down. But, hey, not a bad # GW29 I guess. Gotta start planning for # GW30. Most probably will be offloading Doherty, Jota/Pogba # FPL pic.twitter.com/gDZWFivH16'
298: b"After a frantic last 7 days for # FPL players, we've a week to recover before # GW30 next weekend. This is the final round of games before the shortened # GW31 (due to the FA Cup quarter-finals).pic.twitter.com/P65zIjKUF2"
299: b"# Bournemouth 's fixtures from # GW30 onwards look phenomenal. Which striker to pick though? # Wilson close to being fit, arguably better striker. # King the secure choice. Going King only to change to Wilson week or two later feels like a wasted transfer. Thoughts? # FPL"
300: b"The weekend that was in # FPL # GW29. Could have been worse. Quick Review: Pogba + Son + Doherty + Schar = 1 point Liverpool Defense + Vardy # GW30 can't come sooner. pic.twitter.com/zn4m69fI6d"
301: b'Most Transferred out Today 1) Aubameyang FW ARS 10.9 12060 2) Rashford FW MUN 7.7 10863 3) Bennett DF WOL 4.2 10652 4) Son MF TOT 8.9 8622 5) Laporte DF MCI 5.9 8141 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
302: b'Most Transferred in Today 1) Rice DF WHU 4.5 13280 2) Zaha FW CRY 6.8 10770 3) Man\xc3\xa9 MF LIV 9.7 9351 4) Alexander-Arnold DF LIV 5.4 8778 5) Wan-Bissaka DF CRY 4.5 7013 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
303: b'We are podding on Tuesday night with 3 time top 10k finisher in # FPL and Moolah owner @ ellisiantheory Please send over your questions or topics now for # GW30 pic.twitter.com/APrpjX3L6P'
304: b'Jammy auto-subs to further increase the damage of this shit show of a gameweek. Who wants to talk about plans for # GW30 ? I have left this behind me. 2FTs and willing to take a hit, so make that 3 transfers to shake things up. What will you do with these pile of sluts ? # FPL pic.twitter.com/jZJIjXQIUL'
305: b'Player Status Change Vardy FW LEI 8.9 # FPL # GW30 http://www.fpl247.com'
306: b'Struggling to match my # GW27 points tally unless # Salah bangs a brace or more So looking forward to # FPL in # GW30'
307: b'Player Status Change Lerma MF BOU 4.5 # FPL # GW30 http://www.fpl247.com'
308: b'After seeing that Leicester line up, doubting the decision to bring in Higuain over Vardy this week! Vardy was the plan for # GW30, please wait a week to haul # FPL # FPLCommunity # Vardy # Higuain'
309: b'Looks like Pogba + Rashford/ Jimenez > Mane + King next week for me Fairly straightforward, 2 FTs # FPL # GW30'
310: b'Tempted to move Doherty out in prep for BGW31. Was looking at Rice last night, thoughts? @ Philosopey @ CHAMP20NSFC @ FPL_MY # FPL # GW30'
311: b'Good morning managers, ready for a better FPL day? We will be beck recording tomorrow night as @ marz05 @ TheMarpleCurse and @ KylieFpl review the last 2 GWs and preview the upcoming ones.Rage transferring players out?Chip strategy in tatters? Send in your questions # T3A # GW30 # FPL'
312: b'i\xe2\x80\x99ve also plans to triple up on liverpool assets with the addition of either mane or taa. but i feel liverpool\xe2\x80\x99s defence will bring more value & points in the coming gameweeks. so, most likely it\xe2\x80\x99ll be awb > taa for # GW30 # FPL # FPLCommunity'
313: b'# GW29 hasn\xe2\x80\x99t end but I\xe2\x80\x99m already look at # GW30 current thoughts on transfering out rashford & son for -4 hit to either: 1. vardy & fraser 2. king & maddison afraid of rashford minutes with UCL coming up & him playing wide doesnt appeal me. fatigue is catching with son # FPL pic.twitter.com/BlLLetnGq2'
314: b'Most Transferred out Today 1) Bennett DF WOL 4.2 3368 2) Aubameyang FW ARS 10.9 3294 3) Rashford FW MUN 7.7 3252 4) Son MF TOT 8.9 2509 5) Pogba MF MUN 9.0 2441 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
315: b'Most Transferred in Today 1) Rice DF WHU 4.5 3789 2) Zaha FW CRY 6.8 3423 3) Man\xc3\xa9 MF LIV 9.7 2650 4) Alexander-Arnold DF LIV 5.4 2301 5) Wan-Bissaka DF CRY 4.5 2268 # FPL # GW30 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
316: b'Overnight New Players Daly MF HUD 4.5 # FPL # GW30 http://www.fpl247.com/player/newplayer \xe2\x80\xa6'
317: b'Overnight price fallers Hadergjonaj DF HUD 4.3 Hart GK BUR 4.2 Keane DF EVE 4.8 Kepa GK CHE 5.4 Lamela MF TOT 5.9 Markovic MF FUL 4.9 Pereyra MF WAT 6.0 # FPL # GW30 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
318: b'Overnight price risers van Dijk DF LIV 6.6 # FPL # GW30 http://www.fpl247.com/player/price/weekly?change=rise \xe2\x80\xa6'
319: b'Overnight players unavailable Bamba DF CAR 4.7 Torreira MF ARS 4.8 Bennett DF WOL 4.2 Stones DF MCI 5.2 Hogg MF HUD 4.4 S\xc3\xa1nchez MF MUN 10.0 De Bruyne MF MCI 9.7 Longstaff MF NEW 4.5 # FPL # GW30 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
320: b'Overnight players available Vertonghen DF TOT 5.9 Ralls MF CAR 4.6 Masuaku MF WHU 4.3 # FPL # GW30 http://www.fpl247.com/player/returning \xe2\x80\xa6'
321: b'@ OfficialFPL Price Changes (645 am IST - 3rd Mar 2019) Price Rises: V Dijk # LFC \xc2\xa36.6 Price Drops: Pereyra # WatfordFC \xc2\xa36.0 Lamela # COYS \xc2\xa35.9 Hadergjonaj # HTAFC \xc2\xa34.3 Markovic # FFC \xc2\xa34.9 Keane # EFC \xc2\xa34.8 Kepa # CFC \xc2\xa35.4 Hart # Clarets \xc2\xa34.2 # FFEPriceChanges # FPL # GW30'
322: b'FPL OFFICIAL Price Changes (3/3/2019) Overnight Risers: van Dijk \xc2\xa36.6m Overnight Fallers: Hart \xc2\xa34.2m Kepa \xc2\xa35.4m Keane \xc2\xa34.8m Markovic \xc2\xa34.9m Hadergjonaj \xc2\xa34.3m Lamela \xc2\xa35.9m Pereyra \xc2\xa36.0m # FPL # GW30 # FPL_PriceChanges # Aye'
323: b'Price Changes (3/3/2019) Risers: van Dijk \xc2\xa36.6m Fallers: Hart \xc2\xa34.2m Kepa \xc2\xa35.4m Keane \xc2\xa34.8m Markovic \xc2\xa34.9m Hadergjonaj \xc2\xa34.3m Lamela \xc2\xa35.9m Pereyra \xc2\xa36.0m # FPL # GW30 # FPL_Price'
