1: b"So big double # GW32 in # FPL for me this week! I'm currently in the top 1k in Ireland and in the top 21k overall. And it's my very first year playing fantasy football. Showing the lads how it's done # girlpower # FantasyFootball # FPL"
2: b'# FPL # FPLCommunity # FantasyPL # GW32 https://twitter.com/RotationFPL/status/1111626108141752323 \xe2\x80\xa6'
3: b'# FPL # FPLCommunity # GW32 # DGW32 12 hours.pic.twitter.com/MlOfTv8zAK'
4: b'Who should i TC Will Sterling be rotated # FPL # DGW32 # GW32 # PL # FantasyPL'
5: b'Transfers to be ready for # GW32 FH in # GW31 and WC tomorrow so very boring evening.... # FPL'
6: b"Trippier might be one more to consider with Aurier\xe2\x80\x99s injury he should start both games and is at the heart of spurs chances created over the past few games in fact better then all double game week defender's. Enjoy this long double game week everyone. # FPL # GW32 # DGW32"
7: b'If you are looking for differentials then look at defenders, In past double game weeks, defender\xe2\x80\x99s have scored well, even the recent DGW25 Laporte got 20 points Duffy, Schlupp, Laporte, Azpilcueta & Young are the ones that standout. # FPL # GW32 # DGW32'
8: b'However with a fully fit squad to select from there is a possibility that Sterling might get a rest in 1 game Differential Having 11 player\xe2\x80\x99s actually starting is more then enough differential. Don\xe2\x80\x99t take risks, try to select as many template players as possible # FPL # GW32'
9: b'Captains Aguero is the standout captain choice this week, he is rarely rotated when fit. He is no longer selected by Argentina so he is fresh Sterling is a good differential captain pick, he is great form & consistent a performer against teams fighting relegation. # FPL # GW32'
10: b"Lacazette has got attacking returns in 8 out his last 10 games, that's consistency just like Mane. Arsenal\xe2\x80\x99s home form is great and play Newcastle who generally struggle away in London games especially games against Arsenal # FPL # GW32 # DGW32"
11: b'Single game week players We have seen many times in past some single game players outscoring double game week players. 2 players to watch: Mane is in great form and is a big game player, Liverpool need the win and Mane has been the talisman is recent games. # FPL # GW32 # DGW32'
12: b'Those playing FH will probably not want Jimenez to start both games as he will already be in most active teams that aren\xe2\x80\x99t playing their FH this week. Expect rotation in the other positions for Wolves. # FPL # GW32 # DGW32'
13: b'Foster could be great punt, when Watford keep clean sheets, he invariably gets bonuses too Wolves (bur, MUN) The big question is will Jimenez start both games, with the lack of options up front for Wolves I think Jimenez starts both games and subbed early # FPL # GW32 # DGW32'
14: b'Watford (mun, FUL) Watford play their 2nd game on Tuesday then FA Cup the following Sunday, just like their FA cup opponents Wolves. How much rotation will we see is anyone guess, Deeney & Deulofeu might only start one game. Which diminishes their appeal # FPL # GW32 # DGW32'
15: b'Son was in form when Kane was injured but he has tailed off recently. Alli has recently returned from injury so its hard to tell. I would go for Kane or no spurs attacker at all # FPL # GW32 # DGW32'
16: b'Spurs(liv, CRY) The obvious Spurs target is Kane who has 3 gaols in 4 PL games but a lot can\xe2\x80\x99t afford him unless they sacrifice somewhere else in the team. Can Kane be covered by Alli or Son, I\xe2\x80\x99m not too sure. # FPL # GW32 # DGW32'
17: b"No cleansheets in 3 games but 5 out 7 clean sheets before that, it will help united's clean sheet prospects now that Herrera is back fit and if Matic recovers too. Young would be my pick in defence due to his attacking threat as he takes free kicks and corners # FPL # GW32 # DGW32"
18: b'FPL GW32 Preview (pt 2) Man Utd (WAT, wol) Lukaku, Rashford & Martial are all injury doubts yet spotted at the team hotel. It might be a gamble worth taking with one of them Pogba will likely be in most teams, some manger\xe2\x80\x99s might also be tempted by a united defender # FPL # GW32'
19: b'Man U posted this only a few hours ago. Surely he plays # fpl # gw32 https://twitter.com/ManUtd/status/1111709358230925312 \xe2\x80\xa6'
20: b'NEW POST - fantasy premier league \xe2\x80\x93 the FFGeek free hit team for GW32 https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-team-selection-gw32-ffgeek-team/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW32 # DGW32 # freehitpic.twitter.com/cQSyVc4IS9'
21: b'Team: Can anyone guess my Free Hit # GW32 Team?? # FPL # FPLCommunity'
22: b"So turns out my # GW32 Free Hit draft was pretty much my final team. Simple enough; 3 MCI 3 MUN 3 CHE + think CRY next most reliable; tried to go for players most likely to get 180 mins. First time I've owned Ag\xc3\xbcero (c) all season, what riches await? GL all! # fpl # DGW32pic.twitter.com/kB5pcIRZez"
23: b'Depending on your team setup/strategy, what\xe2\x80\x99s your # GW32 ? # FPL # FF # GW32 # FPLCommunity'
24: b'The worst possible time to play a chip is B4 an international break....spent 2 weeks of tinkering and came out with this.. PS: I know that Shaw on 9 yellows. # FreeHit # GW32 # FPL pic.twitter.com/E6G97E4CSP'
25: b'Want to know why Harry Kane is worth the outlay? Check out my # DGW32 article for @ FFEyeTest # FPL # FPLCommunity # GW32 https://wp.me/parXFx-ko'
26: b'Spotted at the Man Utd team hotel... # FFScout # FPL # GW32 https://twitter.com/SimonPeach/status/1111740969743990791 \xe2\x80\xa6'
27: b"Think I'm pretty much there with the free hit final draft. Oh if only I could use my TC this week as well # FPL # FPLCommunity # GW32 # DGW32pic.twitter.com/lbTT18bcxy"
28: b'After two weeks of lineup tinkering and last two days of press conferences, my team has come to this # fpl # gw32 pic.twitter.com/VouU21ihvE'
29: b'Okay FH draft comes down too these 3 combinations... Which combo scores more? # fpl # FPLCommunity # GW32'
30: b'# FPL # FPLCommunity # FantasyPL # GW32 # upaskvighttps://twitter.com/artmed2804/status/1111675327443595265 \xe2\x80\xa6'
31: b'Countries visited & # GW32 # FPL (home) pic.twitter.com/Tj0dRRcQUu'
32: b'Lindelof v Young Who\xe2\x80\x99s the best pick for both? But own team budgets and bias away! # fpl # fplcommunity # gw32'
33: b'In case you missed it, you can now register on our website for free and have your team evaluated by Algo! # FPL # FPLCommunity # GW32 # DGW32https://www.foomnianalytics.com/signup.php'
34: b"Strap yourselves in, it's going to be a long week! Good luck everyone! # FPL # GW32"
35: b'Two weeks of tinkering and it\xe2\x80\x99s more or less the team I first thought of. # FPL # GW32 # DGW # FHC # 11Eggs4Baskets # 15Eggs6Baskets # ColourCoordinatedpic.twitter.com/HU86VBUHPi'
36: b'Top differential picks ahead of # GW32! # DGW32 # FPL # FPLCommunitypic.twitter.com/qTf14uae3l'
37: b'Burnley By @ ClaretFpl # FPL # BurnleyFC # twitterclarets # GW32 pic.twitter.com/1AEGnh2QZz'
38: b'Any other # Pogba \xc2\xa9 # FPL # GW32 managers out there in the # FPLCommunity ? Or am I a .....pic.twitter.com/0dlIk9ZAFL'
39: b'Newcastle By @ MikePerren # FPL # NUFC # GW32 pic.twitter.com/t2miblAyBD'
40: b'# FPL # GW32 # FPLCommunity Team Locked Ready for # DGW32 - hopefully no more tinkering with this squad..pic.twitter.com/JmclzbloJ1'
41: b"Show Me The Mane in 5th plays 11th placed Michybishi FC while Team mohammedfazli faces off against an all but relegated Bojan Horseman FC. Things are cooking in the league's # RaceToThePlayoffs *Teams have qualified for playoffs. # LCKFC # GW32 # FPL # FantasyPL # EPL # Fantrax"
42: b'Bench boost or triple captain? Just one double on the bench, but Aguero looking a good bet.. # fpl # gw32 # stillwaitingforanursetoseeifineedanxraypic.twitter.com/6BGDVYXAcg'
43: b'Lindelof is not listed in the travelling squad. Lukaku, however is. # FPL # DGW32 # GW32'
44: b'Sharing one final time for the Friday night crowd. Good luck to everyone this weekend! # FPL # GW32 # hailcheatershttps://twitter.com/hailcheaters/status/1111621350593040385 \xe2\x80\xa6'
45: b'Current # DGW32 / # GW32 draft, what do you think?? Not completely decided on Kane...could look to downgrade to Batshuayi and upgrade Knockaert to Son # FPL pic.twitter.com/ZJBKtUCZzG'
46: b'My FPL team # gw32 pic.twitter.com/wni3Aa50PO # FPL via @ FantasyFootyFix'
47: b'How to get 0.1?! I think Hazard will cover Higgy... Any 4.3 defenders to consider? Also really like Young as a punt, and good stats for attacking! Thoughts? # fpl # FPLCommunity # gw32 pic.twitter.com/ekKNUbuich'
48: b'Should be a good game week # gw32 # fpl pic.twitter.com/NpI1IYs9TG'
49: b'Kr\xc3\xb3tka pi\xc5\x82ka, 442 czy 352? # jakgractoznajlepszymi # fpl # gw32 # dgw32pic.twitter.com/pivqIRpitS'
50: b"# FPL Free Hit Draft for # GW32 Kane is a monster expense but I can see him scoring in both matches and feel he's safe for minutes. Had to drop Pogba/Higuain to afford but I prefer the Chelsea double D and I like the shots on Townsend/Jota to supplement Sterling and Haz pic.twitter.com/BVXK35oprN"
51: b'Who takes the final city spot, its between DSilva, Ederson & Laporte. Ederson is nailed on whilst the other 2 could be rested in one of the games but they potentially could get more points then Ederson. So its a tricky one # FPL # GW32 # DGW32'
52: b"Fulham (MCI, wat) They have performed a better under Scott Parker but I'm not too keen on any of their players Man City (ful, CAR) I can't think of better week to Triple captain Aguero or Sterling but those that are using FH will most likely have 3 city assets # FPL # GW32 # DGW32"
53: b'One more to consider is Schlupp, he has started the last 6 games scoring 1 goals and 3 assists, priced at 4.5m. He might be a slight gamble but one worth taking, he is also classed as a defender but has played midfield in those games # FPL # GW32 # DGW32'
54: b'Crystal Palace (HUD, tot) Good first fixture alone, so players like Batshuayi or Zaha (fitness permitting) could payoff Milivojevic gets most of his goals via penalties but he has 9 PL goals, at 6.3 I think he is the ideal 4th midfielder in a FH team # FPL # GW32 # DGW32'
55: b'Cardiff (CHE, mci) Very poor fixtures coupled with out of form players, however Peltier (3.9) is the cheapest starting double game week player if anyone wants him. Chelsea (car, BRI) Hazard will be in many FH teams plus if budget permits Azpilcueta. # FPL # GW32 # DGW32'
56: b'Brighton (SOU, che) The only player I would consider from Brighton is Duffy, Brighton have 2 clean sheets from 5 games, Duffy\xe2\x80\x99s attacking threat is the major reason to consider him with 5 goals & 2 assists. Dsilva, Eriksen & Fraser have scored no more then 6 goals, # FPL # GW32'
57: b'Hudson-Odoi & Romeu are 4.2 in midfield, finally Quaner is a 4.3 forward. Some of these can sit on your bench so you have the most money to spend on your starters Lets look at teams that have 2 games (in brackets are the their opponents, capitals indicate home game): # FPL # GW32'
58: b'Free Hit Lets deal with the bench first, if you plan to have 11 players with double games, you need to maximise your money to spend by having the cheapest bench fodders. There are a few 3.9m goalkeeper\xe2\x80\x99s whilst in defence Connolly (Cardiff) & Simpson (BOU) are 3.8m # FPL # GW32'
59: b'NO FH/WC For those that no longer have either chip or intend to use them later, my advise is take some hits and get as many dgw players as you can. But keep in mind GW33 is a blank week and GW34 & 35 are double game weeks. Brighton have 3 double game weeks, # FPL # GW32 # DGW32'
60: b'FPL GW32 Preview This is the first big double game week of the season with 10 teams having 2 fixtures. I\xe2\x80\x99ve been mentioning for weeks now that I will be using by free hit chip this week, whilst others might use their wildcard. It depends on your squad situation # FPL # GW32 # DGW32'
61: b'Too many # FPL points in one pic # GW32 https://twitter.com/SuperSportTV/status/1111710378101276674 \xe2\x80\xa6'
62: b'Sadio Mane is brought in more times than Eden Hazard ahead of # GW32 # DGW32 # FPL # Mane # Hazardpic.twitter.com/yAk9Y8CQWx'
63: b'Wanna know worse managers than Sarri? ME I am position 235,700 among # ChelseaFC fans # FantasyPL , 4,063,093 overall. Whats your position? # FPL # fantasypremierleague # GW32 # CFC'
64: b'If "form" is all-important, why do I have Pogba (1.7) in my squad? # GW32 # FH # FPL'
65: b"NEW POST - Fantasy premier league \xe2\x80\x93 FFGeek contributors show their # GW32 teams part 2 There's Rob Reid aka @ Thefpl_vet @ iamprakhar2 @ fplword @ MleichtD Costas Chari and Sergio Torija https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-team-tips-gw32-ffgeek-contribs2/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW32 # freehitpic.twitter.com/DEGSSssrwl"
66: b'# FPL # GW32 I have changed my team so much times that when the # GW32 starts I will be celebrating goals of players that not even in my team!!! pic.twitter.com/N4BiKd960F'
67: b'Wich one of these teams do you fancy and why? # fplcommunity # fpl # gw32 pic.twitter.com/RXneMNeHCL'
68: b'Which @ ManUtd defender do you expect to play the most the # fpl # gw32?'
69: b'This week I get so irritated by the Higuain captaincy option I somehow investigate the history of Chelsea and reputable strikers. # FPL # GW32 https://twitter.com/RealHypeTrain/status/1111706691542966273 \xe2\x80\xa6'
70: b"With 0.1 left itb on this # FreeHit team for # GW32 I could swap David Luis > Laporte and David Silva > Son. Not that I have anything against David's. Thoughts? # FantasyPL # FPL pic.twitter.com/tyuoFp63z6"
71: b'# FPL # GW32 Weekly Differentials @ HypeTrainSam explores a hidden Fantasy gem in each Premier League fixture ahead of the upcoming Gameweek that might make the difference in your squad. Read here https://www.thehypetrain.co.uk/single-post/2019/03/29/WEEKLY-WILDCARDS-201819-FPL-Double-Gameweek-32 \xe2\x80\xa6pic.twitter.com/Oyu1m4l0LG'
72: b'Higuain vs Kane.... (have Hazard, no Spurs currently) GO! # fpl # fplcommunity # gw32'
73: b'I think Jota\xe2\x80\x99s minutes will be managed but regardless Mili destroys him last 6 matches on the comparison tool which is actually surprising. # FPL # GW32 @ ffscout_az'
74: b'# GW32 # FPL # freehitpic.twitter.com/DR4SpG0ooE'
75: b"My FPL team pic.twitter.com/5rwbi9ky88 # FPL # GW32 # DGW32 via @ FantasyFootyFix - free hit activited - the best 15 double-gamed players i can afford, here's hoping for triple figures this week - thoughts?"
76: b'Thoughts people? # FPL # DGW32 # GW32 # FFScoutpic.twitter.com/vpZepeX41r'
77: b"# gw32 # fpl think I'min. pic.twitter.com/0hZOFHq6w5"
78: b'When @ BenDinnery lists Rashford as 100% avaliable with condition \xc2\xabnone\xc2\xbb, I\xe2\x80\x99ll play him # gw32 # fpl'
79: b'Any help would be appriciated..Dont like the look of Schlupp in my team..0,6 itb, need guidence # gw32 # FH # Fpl pic.twitter.com/4gueYg6pZV'
80: b"HELP!! If you've that team, TC, BB, Wildcard still available. What would you do? 1- Get sterling for a -4 and TC him/Hazard in order to WC gw 33 then BB dgw 35 2- Wildcard to get the best players for dgw 32, Bgw 33 & Dgw 35 # FPL # DGW32 # GW32 # FPLCommunity # FantasyPLpic.twitter.com/GQP5P9SiIv"
81: b"This is the squad for # FPL # GW32 WC Sterling (vs ful+CAR) Not having FH frightened me. But managed to get 10 DGWers and 11 BGWers for # GW33 for only a hit. Quite happy with the result. OR 104,287 ITB 0.1 Let's see what happens. Good luck everyone!pic.twitter.com/A4oYgRzwqB"
82: b'# FPLcommunity Should I bench boost now to have: Robbo (TOT), AWB (HUD, tot), Guaita (HUD, tot) and Camarasa (CHE, mnc) playing OR Bench boost in GW35 for Boruc + Brooks (FUL), Dunk (wol, tot), Valery (new, wat) # FPL # GW32'
83: b'Is Kane essential for # gw32 # fpl'
84: b'# fpl # gw32 Who to start?'
85: b'16 Mar 15:23 - Free Hita on 179 transfers later 29 Mar 18:07 - still work in progress # FPL # DGW32 # GW32 @ OfficialFPL'
86: b'Out of form, presumably from fatigue, Son got his first rest of the season during Spur\xe2\x80\x99s blank GW31. They\xe2\x80\x99ll have had over 2 weeks rest as a team, and Son managed to bag a goal vs Colombia just in time for his return to club football. # FPL # GW32 # FPLCommunitypic.twitter.com/d6gBiCRBZb'
87: b'# DGW32 # fpl # spursbruv # GW32 pic.twitter.com/3lbedZIVGa'
88: b'@ OfficialFPL This is how my team are rolling into # GW32. Thoughts?! # TripleCaptain # FPL pic.twitter.com/QMiNynPGpC'
89: b'# GW32 (C) KANE or JIMENEZ ??????? # FPL # FPLcommunity'
90: b"I'm reluctant to put all my eggs in one basket. # FPL # GW32 # FHpic.twitter.com/xWmyOeDFMT"
91: b"Ederson or David Silva, that's the real question and it hurts... # GW32 # DGW32 # FPL"
92: b'# GW32 team # Salah # Hazard Triple \xc2\xa9 # Aguuueerrroooo \xc2\xa32.7m banked # FPL pic.twitter.com/nZD2ENYYMX'
93: b"Pep don't ruin my # GW32 # FPL"
94: b"Starting to bottle my bench boost. TAA will become Smalling, with AWB doubtful, Robbo SGW, Camarasa two 2 pointers, and Hennessey lurking over Guaita's shoulder Thoughts # FPLcommunity # FPL # GW32 pic.twitter.com/v6FaXB0qaH"
95: b'Thoughts on this team? No free hit. Planning for GW33. # FPL # FPLCommunity # GW32 @ OfficialFPLpic.twitter.com/5Spn1u0yP5'
96: b'All the important Double Gameweek 32 injury news (or lack of it) for # FPL managers rounded up here: https://www.fantasyfootballscout.co.uk/2019/03/29/fpl-team-news-and-injury-round-up-double-gameweek-32/ \xe2\x80\xa6 # FPL # GW32 # DGW32 # FantasyPL'
97: b'Press conferences # GW32 Ruled out: Sakho Mina Sanchez Gross Torreira Dier Delph Sch\xc3\xa4r Might play: Mendy Zaha Wan-Bisakka Xhaka Keita Fit: Holebas Gray Digne De Bruyne Lascelles Kompany This is just some of the news, for the whole summary: https://premierfantasytools.com/2019/03/28/2018-19-premier-league-press-conferences-gw32/ \xe2\x80\xa6 # FPL # DGW'
98: b'Most Transferred out Today 1) Salah MF LIV 13.3 65795 2) Felipe Anderson MF WHU 7.1 27133 3) Man\xc3\xa9 MF LIV 10.0 22475 4) Vardy FW LEI 9.0 21615 5) Alexander-Arnold DF LIV 5.6 21537 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
99: b'Most Transferred in Today 1) Sterling MF MCI 11.6 61638 2) Ag\xc3\xbcero FW MCI 11.8 43143 3) Hazard MF CHE 10.9 28342 4) Jim\xc3\xa9nez FW WOL 6.8 23462 5) Laporte DF MCI 5.9 23301 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
100: b'Who should you pick for your fantasy team this week ? # FPL # gw32 http://247-football.com/2019/03/29/fantasy-league-picks-for-gameweek-32/ \xe2\x80\xa6'
101: b"GW32 locked in **FREE HIT CHIP ACTIVE** OR: 58,597 ITB: \xc2\xa30.0m Barring any late injury news, this is my Free Hit team. Risking Rashford despite the injury worry. Gut feeling is he'll play this weekend, but at least there's Tuesday if not. Good luck everyone! # FPL # GW32 pic.twitter.com/B5P8UDQbTT"
102: b'Player Status Change Valencia DF MUN 6.4 Darmian DF MUN 4.6 # FPL # GW32 http://www.fpl247.com'
103: b"# GW32 squad selection Sterling - simply ideal variant for this gw, that's why I spent extra -4 pts transfer on him It's going to be huge differential weekend, because most of the squads will have City and Chelsea's assets Good luck to all of us! # FPL # FPLcommunity # DGW32pic.twitter.com/INMAsj6dc6"
104: b'All 20 clubs covered now - team news, injury updates & manager quotes ahead of # DGW32 deadline [Saturday, 11.30am] # FPL # pressers # GW32 # freehit # wildcard # MUFC # MCFC # CFC # fplcommunity # fantasypl # PressConference https://www.thestatszone.com/fpl-double-gameweek-32-fixtures-team-news-press-conference-quotes-predicted-line-ups-18-19 \xe2\x80\xa6https://twitter.com/ColmVHayes/status/1111580245138694144 \xe2\x80\xa6'
105: b'Pretty much set on this team, 3 City, 3 United, 3 Chelsea, Spurs and Wolves - Aguero(c) # gw32 # fh32 # fpl pic.twitter.com/tIkB90VTxJ'
106: b'4 ... # FPL # gw32 # NoFreeHit'
107: b'# FPL # GW32 You heard it here first. pic.twitter.com/3BWBdg0oyc'
108: b'Player Status Change Elliot GK NEW 4.3 Lascelles DF NEW 4.7 # FPL # GW32 http://www.fpl247.com'
109: b'Banker V Blanker RT + COMMENT ENTRY & WIN CRYPTO! 1. Banker (Highest FPL points) 2. Blanker (Lowest FPL points) 3. Min of first GW goal (Tie Break) *Player MUST START or entry is void* (DGW player must start BOTH games) Score = Banker Pts minus Blanker Pts # FPL # GW32 pic.twitter.com/kxORcKkdhH'
110: b'Think i\xe2\x80\x99m pretty set on this then. Any feedback would be appreciated # fpl # gw32 pic.twitter.com/E96dRAftX2'
111: b'Solskjaer: "We\xe2\x80\x99ve had a very good training week. Some have been away and have come back okay. Alexis has just come back and there is only him who is out, along with Matteo [Darmian] and Antonio [Valencia]. We\xe2\x80\x99ll have to check on one or two of the others.\xe2\x80\x9d # FFScout # FPL # GW32'
112: b'Still tinkering with that free hit team? Still got transfers to make? Then take a look below # FPL # GW32 https://twitter.com/robwatsonlang/status/1111345168752480258 \xe2\x80\xa6'
113: b'# GW32 Free Hit Final Draft We have created our final Free Hit draft team, highlighting our essential picks and captaincy choice You can read it here http://www.footballadvice.co.uk/double-gameweek-32-final-squad/ \xe2\x80\xa6 # FPL # FPLCommunity'
114: b'# GW32 Triple Captain Pick Sterling vs FUL (A) + CAR (H) In blistering form coming off the back of his England performances. Don\xe2\x80\x99t be surprised by 20pts+ this weekend. This is in addition to our Captain Picks. # FPL # GW32 # TC # Captain # FPLCommunitypic.twitter.com/ijIp4lAYXK'
115: b'Take a bow # GW32 Bench Fodder! # FPL pic.twitter.com/nEmPE97DxG'
116: b'All set in my FH team. Good luck everyone # GW32 # FPL pic.twitter.com/GtNKxXkphO'
117: b'# GW32 Triple Captain Pick Ag\xc3\xbcero vs FUL (A) + CAR (H) Fully rested with no international duty, we see Ag\xc3\xbcero going nuclear on relegation fodder in Fulham & Cardiff. This is in addition to our Captain Picks. # FPL # GW32 # TC # Captain # FPLCommunitypic.twitter.com/jl6lx86uwS'
118: b'Rafael Benitez: "We have some knocks, little things. Longstaff is the only one who is injured at the moment. Atsu, Yedlin, Almiron came back today." # FFScout # FPL # GW32 # DGW32 # NUFC'
119: b'Player Status Change Mavropanos DF ARS 4.7 # FPL # GW32 http://www.fpl247.com'
120: b'Santo on the FA Cup distraction: "Game by game. Only focus on the next game, don\'t think about anything else. The best way to compete is to look at the next challenge." # FFScout # FPL # GW32 # DGW32 # Wolves # WWFC'
121: b'Per usual, our Dream Team (which is not bound by the budget!) sligthly differs # FPL # GW32 pic.twitter.com/z7RAWvD9a0'
122: b'# GW32 Captain Picks \xe2\x98\x85\xe2\x98\x85\xe2\x98\x85\xe2\x98\x85 Ag\xc3\xbcero vs FUL (A) + CAR (H) \xe2\x98\x85\xe2\x98\x85\xe2\x98\x85 Sterling vs FUL (A) + CAR (H) \xe2\x98\x85\xe2\x98\x85 Kane vs LIV (A) + CRY (H) \xe2\x98\x85 Hazard vs CAR (A) + BHA (H) # FPL # GW32 # Captain # FPLCommunity # MCI # TOT # CHEpic.twitter.com/bK7C7133rk'
123: b"BOOM, triple cap locked for the week. Good luck everyone! It's the best time of the season! # FPL # GW32 # DGW # DGW32 # TripleCaptain # TCpic.twitter.com/86Fj51Zc4Q"
124: b'Differentials from United, City and Chelsea to consider for Double Gameweek 32: https://www.fantasyfootballscout.co.uk/2019/03/29/three-fpl-differentials-with-two-fixtures-in-double-gameweek-32/ \xe2\x80\xa6 # FPL # DGW32 # GW32 # FantasyPL # MUFC # MCFC # ChelseaFC'
125: b'Nuno Espirito Santo: "Everybody is OK, but like you understand, many miles, and special attention for some of those, but everybody is fit." # FFScout # FPL # GW32 # DGW32 # Wolves # WWFC'
126: b'Our final Team to watch for # GW32 is out! # FPL pic.twitter.com/2wupewmGAQ'
127: b'In our latest # FPL video we discuss the basic strategy to make your own free hit draft for # GW32! We have also included some sample free hit drafts! To watch plz click on the link: https://youtu.be/vjkbnS2t2ow'
128: b'This international break has felt like an eternity. Roll on the weekend! # FPL # Football # Weekend # GW32 pic.twitter.com/GETyhjjZlU'
129: b'ALL # FPL Press Conference Summaries now live KDB, Fernandinho, Kompany Digne Mendy Full report: https://premierfantasytools.com/2019/03/28/2018-19-premier-league-press-conferences-gw32/ \xe2\x80\xa6 Courtesy of @ artmed2804 # GW32 pic.twitter.com/Av8GusbRQq'
130: b'LOCKED IN # GW32 My FPL Captain: Ag\xc3\xbceroooo FREE HIT TIME BABY What\xe2\x80\x99s the worst that could happen this week? Hopeful of finally breaking into the 100 club Good luck all! # FPL pic.twitter.com/SKMLlu0TaQ'
131: b'FPL headlines for this week -single GW players on a DGW FH? -To Kane or not to Kane in GW32 FH -Is there really anyone to consider for captaincy outside of Man City this week -What is your City Strategy? -Other teams to focus on https://soundcloud.com/fplsurgery/125thepi \xe2\x80\xa6 # upthepod # fpl # gw32'
132: b"Sterling/Aguero probably won't play 180 minutes. Hazard might be tired. Nothing confirmed about Rashford/Martial. Higuain sucks as fuck, Giroud is on fire. Who should be my # FPL captain? *I've got 99 problems and Harry Kane aint one!* # GW32 # DGW32pic.twitter.com/JdzICMJ1m7"
133: b'# GW32 # FPL Recommendations Not going into much analysis this week as I\xe2\x80\x99m away on holidays at the moment, but all players have 2 games this GW. pic.twitter.com/CVgNWQ6I3j'
134: b'I was so close to having a FH team I liked but with Lukaku looking like he\xe2\x80\x99s out I either downgrade Hazard to get Kane in or find another striker and upgrade McArthur. Any tips? # FPL # GW32 \xc2\xaf\\_(\xe3\x83\x84)_/\xc2\xaf pic.twitter.com/x4oZAT3phK'
135: b'Emery: "Xhaka also rested today, we\xe2\x80\x99re going to wait tomorrow and Sunday but the first previews from the doctor is that he can progress to be ready for Monday." # FFScout # FPL # GW32 # DGW32 # ArsenalFC'
136: b'Unai Emery: "We trained this morning and some players rested for giving them one day more to train with us tomorrow. Aaron Ramsey, Dinos Mavropanos. I think they can be ready for Monday." # FFScout # FPL # GW32 # DGW32 # ArsenalFC'
137: b'Kane or no Kane? # FPL # FPLCommunity # Kane # GW32 https://twitter.com/FootballAdvice5/status/1111579858696658944 \xe2\x80\xa6'
138: b'Which pair will scoore more points in # gw32? A. D.Silva & Kepa B. Son & Ederson # fpl # FPLcommunity'
139: b'Player Status Change Sako MF CRY 4.9 Stones DF MCI 5.2 Kompany DF MCI 5.2 Otamendi DF MCI 6.0 Mendy DF MCI 6.1 Delph DF MCI 5.3 Fernandinho MF MCI 5.3 De Bruyne MF MCI 9.7 # FPL # GW32 http://www.fpl247.com'
140: b'Hodgson\'s full quote on Zaha and AWB\'s chances of playing: "Hope so, yeah. They\'ve both been nursing those injuries but they were out in training this morning so if nothing happens in terms of reaction, then I\'m hoping they\'ll be fit. It\'s touch and go." # FFScout # FPL # GW32'
141: b'Mart\xc3\xadn Montoya: does anyone have any thoughts on him? Does he represent a significant drop-off from Dunk, # FPL-wise? Is he a locked in starter? Anyone? @ FFScout_Joe? # FPL # GW32 # strangebedfellows'
142: b'Maurizio Sarri on Callum Hudson-Odoi: "We have to play eight matches in [the next] 28 days and so I\'m sure Callum will start in two, three matches. It\'s not a problem for me to put him in the starting XI in a Premier League match." # FFScout # FPL # GW32 # DGW32 # ChelseaFC'
143: b"AWB being 'touch and go' for Huddersfield tomorrow is enough of a doubt for me to take him out of my FH team. Schlupp comes in, but does mean my slightly more expensive subs will have to be downgraded to 3.8 fodder. # FPL # GW32"
144: b'Comes down to 1 out of this lot. Who scores more fpl points in # GW32 ? # fpl'
145: b'Guardiola: "Except Fabian Delph, the other people is fit. We have 21, 22 players and that\'s good, they have to compete with each other to take one place in their position." # FFScout # FPL # GW32 # DGW32 # MCFC'
146: b'Guardiola on whether Benjamin Mendy is fit for tomorrow: "Yep. Of course, he needs time. He trained the last three days and the reaction in his knee is really good." # FFScout # FPL # GW32 # DGW32 # MCFC'
147: b'Great read! Keeping it simple! Going with Aguero TC as well now due to the penalty duty advantage. # FPL # GW32 https://twitter.com/nikarg/status/1111610573903593472 \xe2\x80\xa6'
148: b'Player Status Change Aurier DF TOT 5.7 Dier MF TOT 4.7 Winks MF TOT 5.5 # FPL # GW32 http://www.fpl247.com'
149: b"That's not the firm answer we were after Roy # FPL # GW32 https://twitter.com/CPFC/status/1111621541714890753 \xe2\x80\xa6"
150: b'Pep Guardiola: "Everybody came back fit. Fernandinho, Kevin [De Bruyne], Vincent [Kompany], everybody is OK." # FFScout # FPL # GW32 # DGW32 # MCFC'
151: b'Roy Hodgson says that Aaron Wan-Bissaka and Wilfried Zaha have trained today but are "touch and go" for Saturday\'s game. # FFScout # FPL # GW32 # DGW32 # CPFC'
152: b'ICYMI: a quick rundown of our # GW32 podcasts: Team-by-team power rankings: https://soundcloud.com/alwayscheating/ep-165-power-rankings-gw31-break \xe2\x80\xa6 Free Hit Chip/GW32 strategy: https://soundcloud.com/alwayscheating/ep-166-free-hits-unleashed-break-gw32 \xe2\x80\xa6 Patreon-exclusive pod w/ final thoughts on GW32 strategy: https://www.patreon.com/posts/kitchen-table-11-25706499 \xe2\x80\xa6 4 hours of GW32 # FPL content! Phew.'
153: b'Klopp: "One of the biggest mistakes I made was being so excited about getting Ox back. Now we keep him a little bit in the shadows. He will train and when he\'s ready to be properly back then I\'ll inform you." # FFScout # FPL # GW32 # DGW32 # LiverpoolFC'
154: b'Klopp on Alexander-Arnold, Shaqiri and Keita: \xe2\x80\x9cFor all three it was pretty much their first full session so we have to see how they react. Joe [Gomez] was back yesterday after 15 weeks and looked really good but of course, early stages." # FFScout # FPL # GW32 # DGW32'
155: b'Jurgen Klopp on whether the extended break has benefitted Mohamed Salah: "Oh, 100%. You gain freshness in that time. They are always training but it\'s not the highest intensity, so that helps." # FFScout # FPL # GW32 # DGW32 # LiverpoolFC'
156: b'Ready for # GW32 GW32 TARGET: 100+ POINTS @ OfficialFPL # FPL # DGW32pic.twitter.com/uYlSOthURt'
157: b'# GW32 team reveal Bench boost active Salah & Button > Sterling & Ryan Good luck everyone! # FPL pic.twitter.com/00emh9tlb3'
158: b"# FPL # FPLCommunity # DGW32 # GW32 # jakgractoznajlepszymi @ FantasyPL_FPL @ fplpoland Your FH is enabled and you need a budgetary,playing midfielder to release money for premium players? Or maybe you are just looking for a playing sub? If you answered 'Yes', i have something for you!"
159: b'In case you missed it, you can now register on our website https://www.foomnianalytics.com/ and get some personalised advice for your teams! # FPL # FPLCommunity # GW32'
160: b"# Liverpool's title chances # ManchesterCity's goal machine # LeicesterCity's Belgian affair Everything you need to know about the players who can stand out in # FantasyPremierLeague's # GW32! # FPL # FantasyFootball # FantasyPLhttp://bit.ly/2FInUMp"
161: b"Approx 40 minutes until Roy Hodgson hopefully provides the AWB injury update I've been waiting the last week for. # FPL # GW32"
162: b'Spurs report that Serge Aurier (hamstring) is currently undergoing assessment. Eric Dier (hip) and Harry Winks (groin) are continuing on-field rehab and are unavailable this weekend. # FFScout # FPL # GW32 # DGW32 # THFC'
163: b'My two final drafts for FH. If I go with Martial in a 352 it lets me upgrade Luiz to Azpilicueta # FPL # GW32 # DGW32pic.twitter.com/MHRhO2O6Zu'
164: b'Team A or B? # GW32 # DGW32 # FPL'
165: b'\xd8\xa5\xd8\xae\xd8\xaa\xd9\x8a\xd8\xa7\xd8\xb1\xd8\xa7\xd8\xaa \xd8\xa7\xd9\x84\xd9\x83\xd8\xa7\xd8\xa8\xd8\xaa\xd9\x86 \xd9\x84\xd9\x84\xd8\xa5\xd8\xb3\xd8\xa8\xd9\x88\xd8\xb9 \xd9\xa3\xd9\xa2 Captain choices for # GW32 # fpl 1- Aguerooo...\xd8\xa3\xd8\xac\xd9\x88\xd9\x8a\xd8\xb1\xd9\x88\xd9\x88\xd9\x88 2- Hazaaard...\xd9\x87\xd8\xa7\xd8\xb2\xd8\xa7\xd8\xa7\xd8\xa7\xd8\xa7\xd8\xb1\xd8\xaf 3- Sterliiing...\xd8\xb3\xd8\xaa\xd9\x8a\xd8\xb1\xd8\xb1\xd8\xb1\xd9\x84\xd9\x86\xd8\xac 4- Kaneeee....\xd9\x83\xd9\x8a\xd9\x8a\xd9\x8a\xd9\x8a\xd9\x8a\xd9\x86 # \xd9\x81\xd8\xa7\xd9\x86\xd8\xaa\xd8\xb2\xd9\x8a\xd8\xb3\xd8\xaa\xd8\xa7 # \xd9\x81\xd8\xa7\xd9\x86\xd8\xaa\xd8\xb2\xd9\x8a_\xd8\xa7\xd9\x84\xd8\xa8\xd8\xb1\xd9\x8a\xd9\x85\xd9\x8a\xd8\xb1\xd9\x84\xd9\x8a\xd8\xba # FPL # fantasypremierleaguepic.twitter.com/YqjOFN2ZY2'
166: b'Warnock: "Jazz Richards should be joining us back in training on Monday. He\'s been out for quite a number of weeks, he\'s had hamstring problems for most of the season." # FFScout # FPL # GW32 # DGW32 # CCFC'
167: b'GW32 Free hit Team Locked in Current rank 475,737 Captain Hazard Taking no gamble on players with knocks Good luck everyone # FPL # DGW32 # GW32 pic.twitter.com/uQF4UijyGm'
168: b'Who to 3*CapTain??? # FPL # GW32'
169: b'\xd8\xa5\xd8\xae\xd8\xaa\xd9\x8a\xd8\xa7\xd8\xb1\xd8\xa7\xd8\xaa \xd8\xa7\xd9\x84\xd9\x84\xd8\xa7\xd8\xb9\xd8\xa8\xd9\x8a\xd9\x86 \xd9\x84\xd9\x84\xd8\xa5\xd8\xb3\xd8\xa8\xd9\x88\xd8\xb9 \xd8\xa7\xd9\x84 \xd9\xa3\xd9\xa2 # GW32 players selections Part 1: Defenders ... \xd8\xa7\xd9\x84\xd9\x85\xd8\xaf\xd8\xa7\xd9\x81\xd8\xb9\xd9\x8a\xd9\x86 # \xd9\x81\xd8\xa7\xd9\x86\xd8\xaa\xd8\xb2\xd9\x8a\xd8\xb3\xd8\xaa\xd8\xa7 # \xd9\x81\xd8\xa7\xd9\x86\xd8\xaa\xd8\xb2\xd9\x8a_\xd8\xa7\xd9\x84\xd8\xa8\xd8\xb1\xd9\x8a\xd9\x85\xd9\x8a\xd8\xb1\xd9\x84\xd9\x8a\xd8\xba # FPL # fantasypremierleaguepic.twitter.com/CBhlb0qUyX'
170: b"No update on Harry Arter or Joe Bennett in Warnock's presser but local media had earlier reported that Bennett has recovered from a hamstring strain. # FFScout # FPL # GW32 # DGW32https://www.walesonline.co.uk/sport/football/football-news/cardiff-citys-joe-bennett-i-16031247 \xe2\x80\xa6"
171: b'# FPL # GW32 Birthday Boy is Nailed in my team. Stars will Align!!! https://twitter.com/CPFC/status/1111602655111991297 \xe2\x80\xa6'
172: b'If you\xe2\x80\x99re on your Free Hit & you are certain that all your playing XI will at least play 1 minute in some game, you don\xe2\x80\x99t need anybody worthwhile on the bench. Go with the cheapest non-starters. # FPL # GW32'
173: b'Burnley Barnes Owned: 60% Last GW: 5.5 Total points: 210.5 Opponent: Wolves (H) Everton Calvert-Lewin Owned: 35% Last GW: 9.5 Total points: 147.5 Opponent: West Ham (A) # GW32 # fantrax # FPL # FantasyPL'
174: b'Southampton H\xc3\xb8jbjerg Owned: 45% Last GW: N/A Total points: 179.5 Opponent: Brighton (A) Burnley Westwood Owned: 51% Last GW: 6.5 Total points: 210 Opponent: Wolves (H) # GW32 # fantrax # toggatrax # FPL # FantasyPL'
175: b'# GW32 # freehit # fpl probably going to have to lock this in have a busy day and wont have much if any time to tinker. pic.twitter.com/1oO7pPDQQa'
176: b'Stop the press! Although we aren\xe2\x80\x99t getting an official chat with OGS, he\xe2\x80\x99s scheduled for an appearance on MUTV. Hope yet for some much needed Rashford/Lukaku/Martial news. # FPL # MUFC # GW32 https://twitter.com/FFScout_Joe/status/1111589687976693760 \xe2\x80\xa6'
177: b'Great pod, thanks for answering my question. Aguero, Rashford and Jimi up front it is. # gw32 # fpl https://twitter.com/PlanetFPLPod/status/1110999175829831682 \xe2\x80\xa6'
178: b'# FPL # GW32 feels like when you have 2 weeks to revise for a final. You chill for 13 days then the final day before the exam you do a mad scramble. Then you end up with a team looking like this. Differentials pic.twitter.com/pK7r67gvOW'
179: b'Still undecided who to go with for my final midfield spot below \xc2\xa39m. B. Silva D. Silva Son Alli Any idea? # Fpl # gw32'
180: b'Neil Warnock reports that Callum Paterson will be out for the rest of the season after undergoing surgery, while Matt Connolly has dislocated his ankle. Jazz Richards will rejoin the Cardiff squad next Monday. # FFScout # FPL # GW32 # DGW32 # CCFC'
181: b'Press conference coverage ahead of # DGW32 10 clubs done, 10 to go (hopefully incl. that all-important Man Utd fitness update) Team news, manager quotes, injury updates and predicted XIs # FPL # FPLcommunity # lineups # GW32 # FantasyPL # pressers https://www.thestatszone.com/fpl-double-gameweek-32-fixtures-team-news-press-conference-quotes-predicted-line-ups-18-19 \xe2\x80\xa6pic.twitter.com/8HSX5wYRvn'
182: b'Which Free Hit team would you pick? Team A: 4-4-2 Kane Premium attacking assets No Rashford Team B: 3-4-3 Rashford Premium defensive assets (Azpi/Ederson) No Hurri-Kane Please Let me know your thoughts! # FPL # FPLCommunity # GW32 # Kane # Aguero # Rashfordpic.twitter.com/N4vhJNYQT1'
183: b'Breakout Picks # GW32 The latest @ FFScout Hot Topic asks: 1. Who will find form this week? 1. Have you seen something in the stats? 3. Who is ready for a breakout performance? Who in your side is the biggest # FPL differential? https://www.fantasyfootballscout.co.uk/2019/03/29/captain-sensible-deciding-between-aguero-and-sterling/?hc_page=8&hc_sort_by=comment_date#hc_comment_20102251 \xe2\x80\xa6'
184: b"NEW POST - fantasy premier league \xe2\x80\x93 FFGeek contributors & their # GW32 teams part 1 there's @ JordanSadler95 @ jwcrilley @ alexwaterbaby @ StephenTroop 3 Free Hit chips & 1 triple captain https://www.fantasyfootballgeek.co.uk/fpl-team-tips-gw32-ffgeek-contribs1/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # DGW32 # freehitpic.twitter.com/Sj32AfsCSP"
185: b'Bez # FH, a z -4 za transfer wchodz\xc4\x99 takim sk\xc5\x82adem w # DGW32 # FPL # GW32 # FantasyPLpic.twitter.com/ADXBug5ecs'
186: b'Although we have released our # GW32 Q&A article answering your most asked questions, we are still answering last minute questions on Twitter! Let us know what problems you have # FPL # FPLCommunitypic.twitter.com/mIwvYIBENN'
187: b"A big day for one of the Arrow boys today. We're all off at his wedding so, while we'll be tweeting our usual tips, unfortunately we wont be responding to tweets this weekend but we hope those arrows are green. # FPL # GW32 # FPLCommunity"
188: b"If I was on a free hit I wouldn't be writing off Vardy for # GW32. Playing Bournemouth and their shambolic away defence and now 0.1 cheaper too # FPL https://twitter.com/FRemotebot/status/1111511598118699009 \xe2\x80\xa6"
189: b'Howe on Stanislas, Smith and Gosling: "We\'ll see whether they\'re involved but they\'ve definitely improved. We\'ve still got a few injury worries, we\'ve used the two-week break to progress players back to fitness." # FFScout # FPL # GW32 # DGW32 # afcb'
190: b'# FPL # GW32 Free Hit Draft no.10: 3x ManU 3x Che 3x ManC 1x Spurs 1x Watford pic.twitter.com/A1pDkCbicC'
191: b'# GW32 # FPL # RefStats Goals? \xf0\x9d\x97\x95\xf0\x9d\x97\xa8\xf0\x9d\x97\xa5WOL, MUNWAT, WHM\xf0\x9d\x97\x98\xf0\x9d\x97\xa9\xf0\x9d\x97\x98 Penalties? FULMCI, BHASOU, CAR\xf0\x9d\x97\x96\xf0\x9d\x97\x9b\xf0\x9d\x97\x98 Red Cards? CRY\xf0\x9d\x97\x9b\xf0\x9d\x97\xa8\xf0\x9d\x97\x97, BHASOU, CAR\xf0\x9d\x97\x96\xf0\x9d\x97\x9b\xf0\x9d\x97\x98 Winners? BUR, CRY, EVE, CHE, ARS, [MCI] # RefWatch # WhatTheRef # RefOffpic.twitter.com/I8eXXsyQ5Y'
192: b'My always-positive views on Tottenham # FPL assets for # GW32 https://twitter.com/FPLMyClub/status/1111539629335945216 \xe2\x80\xa6'
193: b"Harry Kane is proving to be the biggest decision for many Free Hit managers. Check out our thoughts and why he shouldn't be overlooked http://www.footballadvice.co.uk/gw32-guest-question-and-answer/ \xe2\x80\xa6 # FPL # FPLCommunity # GW32 # Kane"
194: b'# FPL # FPLCommunity # GW32 # DGW32'
195: b'Eddie Howe reveals that Junior Stanislas, Adam Smith and Dan Gosling have trained and will be assessed ahead of Saturday. # FFScout # FPL # GW32 # DGW32 # afcb'
196: b'Many have said David Silva is a massive rotation risk. But we\xe2\x80\x99ve polled on twitter this week and the majority think he\xe2\x80\x99ll play between 90-150mins. For an attacking player, that\xe2\x80\x99s enough for us to back him. Fully rested, we expect returns from him. # FPL # GW32 # FPLCommunitypic.twitter.com/yEyKAC1sdR'
197: b'Price Changes (3/29/2019) Risers: Deulofeu \xc2\xa35.7m Fallers: Vardy \xc2\xa39.0m # FPL # GW32 # FPL_Price'
198: b'FPL OFFICIAL Price Changes (3/29/2019) Overnight Risers: Deulofeu \xc2\xa35.7m Overnight Fallers: Vardy \xc2\xa39.0m # FPL # GW32 # FPL_PriceChanges # Aye'
199: b'No OGS on Pep, Sarri and Poch # fpl # gw32 https://twitter.com/FFScout/status/1111540449356009472 \xe2\x80\xa6'
200: b'Wolves By @ OGold80 # FPL # Wolves # wwfc # GW32 pic.twitter.com/bMqS5Ynthg'
201: b'Huddersfield By @ denny_ledger # FPL # HTAFC # GW32 pic.twitter.com/oJoj3Y2HNe'
202: b'Tottenham By @ FPLdepression # FPL # THFC # COYS # GW32 pic.twitter.com/F3ajsAvpK3'
203: b'GW32 Review/Preview Thread # FPL # GW32 # DGW32'
204: b'Most Transferred out Today 1) Salah MF LIV 13.3 13444 2) Felipe Anderson MF WHU 7.1 5375 3) Vardy FW LEI 9.0 4557 4) Man\xc3\xa9 MF LIV 10.0 4526 5) Alexander-Arnold DF LIV 5.6 4391 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
205: b'Most Transferred in Today 1) Sterling MF MCI 11.6 12614 2) Ag\xc3\xbcero FW MCI 11.8 8792 3) Hazard MF CHE 10.9 5709 4) Jim\xc3\xa9nez FW WOL 6.8 4885 5) Laporte DF MCI 5.9 4037 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
206: b'Looking like one of my final attempts. Chances are 90% of these guys make the team, the only thing changed from the initial draft is Lukaku after the news. The only question - do I go 3 City attackers... Rank: 1.7k # FPL @ OfficialFPL @ FFScout # dgw32 # GW32 pic.twitter.com/jgtfu86XOa'
207: b"That's not the Man City treble up I had in mind on FH # FPL # DGW32 # GW32"
208: b'Who\xe2\x80\x99s playing their free hit chip this upcoming GW? # FPL # GW32'
209: b'Overnight price fallers Vardy FW LEI 9.0 # FPL # GW32 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
210: b'Overnight price risers Deulofeu MF WAT 5.7 # FPL # GW32 http://www.fpl247.com/player/price/weekly?change=rise \xe2\x80\xa6'
211: b'Overnight players unavailable Cleverley MF WAT 5.0 Nasri MF WHU 5.1 # FPL # GW32 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
212: b'Overnight players available Ings FW SOU 5.4 Sch\xc3\xbcrrle MF FUL 5.5 Hogg MF HUD 4.4 Jagielka DF EVE 4.3 Williams MF HUD 4.5 # FPL # GW32 http://www.fpl247.com/player/returning \xe2\x80\xa6'
213: b'My FPL GW32: think I\xe2\x80\x99m locking this in Salah > Sterling Arnie > Jimenez Rice > Laporte -8 taken. Anyone else worth taking a punt for another -4? And deffo Sterling for TC? # GW32 # fpl pic.twitter.com/kVJsB0i3RZ'
214: b"It's gonna be a tough game # LEIBOU. This guys are working hard. # FPL # GW32 https://twitter.com/afcbournemouth/status/1109484962359566336 \xe2\x80\xa6"
215: b'But Rodgers needs time to work things out with Captain Morgan. # FPL # GW32 https://twitter.com/LCFC/status/1111323482237870080 \xe2\x80\xa6'
216: b"If you're thinking of buying, Brendan Rodgers has some good comments to help you decide. # FPL # GW32 # DGW32https://twitter.com/LCFC/status/1111382454168764416 \xe2\x80\xa6"
217: b'@ rogerkrooz u ready fi dis # GW32 # FPL'
218: b'This week on # FootballTwaddle @ gsarvagna & our regular guest @ AzeemKarbhari discuss the matches during the international break, upcoming # EPL double game week fixtures and # FPL team selections. Listen to it here - https://ivm.today/FT-110 # ivmpodcasts # GW32 pic.twitter.com/nauRSLoIhT'
219: b'So looking at final versions for # FPL # gw32 what do we think? pic.twitter.com/VI1AlWwO6t'
220: b"New podcast! In today's Patreon-exclusive podcast, Josh discusses: - # GW32 captains and cheap differentials - Rashford vs. Kane - What to look for in Friday's press conferences - Man City midfield targets - Fantasy birdwatching(?) Listen here: https://www.patreon.com/posts/kitchen-table-11-25706499?utm_medium=social&utm_source=twitter&utm_campaign=postshare \xe2\x80\xa6 # FPL"
221: b'For # GW32. Would you father have in defence?? # FPL'
222: b'# FPL # GW32 is another exciting double gameweek! Questions must be on who to captain to best capitalise on this since 4 of the top 6 clubs will be featured. # FPLCommunity who will you captain? Sterling or Aguero? Here are our top 3 picks:http://bit.ly/twgw32preview'
223: b'# GW32 # FPL # FPLCommunity # FantasyPL # DGW32 # gw32 ...i woke up this morning...and BAM!! Just like that i swap Etheridge with Ederson and BAM! Just like that the TC chip activated....pls dont let me down @ sterling7pic.twitter.com/KBdmjGndUS'
224: b'@ OfficialFPL Price Changes (645 am IST - 29th Mar 2019) Price Rises: Deulofeu # WatfordFC \xc2\xa35.7 Price Drops: Vardy # LCFC \xc2\xa39.0 # FFEPriceChanges # FPL # GW32'
225: b"# GW32 # FH Torn now between drafts 740 and 801. My priority is H2H league and this week's opp has Shaw, Pogba, Haz and Jimi. I prefer 740 but think 801 might be safest. Any # FPL thoughts? pic.twitter.com/q2uWIGOpjc"
226: b'My FH team comes down to what scores more from these: 1) Tomkins (HUD, tot), Higuain (car, BRI) 2) Azpilicueta (car, BRI), Jimenez (bur, MUN) OR Batshuayi (HUD, tot) 3) Luiz (car, BRI), Son (liv, CRY) First two are 343, last one is 352 # FPL # DGW32 # GW32'
227: b'Trends Benchmark page basically compares # FPL squads you picked with overall and top players trends! # FPLCommunity # GW32 https://foomnianalytics.com/mybenchmark.php pic.twitter.com/zzt3DvAqPh'
228: b'Squad Facts page presents you some of the most interesting statistical data for the squad you selected: https://foomnianalytics.com/myfacts.php # Tarkowski # Vardy # FPL # FPLCommunity # GW32 pic.twitter.com/mREHhDZHnb'
229: b'Second one is Squad Evaluation: https://foomnianalytics.com/myevaluation.php \xe2\x80\xa6 Each player is presented through our Radar Chart and through his current strengths and weaknesses! # FPL # FPLCommunity # Mane # Salah # GW32 pic.twitter.com/ACIiTXYuNU'
230: b'When you sign up at https://foomnianalytics.com/welcome.php You get access to 4 different pages! # FPL # FPLCommunity # GW32 # DGW32 /THREAD/pic.twitter.com/T32qqoK0dJ'
231: b'SITE TEAM FREE HIT SPECIAL Like a fair few # FPL managers, the site team have decided # GW32 is the one with the free hit chip! So, who have they picked and will they nail their captain again? https://fantasyfootball247.co.uk/fantasy-football-site-team-gw32/ \xe2\x80\xa6'
232: b'So what\xe2\x80\x99s this about with no Laporte? # fpl # gw32 pic.twitter.com/DOuijWOoPq'
233: b"I like it. That's probably because your team is the most similar to my own I've seen yet Good luck this week! # FantasyPL # GW32 # FPL # FreeHitpic.twitter.com/GPHgpNjpsL"
234: b'4 differentials for FH32 Teams: GK: Ryan (3.2%) DEF: Schlupp (4.7%) MID: Eriksen (5.4%) FWD: Batshuayi (2%) If you\xe2\x80\x99re looking to break the standard template and really going rogue, I suggest some of these lads. High risk high reward players. # FPL # GW32'
235: b'I reckon you all recognise this dude? # FPL # fplcommunity # DGW32 # GW32 # ManCitypic.twitter.com/r99i4MsXHv'
236: b'Which is a better option for # DGW32 # GW32? # FPL'
237: b"Half of the Double Gameweek 32 manager press conferences took place on Thursday. Here's what we learned - and didn't learn - about the latest # FPL injury news in those ten pressers: https://www.fantasyfootballscout.co.uk/2019/03/28/the-fpl-gameweek-32-team-news-what-we-know-so-far/ \xe2\x80\xa6 # GW32 # DGW32 # FantasyPL"
238: b'3rd most brought in player ahead of # GW32 # DGW32 # Jimenez # Wolves # FPL # FPLCommunitypic.twitter.com/LhiY6EIwux'
239: b'Fit for the weekend...? # GW32 # FPL https://twitter.com/MarcusRashford/status/1111360005742256129 \xe2\x80\xa6'
240: b"We finally added player's pictures! # FPL # FPLCommunity # DGW32 # GW32 pic.twitter.com/WxSqzWltuO"
241: b'Kogo by\xc5\x9bcie wybrali jako 4 bud\xc5\xbcetowego do pomocy? Dodam, \xc5\xbce Jota przesiedzia\xc5\x82 oba mecze kadry na \xc5\x82awce i nie s\xc4\x85dz\xc4\x99 by Santo go oszcz\xc4\x99dza\xc5\x82. Delofeu cz\xc4\x99sto jest rotowany w klubie. Pom\xc3\xb3\xc5\xbccie bo mam m\xc4\x99tlik. # FPL # GW32 # jakgractoznajlepszymi @ FantasyPL_FPL @ fplpoland @ fplpoland # DGW32'
242: b'Higuain announces he is giving up international duty with Argentina: "Many people will be happy", he said. He will definitely want to prove those \'many\' wrong this weekend... # FPL # GW32 pic.twitter.com/uGqAeHENic'
243: b"A big day for one of the Arrow boys tomorrow. We're all off to his wedding so, while we'll be tweeting our usual tips, unfortunately we wont be responding to tweets this weekend but we hope those arrows are green. # FPL # GW32 # FPLCommunity"
244: b"B.Silva, Sane or D.Silva? We've had our say in our latest Q&A article featuring @ LetsTalkSoccer2 http://www.footballadvice.co.uk/gw32-guest-question-and-answer/ \xe2\x80\xa6 # FPL # FPLCommunity # GW32"
245: b"FH Draft v45.1 3-4-3 Need to hear tomorrow's pressers to finalise the team. Still swithering on Mendy as a differential, but he might be one for the GW34 WC. # FPL # FPLCommunity # FantasyPL # GW32 pic.twitter.com/NST1Xsa3kl"
246: b'Sterling is a man on fire right now. A spectacular showing for England over the IB added to 76pts in his last 10 gameweeks makes him a MUST HAVE for DG32. It\xe2\x80\x99s between him and Aguero for captain this week, but it\xe2\x80\x99s as close as a coin flip. # FPL # GW32 # FPLCommunitypic.twitter.com/q6DY3faaqu'
247: b'Ditched my original # chunkychips # FPL strategy & went with the following # GW32 = BB # GW33 = In good shape # GW34 = WC # GW35 = FH All you # DGW32 FH\xe2\x80\x99ers I will get you back in 35 by posting a different draft every hour to smother your timelines'
248: b'Player Status Change Holebas DF WAT 4.8 Cleverley MF WAT 5.0 # FPL # GW32 http://www.fpl247.com'
249: b'Gracia: "Andre Gray had a small problem after the last game, but he has been training all week. He is ready to compete as well.\xe2\x80\x9d # FFScout # FPL # GW32 # DGW32 # WatfordFC'
250: b'Javi Gracia: "Holebas is available for the next game. All the internationals came back in good condition. We only have Tom Cleverley with a problem in his calf. We\'ll see his evolution next week. The rest of the players are available." # FFScout # FPL # GW32 # DGW32 # WatfordFC'
251: b'New # GW32 video is up on YouTube. Get some tips and inspiration for your free hit team here! # FPL https://youtu.be/RHXrRlD2h6Q'
252: b'GW32 Livestream https://www.youtube.com/watch?v=Haoi0d9DsaU&t=960s \xe2\x80\xa6 # FPL # GW32 # FREEHIT'
253: b'Most Transferred out Today 1) Salah MF LIV 13.3 26725 2) Felipe Anderson MF WHU 7.1 10894 3) Man\xc3\xa9 MF LIV 10.0 8714 4) Vardy FW LEI 9.1 8601 5) Alexander-Arnold DF LIV 5.6 8368 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
254: b'Most Transferred in Today 1) Sterling MF MCI 11.6 25579 2) Ag\xc3\xbcero FW MCI 11.8 17368 3) Hazard MF CHE 10.9 10662 4) Jim\xc3\xa9nez FW WOL 6.8 9225 5) Laporte DF MCI 5.9 8261 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
255: b'Been a strange FPL season. Have won my H2H league which was priority due to cash. Will try push up ranks now with all but FHC left. Squad for # GW32 # fpl all tips appreciated and hope to pass on my thoughts pic.twitter.com/PtO2BvBunI'
256: b'For only Double Gameweek 32, who would you buy? Regardless of using Free Hit Chip or not. Vote & RT....feel free to drop replies # GW32 # DGW32 # FPL'
257: b"No injury updates from Ole Gunnar Solskjaer in today's press conference, with talk predictably dominated by his appointment as permanent Manchester United manager. # FFScout # FPL # GW32 # DGW32 # MUFC"
258: b'# FPL # GW32 JK Rowling reveals you need to (C) Hazard'
259: b'For only Double Gameweek 32, who would you buy? Regardless of using Free Hit Chip or not. # GW32 # DGW32 # FPL'
260: b'Player Status Change Sch\xc3\xbcrrle MF FUL 5.5 # FPL # GW32 http://www.fpl247.com'
261: b'Stats pre- # GW32 1. Shots Inside Box 2. Goal Attempt Assists (a.k.a Chances Created) 3. Goal Attempts Conceded Inside Box 4. Big Chances Conceded Back to old template with small adjustments... # FPL pic.twitter.com/Rfbtkbtq7M'
262: b'Parker: "There are slight concerns regarding a couple of the lads who have come back from long distances and will probably only come into the building tomorrow morning - Tim Ream and Mika [Seri] - so we\xe2\x80\x99ll need to look at them." # FFScout # FPL # GW32 # DGW32 # FulhamFC'
263: b'Player Status Change Jagielka DF EVE 4.3 Digne DF EVE 5.2 Mina DF EVE 5.4 Andr\xc3\xa9 Gomes MF EVE 5.4 # FPL # GW32 http://www.fpl247.com'
264: b'NEW POST - Rob Reid @ Thefpl_vet with his fantasy premier league GW32 player picks Rob has finished 3 of the last 4 seasons in the top 0.5% of FPL managers https://www.fantasyfootballgeek.co.uk/rob-fantasy-premier-league-gw32-player-picks/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW32 # DGW32 # freehitpic.twitter.com/PRdrsElrd9'
265: b'Silva on Lucas Digne, Andre Gomes and Phil Jagielka: "They are all OK. Lucas, we have to take care of him in some moments. We have one more session but he looks in condition to play." # FFScout # FPL # GW32 # DGW32 # EvertonFC'
266: b'Marco Silva on Yerry Mina\'s hamstring injury: "Not good news, it\'s serious. Let\'s see how many weeks he will be out. We expect to see Mina training again with us [before the end of the season]." # FFScout # FPL # GW32 # DGW32 # EvertonFC'
267: b'NEW POST - fantasy premier league DGW32 \xe2\x80\x93 captain analysis plus transfer poll and other poll results https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-captain-tips-dgw32-transfer/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW32 # DGW32 # freehit # eplfantasy # fplMY # fplupdates # fplislifepic.twitter.com/sUfSzRwR9S'
268: b"New Always Cheating Podcast tonight! I (aka Josh) will be putting out a new podcast for our Patreon supporters this evening. Q's about # GW32, Free Hit strategy, (C) picks? Let me know. Visit this page to subscribe to exclusive podcasts and more: http://www.patreon.com/alwayscheating # FPL pic.twitter.com/06czCb8eml"
269: b"Once we're into # GW32 it's wall to wall # FPL until the end of the season."
270: b'Dyche on Gudmundsson: "We\'ve got to monitor the fact that he missed some training, missed a game [for Iceland]. We looked at him today, he was on the grass, but we\'ll have to make a call on that." # FFScout # FPL # GW32 # DGW32 # twitterclarets'
271: b'Player Status Change Gro\xc3\x9f MF BHA 6.7 Schindler DF HUD 4.2 Hogg MF HUD 4.4 Williams MF HUD 4.5 Mbenza MF HUD 5.9 # FPL # GW32 http://www.fpl247.com'
272: b"Siewert won't consider Abdelhamid Sabiri for selection just yet despite the midfielder playing for Germany under-21s during the international break. # FFScout # FPL # GW32 # DGW32 # htafc"
273: b'Siewert on Laurent Depoitre: "He just came back to the full team today. He still had problems with his foot. It was his first training session today so he won\'t be able to play at the weekend but he\'s in a good way." # FFScout # FPL # GW32 # DGW32 # htafc'
274: b'Siewert when asked about Jonathan Hogg, Christopher Schindler and Danny Williams: "They are all available and all of them will be a possibility for the squad at the weekend. We had 21 players today in training, which is a good number." # FFScout # FPL # GW32 # DGW32 # htafc'
275: b'Brendan Rodgers says that Leicester City\'s international players have "all come back fit and well". # FFScout # FPL # GW32 # DGW32 # LCFC'
276: b'Scott Parker has revealed that Alfie Mawson is progressing well but will likely need to feature for the under-23s before being considered for first-team selection. # FFScout # FPL # GW32 # DGW32 # FulhamFC'
277: b"Chris Hughton has ruled Pascal Gross out of Brighton's first # GW32 fixture but Florin Andone has trained and will be assessed tomorrow. Davy Propper is fit and available. # FFScout # FPL # GW32 # DGW32 # bhafc"
278: b'Sean Dyche has confirmed that Johann Berg Gudmundsson has trained after picking up a calf injury with Iceland. # FFScout # FPL # GW32 # DGW32 # twitterclarets'
279: b'# FPL # GW32 # OddsAnalysispic.twitter.com/EMrbUfXctG'
280: b'Jan Siewert says that Adama Diakhaby and Demeaco Duhaney are Huddersfield\'s only two confirmed injury-related absentees in # GW32, although adds that Isaac Mbenza "might need another week" before he features in the first team. # FFScout # FPL # DGW32 # htafc'
281: b'Player Status Change Nasri MF WHU 5.1 # FPL # GW32 http://www.fpl247.com'
282: b"Ole Gunnar Solskjaer will also give a press conference today at 4pm GMT after being appointed Manchester United's permanent manager. # FPL # FFScout # DGW32 # GW32"
283: b'Pellegrini: "Samir Nasri has a problem in his calf this week so maybe he won\'t be able to play this weekend." # FFScout # FPL # GW32 # DGW32 # WHUFC'
284: b'An OOP defender, need we say more? Schlupp is in fine form for Palace playing in the more advanced attacking position. With 3 assists and a goal in his last 6, he could offer excellent value, even if they can\xe2\x80\x99t manage a CS vs Spurs away in the double. # FPL # GW32 # FPLCommunitypic.twitter.com/joKw53MgF8'
285: b'Manuel Pellegrini: "I think the players with long injuries - Wilshere, Yarmolenko - continue with their recovery. Andy Carroll is continuing with medical tests. There is no other news." # FFScout # FPL # GW32 # DGW32 # WHUFC'
286: b'FH32 Squad Poll With our FH32 squad 99% decided. Who should get the final spot? Son \xe2\x80\x94 liv + CRY \xe2\x80\x94 3-5-2 Rashford \xe2\x80\x94 WAT + wol \xe2\x80\x94 3-4-3 # FPL # GW32 # FPLCommunity'
287: b'I want to cross 114 points this gw # fpl # dgw # GW32'
288: b"# Refstats are ready to go and they back up the big double gameweek with some favourable appointments. Unfortunately can't post them due to technical difficulties Will get them online at some point tomorrow at least before midday Friday GMT. # FPL # DGW32 # GW32"
289: b'Player Status Change Ings FW SOU 5.4 # FPL # GW32 http://www.fpl247.com'
290: b'Brexit. Sideshow Bob. Cultural Revolutions. Ensconced Managers. Once In A Lifetime Opportunity. Party Poopers. Just your usual # FPL # GW32 Preview. https://twitter.com/FantasyYIRMA/status/1111233362671403009 \xe2\x80\xa6'
291: b'Player Status Change Bednarek DF SOU 4.0 # FPL # GW32 http://www.fpl247.com'
292: b'Draft team #2 Waiting for the pressers, this is what I would choose if today was THE day. Chelsea fixtures are too good and Rashford has a great chance to score big. Aguero (C) inevitable. # FPL # GW32 pic.twitter.com/fgiiyxCoGs'
293: b'Hasenhuttl on whether Shane Long could feature against Brighton: "It would be not so easy without training for a week. We\'ll have a look, we don\'t have to decide it today." # FFScout # FPL # GW32 # DGW32 # SaintsFC'
294: b'Hasenhuttl: "Two players I haven\'t seen so far [after the internationals] are Pierre-Emile Hojbjerg and Mo Elyounoussi. Today I will see them for the first time." # FFScout # FPL # GW32 # DGW32 # SaintsFC'
295: b"Some pretty huge concessions at the back if I wanted this big hitting front 6, it is tempting as I'm not confident about cleans this gameweek but definitely still risky # GW32 # FantasyPL # FPL # FreeHitpic.twitter.com/WgKvkmqFkG"
296: b'Ralph Hasenhuttl: "Shane Long is the only guy [from those away on international duty] who is not fit. Today is the first time training with the team. Danny Ings trained for two weeks now with the team. If he is an option for the starting XI, we will see." # FFScout # FPL # GW32'
297: b'# FPL # GW32 # DGW32 (C)'
298: b'Morning # FPL managers! We have focussed a lot on Free Hit questions and teams, so we want to hear from those managers solely not using their chip. What questions do you have? Let us know! # FPL # FPLCommunity # GW32'
299: b'Hmm which one? No interest in doubling up on Chelsea defence. Like the look of the 3 I have. Alli would give me a great differences but would mean having Jimenez who may have limited minutes any thoughts? # fpl # freehit # gw32 pic.twitter.com/fN0pUi1Lkm'
300: b'# FPL # GW32 # jakgractoznajlepszymi @ FantasyPL_FPL @ fplpoland Zapiera\xc5\x82em si\xc4\x99 r\xc4\x99kami i nogami by nie bra\xc4\x87 Hazarda, ale chuj, jak gra u mnie piach, to niech zagra piach w ca\xc5\x82ym szablonie. Lepiej w t\xc4\x85 ni\xc5\xbc w drug\xc4\x85 stron\xc4\x99.pic.twitter.com/bndSJnwGyB'
301: b'# GW32 Guest Q&A article @ LetsTalkSoccer2 and us have answered your double GW questions Free Hit Essential players Kane or no Kane? Best City triple up Budget mid options http://www.footballadvice.co.uk/gw32-guest-question-and-answer/ \xe2\x80\xa6 # FPL # FPLCommunity # Kane'
302: b"I'm ready! # GW32 # FPL # jakgractoznajlepszymi @ fplpoland @ FantasyPL_FPLpic.twitter.com/pk7llLPc2P"
303: b"Was hoping Hodgson's P.C would be today ... Any 'info' re AWB's chances of featuring V Huddersfield ? @ BenDinnery # FPL # GW32"
304: b'I suppose I should finalise this FH team soon # FPL # DGW32 # GW32'
305: b"# GW32 transfers As the DGW is closing nearer, I've decided to share with you my changes in # FPL team So here they are: Out : Pedro 6.4\xc2\xa3 Pereira 5.3\xc2\xa3 Etheridge 4.7\xc2\xa3 In : Sterling 11.5\xc2\xa3 Shlupp 4.5\xc2\xa3 Ryan 4.4\xc2\xa3 Share your thoughts below! # FPLCommunity # fplfamilypic.twitter.com/Cj2RnVzKRL"
306: b'Most Transferred out Today 1) Salah MF LIV 13.3 6596 2) Felipe Anderson MF WHU 7.1 2735 3) Alexander-Arnold DF LIV 5.6 2108 4) Vardy FW LEI 9.1 2091 5) Man\xc3\xa9 MF LIV 10.0 2087 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
307: b'Most Transferred in Today 1) Sterling MF MCI 11.6 6230 2) Ag\xc3\xbcero FW MCI 11.8 4224 3) Hazard MF CHE 10.9 2669 4) Jim\xc3\xa9nez FW WOL 6.8 2370 5) Laporte DF MCI 5.9 2077 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
308: b'To everyone not playing their Free Hit chip this weekend: What level of point hit are you taking? # FPL # GW32'
309: b'3-5-2 ... is this my answer? Am I mad to go back to Sane? Patiently awaiting Friday night now to finalise # FPL # FPLCommunity # FantasyPL # GW32 # DGW32pic.twitter.com/IXeHdfuLCM'
310: b'With five top 1k # FPL finishes between them, our Scout Squad panel have been compiling their # GW32 squads. The 18-man longlists of @ FFScout_Paul, @ FFScout_Joe, @ ffscout_az and Peter Kouwenberg are dominated by players with a Double Gameweek.https://www.fantasyfootballscout.co.uk/2019/03/28/the-scout-squad-for-fpl-double-gameweek-32/ \xe2\x80\xa6'
311: b'Overnight price fallers Felipe Anderson MF WHU 7.1 Nasri MF WHU 5.1 # FPL # GW32 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
312: b'Overnight price risers Valery DF SOU 4.1 # FPL # GW32 http://www.fpl247.com/player/price/weekly?change=rise \xe2\x80\xa6'
313: b'Overnight players unavailable Xhaka MF ARS 5.2 Powell MF WHU 4.5 # FPL # GW32 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
314: b'# FPL Gameweek 32 # GW32 FISO Preview - https://www.fiso.co.uk/fpl-season-2018-19-gameweek-32-preview/ \xe2\x80\xa6'
315: b'THANK YOU TO ALL THAT JOINED US LIVE LAST NIGHT DISCUSSING DGW32 https://youtu.be/h-ddf_mdHww # fpl # fantasyfootball # fantasyfootballdraft # fantasyfootballscout # fantasyleague # fantasypremierleague # premierleague # premiership # englishpremier # epl # DGW32 # GW32 # FPLCommunitypic.twitter.com/hun8vsYHzF'
316: b'@ OfficialFPL Price Changes (645 am IST - 28th Mar 2019) Price Rises: Valery # SaintsFC \xc2\xa34.1 Price Drops: Nasri # WHUFC \xc2\xa35.1 Felipe Anderson # WHUFC \xc2\xa37.1 # FFEPriceChanges # FPL # GW32'
317: b'Available FPL forwards from all the DGW teams: Combined Goals/assists (Last 4 PL appearances) Deeney Ag\xc3\xbcero Jimenez Kane Zaha Deeney, at \xc2\xa35.9m, is the cheapest player on this list. He\xe2\x80\x99s on Pens too, by the way! # fpl # gw32 pic.twitter.com/nNky2hY8Zc'
318: b'Price Changes (3/28/2019) Risers: Valery \xc2\xa34.1m Fallers: Felipe Anderson \xc2\xa37.1m Nasri \xc2\xa35.1m # FPL # GW32 # FPL_Price'
319: b'FPL OFFICIAL Price Changes (3/28/2019) Overnight Risers: Valery \xc2\xa34.1m Overnight Fallers: Felipe Anderson \xc2\xa37.1m Nasri \xc2\xa35.1m # FPL # GW32 # FPL_PriceChanges # Aye'
320: b'# FPL # FPLCommunity # FantasyPL # GW32 # upthe6thgoalhttps://twitter.com/6thGoal/status/1110710829681303553 \xe2\x80\xa6'
321: b'Wow they made it # FPL # FPLCommunity # FantasyPL # GW32 # upthesurgeryhttps://twitter.com/FPLSurgery/status/1111041025714339840 \xe2\x80\xa6'
322: b'125th EPISODE OF THE # FPL SURGERY PODCAST Surgeons are joined none other than the # FPL veteran, 6 time top 25k finisher & @ FFScout legend Andy from @ LetsTalk_FPL Free hit teams are revealed as we go over the best teams for this # GW32 https://soundcloud.com/fplsurgery/125thEpi \xe2\x80\xa6 # upthepod'
323: b"My free hit team is locked in unless I hear some awky press conference news. The tinkering needs to stop. I've realized the game is simple enough to find a clean sheet elsewhere other than using a City spot on that. High risk/high reward. Just need a cleanie vs Huddy # fpl # gw32 pic.twitter.com/3j4RWOxucL"
324: b"It's here!!!! # FPL # FPLCommunity # FantasyPL # GW32 # uptheplanethttps://twitter.com/PlanetFPLPod/status/1110999175829831682 \xe2\x80\xa6"
325: b'Opinions? # FPL # freehit # GW32 pic.twitter.com/h2L6Copple'
326: b'My current thoughts for FH to partner Aguero is: 1.Lukaku 2.Rashford 3.Kane 4.Higuain 5.Deeney 6.Murray 7.Bats 8.Zaha All depending on fitness/pressers # GW32 # fpl'
327: b'Wait...what? # FPL # GW32 https://twitter.com/TheTinkerMen/status/1111013244708290561 \xe2\x80\xa6'
328: b'# gw32 # fpl # cpfc putting so much faith in crystal palace pic.twitter.com/ZyGquOb7Mx'
329: b"And of course, there is MUCH MORE than that once you open your own account! Feel free to check it up, it is 100% free! We'll twit more about everything tomorrow! # FPL # FPLCommunity # DGW32 # GW32"
330: b'@ FPLPriceChanges Aguero price rise any time soon, Please ? # FPL # GW32'
331: b"But, as it is stated on screenshot above, you can connect up to 3 different # FPL teams, to follow them all! We'll of course use No. 1 overall as an example # GW32 # DGW32 # FPLCommunitypic.twitter.com/PRvVtL6NDC"
332: b'Mixing it up! The @ FPLGeneral has come up with some really exciting differential picks for # GW32 How many of his suggested players will you add to your # FPL team? See the complete list here https://www.fantasybet.com/blog/five-best-differentials-gameweek-32/?utm_source=twitter&utm_medium=social&utm_campaign=talk32 \xe2\x80\xa6'
333: b'When you log in you are accessing your own dashboard where you can connect your team using your # FPL ID! # GW32 # DGW32pic.twitter.com/Xp32cPsDVo'
334: b'As of this evening you can now make your own account on our website! https://foomnianalytics.com/signup.php # FPL # FPLCommunity # GW32 # DGW32'
335: b"# FPL TIPS Just before he gets to work on draft number 963 in his own free hit team this # GW32, @ eugoogooly has put together a brilliant round up of his thoughts on the players you're no doubt considering for your own DGW squad.https://fantasyfootball247.co.uk/fantasy-football-tips-gameweek-32-2/ \xe2\x80\xa6"
336: b"Don't know if that making it easier or harder, but I Fancy ALL of City assets to play once this week, except Ederson. Same for Wolves and Watford. # FPL # GW32"
337: b"We've analysed the minutes played by Wolves, Watford and Brighton assets ahead of Gameweek 32 - but there's much uncertainty with the FA Cup semi-finals looming: https://www.fantasyfootballscout.co.uk/2019/03/27/starts-for-wolves-and-watfords-assets-tough-to-predict-in-gameweek-32/ \xe2\x80\xa6 # FPL # GW32 # DGW32 # BHAFC # watfordfc # wwfc"
338: b"Just three days to join our end-of-season Mini League from # GW32 to # GW38 Come and join us for the last few weeks of the season... # FPL # FPLCommunity RT's appreciatedpic.twitter.com/ruap0uaGqO"
339: b'http://YOUTUBE.COM/ELITEFPLPODCAST # fpl # fantasyfootball # fantasyfootballdraft # fantasyfootballscout # fantasyleague # fantasypremierleague # premierleague # premiership # englishpremier # epl # youtube # podcast # DGW32 # GW32 # FPLCommunitypic.twitter.com/LHzvrVAWKO'
340: b'# FPL # FPLCommunity # FantasyPL # GW32 https://twitter.com/fplchancer/status/1110987127863631872 \xe2\x80\xa6'
341: b'# FPL # FPLCommunity # FantasyPL # GW32 # uptheacademyhttps://twitter.com/The_FFAcademy/status/1110942558547394561 \xe2\x80\xa6'
342: b'GET INVOLVED WITH US AT 8PM http://YOUTUBE.COM/ELITEFPLPODCAST # fpl # fantasyfootball # fantasyfootballdraft # fantasyfootballscout # fantasyleague # fantasypremierleague # premierleague # premiership # englishpremier # epl # youtube # podcast # DGW32 # GW32 # FPLCommunitypic.twitter.com/r6HknAHc4d'
343: b'While his league form has been somewhat lacking of late, Hazard might have reignited his attacking game while on international duty. 3 goals over the IB could well kickstart his confidence again just in time for Cardiff and Brighton\xe2\x80\x99s leaky defences. # FPL # GW32 # FPLCommunitypic.twitter.com/iMoEw5nU5m'
344: b'The FPL 6 Picks Competition is now open! Link: https://youtu.be/x2LgASzIA-Q Featured tweets & content from: @ LetsTalk_FPL @ DavidMunday815 @ FPLTIPZ @ _FPLFox @ StatOnScout @ FPLHeskibo @ James_FPL @ FPLresearch @ gwhizz420 @ FPLEscritor @ FPLSecrets Thanks folks! # fpl # gw32 pic.twitter.com/Oz2YBlj0FV'
345: b'How are current line up stands. Heavily reliant on City, Chelsea and United but seems balanced across the whole XI. Thoughts? # FPL # GW32 # FPLCommunitypic.twitter.com/rHdmTgDFDd'
346: b"# FPL Gameweek 32 is dissected by three premium assets and one emergency bench fodder option. @ ffscout_luke, @ ffscout_az, @ FFScout_Joe and @ DavidMunday815's stunt double, @ SkontoRigga, present a position-by-position guide to # GW32. https://www.fantasyfootballscout.co.uk/2019/03/27/scoutcast-episode-289-double-bubble/ \xe2\x80\xa6"
347: b'Most Transferred out Today 1) Salah MF LIV 13.3 17573 2) Felipe Anderson MF WHU 7.2 6740 3) Man\xc3\xa9 MF LIV 10.0 5497 4) Alexander-Arnold DF LIV 5.6 5467 5) Vardy FW LEI 9.1 5353 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
348: b'Most Transferred in Today 1) Sterling MF MCI 11.6 17241 2) Ag\xc3\xbcero FW MCI 11.8 10675 3) Hazard MF CHE 10.9 6636 4) Jim\xc3\xa9nez FW WOL 6.8 5877 5) Laporte DF MCI 5.9 5267 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
349: b"This week we'll be closely watching who can select better team based on our projections, our very own Algo, or @ wiscostretford's algorithm. Watch this space! # FPL # FPLCommunity # GW32"
350: b"NEW # FPL ARTICLE There's plenty of talk of Tottenham's main man ahead of the # GW32 deadline... Check out this fantastic piece from @ FPLSaint about Harry Kane and how he could help your team this gameweek!https://wp.me/parXFx-ko"
351: b'Player Status Change Pr\xc3\xb6pper MF BHA 4.8 # FPL # GW32 http://www.fpl247.com'
352: b'# FPL # GW32 # DGW32 Who is the must have Defenders for this GW?'
353: b'Hughton: "I\xe2\x80\x99m fortunate that I have got two good full-backs in [Montoya] and Bruno, he is still a very good level full-back. I have tended to go with a little more consistency in the back four, hence why he [Montoya] and Bernardo have played." # FFScout # FPL # GW32 # DGW32'
354: b"Could be greedy and take a hit this week to get maximum double game week players. But concentrating on my mini leagues I don't think it's necessary, will leave the hits to next week. # FPL # GW32 pic.twitter.com/MlYnNCH14A"
355: b"Hi Guys, could you rate my first FH draft? I'm a bit late but it's been a really busy time. Alli or Son - Or even Kane but the team looks better overall without him Luiz or Azpilicueta # FH32 # FPL # GW32 pic.twitter.com/MKfKppcTif"
356: b'The Free Hit is in play for # GW32! # FPL pic.twitter.com/VZuA7CeOS7'
357: b"NEW POST - fantasy premier league # DGW32 - the FFGeek imaginary # wildcard In the article I've used @ jwcrilley excellent team planning tool to navigate this team through the blanks and doubles. https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-wildcard-tips-dgw32-imaginary/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # GW32 # freehitpic.twitter.com/KIX7yOn7Of"
358: b"Mick McCarthy has explained why Matt Doherty was only a substitute for Ireland ahead of Wolves' Double Gameweek 32: https://www.fantasyfootballscout.co.uk/2019/03/27/doherty-benched-by-ireland-ahead-of-busy-week-for-wolves/ \xe2\x80\xa6 # FPL # GW32 # DGW32 # FantasyPL"
359: b'I am position 4,063,093/6,270,007 on # FPL overall ... How bad are the 2 million managers I have defeated. They should resign! # FPLCommunity # FantasyFootball # PL # GW32 pic.twitter.com/gESwm6O7jp'
360: b'One of us has taken a BIG hit Find out who, tonight live 8pm http://youtube.com/elitefplpodcast # fpl # fantasyfootball # fantasyfootballdraft # fantasyfootballscout # fantasyleague # fantasypremierleague # premierleague # premiership # englishpremier # epl # youtube # podcast # DGW32 # GW32 pic.twitter.com/rIhE0ZcgpH'
361: b'# FPL # GW32 Free Hit Draft No.9: Higuain & Triple City Attack?? Defense suffers slightly but still have Lindelof & Kepa. Reckon Higuain will get minutes in both games? CHE x3, MU x3, MC x3. pic.twitter.com/W0HWNYL6g9'
362: b'Show me something better # FPL # DGW32 # GW32 pic.twitter.com/sFKtxRXIm5'
363: b'Player Status Change Xhaka MF ARS 5.2 # FPL # GW32 http://www.fpl247.com'
364: b'# FPL You # GW31 VS the Guy She Tells You Not to Worry About # GW32 pic.twitter.com/FOr5NZbBfU'
365: b"# FPL # GW32 Free Hit Draft No.7: Sword all the way! That front 3 though! Considering Lukaku's news, we try bringing in Rashford to pair with Kane & Kun. Heavily sacrificing the defense. Do or die moment? pic.twitter.com/Aoy9J9FN7m"
366: b"GW32 FANTRAX CHAPS CHOICES We're baaaaack! Our Alternative XI for @ Fantrax_EPL is now live! Check out our starting XI of differential players ahead of # GW32 - all players with 60% ownership or below!! # Fantrax # FPLDraft # Togga # FPL https://wp.me/p9fTDR-1E7"
367: b'Which single gameweek player do you think will score 10+ points in GW32? # GW32 # DGW # FPL'
368: b"3 # Lfc Players 7 DGW's 1 Injured 1 Suspended Maddison Rice Boruc # NoFreeHit # FPL # GW32"
369: b'# FPL # FPLCommunity # FantasyPL # GW32 https://twitter.com/FPLCanuck/status/1110638397511663627 \xe2\x80\xa6'
370: b'Clean sheet probability according to the bookies. # FPL # GW32 # DGW32pic.twitter.com/FtaeW1yy0v'
371: b'NEW POST - fantasy premier league GW32 \xe2\x80\x93 forward player rankings https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-tips-forwards-gw32-rankings/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW32 # DGW32 # freehitpic.twitter.com/U73lSxKrc0'
372: b"Our preliminary team for # DGW32 has been updated! Still, a lot of time for further changes based on injuries and selection news. Don't miss our final # GW32 team which will be published after Friday pressers! # FPL pic.twitter.com/Ka8bqldKDG"
373: b'Free hit tinkering! I don\xe2\x80\x99t trust Wolves rotation with the FA cup coming up & I\xe2\x80\x99m sceptical about Spurs, opinions much appreciated guys! # FPL # FreeHit # GW32 pic.twitter.com/6d8BjYEcrq'
374: b'The news that Lukaku had an injury setback makes Rashford vs. Kane a genuine debate. Would allow for a CHE defensive double-up and a midfield upgrade # FPL # GW32 pic.twitter.com/5BpG88OjO9'
375: b'Free Hit or TC this week ? # FPL # GW32'
376: b"Lots of # FPL players were in international friendly action (or not) yesterday. Jesus, Firmino, Alisson, Richarlison Mane Son Jimenez Mahrez Pereyra Here's how they got on: https://www.fantasyfootballscout.co.uk/2019/03/27/son-jesus-and-mane-on-target-as-jimenez-gets-a-pre-gameweek-32-rest/ \xe2\x80\xa6 # GW32 # DGW32"
377: b'MEN report that Lukaku could miss upcoming fixtures against Watford and Wolves as he continues his rehabilitation from a foot injury. # FPL # GW32 # DGW32https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-injury-news-lukaku-16033762 \xe2\x80\xa6'
378: b'I know I should stop with tinkering with my Free Hit, but I can\xe2\x80\x99t. Anyone going with a 4-5-1 formation? I\xe2\x80\x99m struggling on the forwards so maybe, I\xe2\x80\x99ll just go with Aguero. # FPLCommunity # FPL # GW32 # FHpic.twitter.com/K5BU79jNPD'
379: b'Big news about United\xe2\x80\x99s big man! Lukaku is being considered a doubt for GW32 with the report saying they\xe2\x80\x99re optimistic to have him back vs Barcelona. Does this solve problems for FPL managers or just tear up your plans? # FPL # GW32 # FPLCommunity https://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-injury-news-lukaku-16033762 \xe2\x80\xa6'
380: b'E.g Pogba. Was in my team last week but tried a FH team without him and confirmed. Now when buying back Im buying at his current price and not what I bought him for pre FH? Any ideas? # FPL # FantasyPL # gw32'
381: b'http://YOUTUBE.COM/ELITEFPLPODCAST # fpl # fantasyfootball # fantasyfootballdraft # fantasyfootballscout # fantasyleague # fantasypremierleague # premierleague # premiership # englishpremier # epl # youtube # podcast # gw32 # dgw32 # FPLCommunitypic.twitter.com/mRWlsO3n6o'
382: b'Lukaku to miss both United games Well that def helps me out as I\xe2\x80\x99ve been deliberating to take him in my FH team # FPL # Lukaku # Mufc # GW32 http://www.manchestereveningnews.co.uk/sport/football/football-news/manchester-united-injury-news-lukaku-16033762 \xe2\x80\xa6'
383: b'If Rashford and Lukaku are declared fit for # GW32, does either make your Free Hit team? # FPL # FPLCommunity # Rashford # Lukaku'
384: b'Who\xe2\x80\x99s essential in Double # GW32? Best bargain midfield options? To Kane or not to Kane? Man City triple-up? These are the topics addressed with @ FootballAdvice5 in our latest collab. Check it out below. # FPL # FPLCommunityhttp://www.footballadvice.co.uk/gw32-guest-question-and-answer/ \xe2\x80\xa6'
385: b'Looking for that budget striker to fit into your Free Hit team? Then you need to check out our latest budget thread, highlighting the best option # FPL # FPLCommunity # GW32 https://twitter.com/FootballAdvice5/status/1110493285196447746 \xe2\x80\xa6'
386: b'It seems that the # FPLCommunity is full of Free Hit chat and teams. Interested to know, what is your plans for # GW32? If you\xe2\x80\x99re not using your Free Hit, show us your team! # FPL'
387: b'I think we should all look to bring in Barnes for this gameweek instead of Jimenez. Barnes is also playing next week, Jimmy isn\xe2\x80\x99t. # fpl # gw32 # DGW32'
388: b'# GW32 Guest Q&A article @ LetsTalkSoccer2 and us have answered your double GW questions Free Hit Essential players Kane or no Kane? Best City triple up Budget mid options http://www.footballadvice.co.uk/gw32-guest-question-and-answer/ \xe2\x80\xa6 # FPL # FPLCommunity # Kane'
389: b'For # FPL free hitters: who is the single gameweek player you fear the most this gameweek? # GW32'
390: b'FH32 Combinations Poll Who returns more (assuming all are fit to play)? Laporte + Lukaku Or David Silva + Son # FPL # GW32 # FPLCommunity'
391: b'# gw32 # DGW32 # FPLBeerClub # FPLCommunity # fpl # FPLpod thoughts?'
392: b'@ FPLGeneral really enjoyed listening to the podcast, good tips for the up and coming double game week. # fpl # gw32'
393: b'If you had all of the chips which one would you rather use this gw? Struggling with my decision # Fpl # Gw32'
394: b'This is how my current # FreeHit team is looking for # GW32 # FPL # FantasyPLpic.twitter.com/7sNSdKyx0g'
395: b'Player Status Change Powell MF WHU 4.5 # FPL # GW32 http://www.fpl247.com'
396: b'Tottenham vs. Crystal Palace. Winner? # GW32 # FPL'
397: b'Manchester City vs. Cardiff City. Winner? # GW32 # FPL'
398: b'Chelsea vs. Brighton & Hove Albion. Winner? # GW32 # FPL'
399: b'Kevin De Bruyne, Fernandinho, Benjamin Mendy and John Stones all involved in training on Monday ahead of GW32 https://www.football.london/tottenham-hotspur-fc/fixtures-results/spurs-news-man-city-injuries-16029272?utm_source=twitter.com&utm_medium=social&utm_campaign=sharebar \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW32 # DGW32 # freehit'
400: b'Wolverhampton vs. Manchester United. Winner? # GW32 # FPL'
401: b'Watford vs. Fulham. Winner? # GW32 # FPL'
402: b'Arsenal vs. Newcastle. Winner? # GW32 # FPL'
403: b'Liverpool vs. Tottenham. Winner? # GW32 # FPL'
404: b'Cardiff City vs. Chelsea. Winner? # GW32 # FPL'
405: b'West Ham vs. Everton. Winner? # GW32 # FPL'
406: b'Manchester United vs. Warford. Winner? # GW32 # FPL'
407: b'Leicester City vs. AFC Bournemouth. Winner? # GW32 # FPL'
408: b'Crystal Palace vs. Huddersfield Town. Winner? # GW32 # FPL'
409: b'Burnley vs. Wolverhampton. Winner? # GW32 # FPL'
410: b'Brighton & Hove Albion vs. Southampton. Winner? # GW32 # FPL'
411: b'Fulham vs. Manchester City. Winner? # GW32 # FPL'
412: b'Det n\xc3\xa6rmer seg GW 32, og for mange betyr det at man endelig skal benytte chippen Free Hit F\xc3\xa5r vi se noen av deres utkast s\xc3\xa5 langt? # GW32 # Fpl'
413: b'Averaging almost 5ppg over his last 6 games, Azpilicueta is our pick from the Chelsea defence for this double gameweek. Having seemingly rediscovered his attacking rhythm and wearing the armband, he seems the most reliable for their defence. # FPL # GW32 # FPLCommunitypic.twitter.com/vsqXeh5Ut2'
414: b'# FPL # FPLCommunity # GW32 # DoubleGameweek32 https://twitter.com/premierleague/status/1110659457925767169 \xe2\x80\xa6'
415: b'Most Transferred out Today 1) Salah MF LIV 13.3 4446 2) Felipe Anderson MF WHU 7.2 1541 3) Man\xc3\xa9 MF LIV 10.0 1377 4) Alexander-Arnold DF LIV 5.6 1343 5) Vardy FW LEI 9.1 1332 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
416: b'Most Transferred in Today 1) Sterling MF MCI 11.6 4293 2) Ag\xc3\xbcero FW MCI 11.8 2606 3) Hazard MF CHE 10.9 1685 4) Jim\xc3\xa9nez FW WOL 6.8 1427 5) Laporte DF MCI 5.9 1291 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
417: b'Check out our player selection for free hit in # GW32. https://youtu.be/yPYY8-pwGDU The next video in which we will suggest various drafts is coming tomorrow! # FPL pic.twitter.com/CwOxqZjoGr'
418: b"Raheem Sterling: right flank v left flank Ahead of Double Gameweek 32, we study how the Man City winger's starting position affects his goal threat. https://www.fantasyfootballscout.co.uk/2019/03/27/how-sterlings-position-change-has-affected-his-fpl-form/ \xe2\x80\xa6 # GW32 # DGW32 # FPL # MCFC"
419: b'Overnight price fallers Bamba DF CAR 4.5 # FPL # GW32 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
420: b'Overnight players unavailable Gudmundsson MF BUR 5.5 Arter MF CAR 4.9 Mina DF EVE 5.4 Bednarek DF SOU 4.0 # FPL # GW32 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
421: b'Overnight players available Sabiri MF HUD 4.3 # FPL # GW32 http://www.fpl247.com/player/returning \xe2\x80\xa6'
422: b'FPL OFFICIAL Price Changes (3/27/2019) Risers: None Fallers: Bamba \xc2\xa34.5m # FPL # GW32 # FPL_Price'
423: b'FPL OFFICIAL Price Changes (3/27/2019) Overnight Risers: None Overnight Fallers: Bamba \xc2\xa34.5m # FPL # GW32 # FPL_PriceChanges # Aye'
424: b'The latest The andyhowtt Daily! https://paper.li/andyhowtt?edition_id=941f9310-504a-11e9-b211-0cc47a0d164b \xe2\x80\xa6 Thanks to @ FPL_Guidance @ atreyustrange @ prasys # fpl # gw32'
425: b'@ OfficialFPL Price Changes (645 am IST - 27th Mar 2019) Price Rises: None Price Drops: Bamba # CardiffCity \xc2\xa34.5 # FFEPriceChanges # FPL # GW32'
426: b'Player Status Change Arter MF CAR 4.9 Duffy DF BHA 4.7 Sabiri MF HUD 4.3 # FPL # GW32 http://www.fpl247.com'
427: b'Big decision who to TC for # GW32 # FPL'
428: b'Poor Jimenez. Lonely down there in the Wolves forwards section... Makes me more confident of him starting both DGW games though # FPL # GW32 pic.twitter.com/NFh7Xv7snR'
429: b"My musings on the gameweek ahead # FPL # GW32 Why I'm captaining Sterling Crystal Palace gems Teams to target Free hit team for those using it My team and transfers https://wp.me/p9Wmz0-w4"
430: b"Excellent thread for those immediately ruling out Hazard as a captain pick Though it's not much use to me unfortunately not owning Hazard # FPL # GW32 https://twitter.com/FPLoverthinker/status/1110481886072238081 \xe2\x80\xa6"
431: b"FH32 Provisional Squad So following our FH32 Squad polls, we've shaken off the Mane-madness and turned onto the offensive! Ederson our makes way for David Silva and Milivojevic upgrades to Son. Only small compromise being Azp to Luiz. # FPL # GW32 # FPLCommunitypic.twitter.com/v9JbaquiAl"
432: b'Son scores a goal just in time to fire himself into DGW form! # FPL # GW32 # FPLCommunityhttps://twitter.com/SpursOfficial/status/1110526140983230466 \xe2\x80\xa6'
433: b'Let\xe2\x80\x99s help @ EricDFreeman out - what\xe2\x80\x99s your plan if you don\xe2\x80\x99t have a Free Hit Chip for # GW32? # FPL https://twitter.com/EricDFreeman/status/1110581210055622658 \xe2\x80\xa6'
434: b'Jurgen Klopp: "Trent still feels his back. We are not 100 per cent sure, so we have to watch him. Trent wants to [be] 100 per cent, but we have to see. Hopefully [between] tomorrow and Thursday he can be back in full training and then it should be fine.\xe2\x80\x9d # FFScout # FPL # GW32'
435: b'Updated: tinkered with my squad this afternoon - thanks to some advice/suggestions from the people in this thread and came up with an alternative version. I would, effectively, be swapping Kante for Lindelof in this scenario. # FPL # GW32 pic.twitter.com/NA1IgFCadT'
436: b'Me to Pep Guardiola when he benches Aguero and Sterling against Fulham... # FPL # GW32 pic.twitter.com/DTLKIMLPfl'
437: b'\xc2\xa9 # DGW32 captain picks # FPL Aguero, Sterling, Pogba, Hazard & Eriksen (diff) @ JHardingSport @ OfficialFPL @ Caley_graphics @ ahopcroft13 @ DevilsOfUnited @ fplchancer @ neilswmurrayFPL TY all # FPLcommmunity # fantasypl # freehit # wildcard # GW32 https://www.thestatszone.com/fpl-double-gameweek-32-captain-picks-18-19 \xe2\x80\xa6pic.twitter.com/VRtRHBOq7F'
438: b"Can't wait to record this week's KTS podcast for Patrons. Much, much (seriously, so much) still to discuss re: # GW32 Click below to support The Cheaters and get access to: A) Exclusive pods B) A private Slack network C) Patreon-only leagues & more. http://www.patreon.com/alwayscheating # FPL"
439: b"Haven't posted for a while as I've been in Madrid but put together a potential # DGW32 team below Had extra cash so reinforced my bench just in case Pep roulette or similar occurs Thoughts/suggestions? # FPL # GW32 # FPLCommunity # FreeHitpic.twitter.com/UvzxYBcibi"
440: b'Triple Captain Sterling or Aguero # FPL # GW32'
441: b'So Lee Probert will be the referee for # CRYHUD game. He only gave 4 penalties this season, 2 of them in the same game for Brighton. Not convinced that he will give penalty for Mili this # GW32 # FPL # FPLCommunity'
442: b'Coming tomorrow: Our newest collab with @ FootballAdvice5, covering some of the most-pressing topics for Double # GW32... Essential players for the week Harry Kane Tripling-up on Man City players The Best budget midfielders # FPL # FPLCommunity @ OfficialFPLpic.twitter.com/fu8vRXMnIa'
443: b"Have you been asking this question? We've made it easy for you to decide Watch now: https://youtu.be/iFLYdfL3UWY # FPL # GW32 # Salah < Admin : # RG > https://youtu.be/iFLYdfL3UWY"
444: b'# FPL # GW32 Preview 1FT (-8) Rice Laporte Salah Sterling Vardy Ag\xc3\xbcero Ag\xc3\xbcero OR 26,915 pic.twitter.com/uCefuf3vC1'
445: b'Mendy? Too big of a risk? We know he\xe2\x80\x99s in training and probably fit, but will he play? Worth? # fpl # FPLCommunity # GW32 # mcfc'
446: b'# FPL # FPLCommunity # FantasyPL # GW32 # captainpickshttps://twitter.com/FFCommunity_/status/1110572784818769921 \xe2\x80\xa6'
447: b'Most Transferred out Today 1) Salah MF LIV 13.3 13037 2) Felipe Anderson MF WHU 7.2 4686 3) Rashford FW MUN 7.6 3955 4) Man\xc3\xa9 MF LIV 10.0 3951 5) Alexander-Arnold DF LIV 5.6 3651 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
448: b'Most Transferred in Today 1) Sterling MF MCI 11.6 13815 2) Ag\xc3\xbcero FW MCI 11.8 7426 3) Hazard MF CHE 10.9 4658 4) Jim\xc3\xa9nez FW WOL 6.8 4137 5) Laporte DF MCI 5.9 3873 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
449: b'Our # GW32 Q&A article will be dropping tomorrow morning, featuring our good friends @ LetsTalkSoccer2 We will be discussing the hottest topics including Harry Kane and Man City triple ups # FPL # FPLCommunitypic.twitter.com/kYvPf3pOCU'
450: b'Tweet us with some of your Non-FH teams for GW32. Let\xe2\x80\x99s see how they\xe2\x80\x99re lining up! # FPL # GW32 pic.twitter.com/cCB9oLLIYp'
451: b'# FPL # FPLCommunity # FantasyPL # GW32 # uptheassisthttps://twitter.com/WGTA_FPL/status/1110503849180258304 \xe2\x80\xa6'
452: b'At this rate, am taking leave from work to work on my free hit. # FPL # FPLCommunity # GW32 @ OfficialFPL'
453: b"NEW POST - Fantasy premier league GW32 captain poll \xe2\x80\x93 plus a transfer in and out poll and others There's a number of additional polls related to DGW32 https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-gw32-captain-poll-transfer/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW32 # DGW32 # freehitpic.twitter.com/m8zC0gHRm9"
454: b'Player Status Change Gudmundsson MF BUR 5.5 # FPL # GW32 http://www.fpl247.com'
455: b'# FPL # GW32 # DGW32 Who is the must have Midfielders for this GW?'
456: b'# FreeHit # GW32 # FPL pic.twitter.com/Ig4W8nDc2f'
457: b'Best Spurs option for GW32? (other than Kane) # fpl # GW32 Or comment someone else?'
458: b'David Silva Dilemma Lots of people on here have been toying with Man City midfield maestro, David Silva, as their 3rd City Pick in their FH team. Question for this poll is: How many minutes does he play in DGW32? # FPL # GW32 # FPLCommunity # FreeHit'
459: b'Now that we\xe2\x80\x99re right in the deep end of GW32 prep, who is playing their Free Hit chips? # FPL # GW32 # FPLCommunity'
460: b"Yerry Mina was substituted after 42 minutes of Colombia's game against South Korea today because of an apparent hamstring injury. # FFScout # FPL # GW32 # DGW32 # EvertonFC"
461: b'The Manchester Evening News report that Kevin de Bruyne, John Stones, Benjamin Mendy and Fernandinho all trained on Monday. # FFScout # FPL # GW32 # DGW32 # MCFC'
462: b"It's four goals and three assists for Raheem Sterling over the international break... Our latest round-up for # FPL managers takes in England's win over Montenegro and details the minutes played by other Double Gameweek 32 assets: https://www.fantasyfootballscout.co.uk/2019/03/26/more-attacking-returns-for-sterling-and-kane-as-gameweek-32-nears/ \xe2\x80\xa6 # GW32 # DGW32"
463: b'| Double Gameweek Q&A video! Reply to this with your # FPL questions for # GW32 and stay tuned for the video Wednesday night # FPLCommunity # DGW32pic.twitter.com/H9ryRVrI6x'
464: b'Big question - # DGW32 Captaincy? ... # FPL # FantasyPL @ OfficialFPL # FPLCommunity # freehit # GW32'
465: b"Raheem's 180 minutes for # ENG means I'm 'swaying' towards Aguero ( T/C ) ... # FPL # GW32"
466: b'NEW POST - fantasy premier league GW32 \xe2\x80\x93 midfield player rankings https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-tips-midfielders-gw32-rankings/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fantasypl # GW32 # DGW32 # freehit # eplfantasy # fplMY # fplupdates # fplislife # fantasypremierleagueislife # FPLus # fpltreview # wildcard # fplwildcardpic.twitter.com/PvJTaWl5Lv'
467: b'# FPL # GW32 Free Hit Draft No.7: Man City Sword Considering Man City have to go all out to challenge for the title against the 2 poorest teams in the league, goals galore incoming. My concern is double up on CHE defense. pic.twitter.com/l8cliwmEkl'
468: b'For those managers that were planning to captain someone other than Sterling in # GW32, has his continued strong form during the international break swayed your thoughts towards captaining him instead? # FPL # FPLCommunity'
469: b'Big changes to my Free Hit squad as Hazard (ugh) comes into my squad. I like the balance here. A few notes: - Kante\xe2\x80\x99s 2 potential CS baps helps cover squads with 2x CHE defense - AWB stays only if Hodgkin gives a positive update - Jimi also stays! For now. Thoughts? # FPL # GW32 pic.twitter.com/a58UcSt9mO'
470: b'Player Status Change Bednarek DF SOU 4.0 # FPL # GW32 http://www.fpl247.com'
471: b'# gw32 # fpl any thoughts on the FH team? Retweets appreciated. 0.2 itb. pic.twitter.com/kVgIjsRfuh'
472: b"Podcast Alert - Episode 33 We're back and all fired up for # GW32. After the duldrums of GW31 and with Free-Hit chips in hand, we march towards a most welcome Double Gameweek. It's the business end of the # FPL season, gamefaces are well and truly on! https://soundcloud.com/user-768411468/fplhangoverep33 \xe2\x80\xa6"
473: b"Seven week mini league to see out the season - # GW32 to # GW38. It's a sprint not a marathon! # FPL # FPLCommunity Come and join in. RT's appreciated.pic.twitter.com/mD7jErgDgF"
474: b'First Free Hit Draft, with 0.7m ITB. Give me some feedback, please # FPL # GW32 # FreeHitpic.twitter.com/gQXd4mL87u'
475: b'Am I the only one with De Gea for # GW32?I know Ederson & Kepa have the "easiest" games but I think that minimizes the chance for save points IF they concede as they\'ll probably dominate possession. I can see save points for De Gea as Watford & Wolves will actually attack # FPL'
476: b"Here's our suggested lineup. We plan to buy back Salah immediately after the deadline - if he scores at least 1 goal. We'll provide further updates soon. # DGW32 # GW32 # FPL pic.twitter.com/9sRpjRQVKI"
477: b'Most Transferred out Today 1) Salah MF LIV 13.3 3545 2) Felipe Anderson MF WHU 7.2 1230 3) Rashford FW MUN 7.6 1085 4) Man\xc3\xa9 MF LIV 10.0 1071 5) Alexander-Arnold DF LIV 5.6 1029 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
478: b'Most Transferred in Today 1) Sterling MF MCI 11.6 3673 2) Ag\xc3\xbcero FW MCI 11.8 1957 3) Hazard MF CHE 10.9 1309 4) Jim\xc3\xa9nez FW WOL 6.8 1144 5) Laporte DF MCI 5.9 1116 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
479: b'RAHEEM STERLING # FPL # GW32 THREAD (1) Sterling Fri, 22/03- 70minutes Sterling Mon 25/03 - 90minutes The last 3 Sterling games with reduced minutes: Watford GW30 - 64 mins West Ham GW28 -35mins Everton GW 25 - 31mins'
480: b'Overnight players unavailable Duffy DF BHA 4.7 Paterson MF CAR 4.9 Pr\xc3\xb6pper MF BHA 4.8 Aurier DF TOT 5.7 Bailly DF MUN 5.0 # FPL # GW32 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
481: b'@ OfficialFPL Price Changes (645 am IST - 26th Mar 2019) Again! , NO changes in player prices! Groundhog Day anyone! # FFEPriceChanges # FPL # GW32'
482: b'PRIZE = 100 STELLAR # XLM & Comment to enter with: 1. Banker (Highest FPL points) 2. Blanker (Lowest FPL points) 3. Min of first GW goal (Tie Break) *Player MUST START or entry is void* (DGW player must start BOTH games) Score = Banker Pts minus Blanker Pts # FPL # GW32 pic.twitter.com/6KxFNrjnL0'
483: b'Need to decide between Kane and B. Silva or Pogba and Lukaku # GW32 # FPL'
484: b'Player Status Change Duffy DF BHA 4.7 # FPL # GW32 http://www.fpl247.com'
485: b'Looks like 3/4 managers are going total & absolute budget for their bench for this gameweek. Personally haven\xe2\x80\x99t yet decided, but I suspect I\xe2\x80\x99ll have a playing sub 1 when all\xe2\x80\x99s said & done. # GW32 # FPL'
486: b'# FPL # FPLCommunity # FantasyPL # GW32 # upfmlfplhttps://twitter.com/FMLFPL/status/1110298602549719041 \xe2\x80\xa6'
487: b"My # FPL bus team (courtesy of @ hailcheaters) has had # Aguero captain since the double game week fixtures were announced, but after seeing those performances from # Sterling in an England shirt, I've made the switch! # GW32 pic.twitter.com/redg25o1Du"
488: b'Had some time away from twitter and # FPL but I\xe2\x80\x99m still wrapped with my current free hit team...plus the Lindelof baby news is great for the squad too # DGW32 # GW32 # FPLCommunity # FreeHithttps://twitter.com/FPLLewis/status/1107765351368974337 \xe2\x80\xa6'
489: b"*** Ep. 187 - On to # GW32 with Free-Hits Activated and the Double Gameweek in Sight *** This is pretty much just a Double Gameweek fuckfest... We talk exclusively about doublers and Free Hitters and our teams and let's go. http://fmlfpl.libsyn.com/ep-187-on-to-gw32-with-free-hits-activated-and-the-double-gameweek-in-sight \xe2\x80\xa6 # FMLFPL # FPL"
490: b'One last share for the evening crowd [Evening crowd: put your hands up! ] New podcast on # GW32, Free Hit Chip Strategy, and more. # FPL https://twitter.com/hailcheaters/status/1109975518546456578 \xe2\x80\xa6'
491: b'We are podding on Tuesday night with none other than the # FPL veteran, 6 time top 25k finisher and @ FFScout legend @ LetsTalk_FPL Please send over your questions/topics for # GW32 now... # upthepodpic.twitter.com/CJJ29qlJWv'
492: b'Player Status Change Bailly DF MUN 5.0 # FPL # GW32 http://www.fpl247.com'
493: b'# FPL # GW32 # DGW32 Who is the must have Forward for this GW?'
494: b'Still working on your free hit draft? Have a look at our latest video: # FPL # GW32 Free Hit Picks! https://youtu.be/yPYY8-pwGDU pic.twitter.com/JOxCOCBvaT'
495: b"FH32 Squad Combinations With the weekend over, it's tinkering time once again. We've been working around 3-5-2 so far for our Free Hit squad. Which of these would you pick \xe2\x80\x94Option One, Two, Three or Four? # FPL # GW32 # FPLCommunity"
496: b"FH32 Squad Combinations With the weekend over, it's tinkering time once again. We've been working around 3-5-2 so far for our Free Hit squad. Which of these would you pick \xe2\x80\x94Option One, Two, Three or Four? # FPL # GW32 # FPLCommunitypic.twitter.com/lyOQ7odLh5"
497: b'My current # FPL # freehit team for # GW32. What are your thoughts? # FPLCommunity # BusTeam # alongwaytogopic.twitter.com/eLtNZSU7o6'
498: b'Those on # Freehit or # Wildcard in # GW32 should consider the chip usage stats from # FPL when worrying about "template" players. Hypothetically, even if all those managers had the exact same players, there\'s still circa 3million active managers who might not # Perspectivepic.twitter.com/TXx1FjpZL6'
499: b'# FPL # GW32 Lindelof https://twitter.com/WGTA_FPL/status/1110225596255211520 \xe2\x80\xa6'
500: b'Most Transferred out Today 1) Salah MF LIV 13.3 8323 2) Felipe Anderson MF WHU 7.2 3202 3) Rashford FW MUN 7.6 3068 4) Alexander-Arnold DF LIV 5.6 2761 5) Man\xc3\xa9 MF LIV 10.0 2700 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
501: b'Most Transferred in Today 1) Sterling MF MCI 11.6 8117 2) Ag\xc3\xbcero FW MCI 11.8 5261 3) Hazard MF CHE 10.9 3486 4) Jim\xc3\xa9nez FW WOL 6.8 3273 5) Laporte DF MCI 5.9 3038 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
502: b'Question: if you\xe2\x80\x99re leading in your mini-League, is it simply too risky to go without Hazard in your Free Hit squad? I hadn\xe2\x80\x99t fully considered the impact of his ownership among non-Free Hitters until today. If he does *anything* in GW32 isn\xe2\x80\x99t it a ranking killer? # FPL # GW32'
503: b'Interested to see everyone\xe2\x80\x99s Free Hit teams ahead of # GW32 Screenshot your current squad and we will give our views! # FPL # FPLCommunity'
504: b'NEW POST - Andrew Ferguson @ Fergi222 reviews his GW31 teams in # FPL, TFF, Sky & Sun + outlines his plans for # GW32 Article includes Andrews draft Free Hit team https://www.fantasyfootballgeek.co.uk/gw32-fantasy-football-tips-andrew-ferguson/ \xe2\x80\xa6 # FantasyPremierLeague # fplcommunity # DGW32 # freehit # sundreamteam # skysportsfantasyfootballpic.twitter.com/ft3temQEj9'
505: b"A reminder of our thoughts on the 'big hitters' ahead of the double # GW32 http://www.footballadvice.co.uk/fpl-double-gw32-free-hit-preview/ \xe2\x80\xa6 # FPL # FPLCommunity"
506: b'NEW POST - fantasy premier league GW32 \xe2\x80\x93 player rankings for Defenders and goalkeepers https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-defender-tips-gw32-rankings/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW32 # DGW32 # freehitpic.twitter.com/HrJnzcEvDL'
507: b'Jak na razie 3 g\xc5\x82\xc3\xb3wne opcje. Nie jestem do ko\xc5\x84ca przekonany do defa Man Utd vs Watford i dobrze graj\xc4\x85ce na Big6 Wolves, ale kto za wtedy za niego? # FPL # GW32 # jakgractoznajlepszymi @ fplpoland @ FantasyPL_FPLpic.twitter.com/MqBb0dbOd1'
508: b'How many goals will City score over their two # GW32 fixtures (ful, CAR)? # FPL # FPLCommunity'
509: b'We hope this has helped you in picking a budget player for your free Hit team. Let us know if we have missed anyone! Again, thanks for the support on the previous threads and any retweets are appreciated! # FPL # FPLCommunity # GW32 # FPLTips'
510: b'While Milivojevic is our top pick, it\xe2\x80\x99s worth noting that his # FPL value is dependent on penalties. Zaha essential to this and currently an injury doubt, monitor the press conferences before # GW32'
511: b"Let's commute # FPL # FPLCommunity # FantasyPL # GW32 # upthecheatershttps://twitter.com/hailcheaters/status/1109975518546456578 \xe2\x80\xa6"
512: b'Best GW32 Captain Choice? # fpl # gw32'
513: b'Jesus Christ Unbelievable level of research # FPL # GW32 https://twitter.com/StatOnScout/status/1109936431483498496 \xe2\x80\xa6'
514: b'Free Hit activated. First draft complete. Been tempted to do Milvohevic & Deulofeu for Son plus a few other changes. Thoughts everyone..??? # GW32 # fpl # fantasypremierleague # palace # watford # Tottenham # freehitpic.twitter.com/hSRvagcyDn'
515: b'Player Status Change Pr\xc3\xb6pper MF BHA 4.8 Paterson MF CAR 4.9 Aurier DF TOT 5.7 # FPL # GW32 http://www.fpl247.com'
516: b'# FPL # GW32 if you had to get one of these two, who would you pick?'
517: b'@ FPLPriceChanges Do F/H transfers not affect prices ... hardly any price changes over last week ? # FPL # GW32'
518: b'Most Transferred out Today 1) Salah MF LIV 13.3 1875 2) Rashford FW MUN 7.6 734 3) Felipe Anderson MF WHU 7.2 720 4) Alexander-Arnold DF LIV 5.6 645 5) Man\xc3\xa9 MF LIV 10.0 599 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
519: b'Most Transferred in Today 1) Sterling MF MCI 11.6 1792 2) Ag\xc3\xbcero FW MCI 11.8 1157 3) Jim\xc3\xa9nez FW WOL 6.8 764 4) Hazard MF CHE 10.9 720 5) Laporte DF MCI 5.9 623 # FPL # GW32 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
520: b'@ OfficialFPL Price Changes (645 am IST - 25th Mar 2019) NO changes in player prices today either! # FFEPriceChanges # FPL # GW32'
