1: b'Hughton on Pascal Gross: "So as regards the injury itself, he\'s fine with the injury. He\'s been doing some very good rehab work and trained this morning, which is a real plus. All the decisions [over his involvement] will be around that." # FFScout # FPL # GW34 # DGW34 # BHAFC'
2: b'Man\xc3\xa9 & Deeney or Firmino & Jota? # FPL # GW34'
3: b'Wolves don\xe2\x80\x99t really do clean sheets, having had only 2 clean sheets since GW17. Coady is a cheap nailed on defender if you are confident of a clean sheet in the home DGW fixtures against Brighton & Arsenal, # FPL # GW34 # DGW34'
4: b'Wolves Jimenez is pretty much nailed on to be most active mangers teams, with Jota also not that far behind. A lot of manager\xe2\x80\x99s have so much money invested in Doherty so won\xe2\x80\x99t be willing to sell but most of his recent goals have come in the FA Cup. # FPL # GW34 # DGW34'
5: b'Doucoure scored 1 in both games in DGW32, whilst Deulofeu can be more explosive and is on form after scoring twice in FA cup semi final but faces competition for his place. # FPL # GW34 # DGW34'
6: b'Watford Deeney & Foster look good assets to own for the remaining games of the season, the other players to consider are Deulofeu & Doucoure, with the latter more nailed on but in certain games plays a deeper role. # FPL # GW34 # DGW34'
7: b'Moura or Llorente might get some games/minutes Alli also got injured in CL game with a fractured left hand. Eriksen is in form and playing well. I will personally be doubling up on Son & Erisken. Lloris looks like the only nailed on defensive player. # FPL # GW34 # DGW34'
8: b'Spurs With Kane\xe2\x80\x99s injury, Son is a must for FPL teams as he did well the last time Kane was injured but I would not be surprised if Son is rested against Hudderfield in GW34 as he looked tired towards the of the game against Man City in the CL. # FPL # GW34 # DGW34'
9: b'Bednarek, Valery & Yoshida are cheap defenders with the latter 2 providing more of attacking threat. Form players Hojberg or JWP are great 5th midfielders for your bench Boast in GW35, JWP is on set pieces. Redmond is playing very well but wasteful with his chances # FPL # GW34'
10: b"However re-asses ManU's in GW37 as they play Huddersfield & Cardiff in the last 2 games. Rashford or Lukaku are the only assets to consider at this moment Southampton The saints have so many budget friendly players; Gunn is a cheap keeper with doubles in gw35 # FPL # GW34 # DGW34"
11: b'Man United ManU have a nice GW34 home fixture against West Ham but not the best DGW35 fixtures with games against Everton & Man City. United\xe2\x80\x99s form has dipped, my advise would be to avoid United assets in GW35 & GW36 # FPL # GW34 # DGW34'
12: b"Aguero is now the standout premium striker with Kane injured, in midfield Sterling is the main Man City asset Laporte has 20 & 18 points from the two previous double game weeks this season, so can't be ignored # FPL # GW34 # DGW34"
13: b'Man City Expect a little more rotation then previously as Man City enter a very intense period of the season, Palace in GW34 followed by Spurs in the CL then DGW35 against Spurs & ManU # FPL # GW34 # DGW34'
14: b'Lacazette is in form (9 attacking returns in 12 games) but Laca also has problems in away games, he has only scored away goals in 3 games and those are against the 3 bottom sides. Auba is an alternative now that he is fit but seems a rotation risk atm # FPL # GW34 # DGW34'
15: b'DGW35 teams Arsenal With no away clean sheet all season, their defensive player\xe2\x80\x99s aren\xe2\x80\x99t enticing, Kolasinac has good attacking appeal if you can deal with rotation and early substitutions. Ramsey is in good form with 2 goals in 4 PL games. # FPL # GW34 # DGW34'
16: b'Cardiff need to win one or both games which might mean Camarasa gets a goal or 2. Morrison has had plenty of penalty box touches (with 4 assists this season) # FPL # GW34 # DGW34'
17: b'Cardiff They have Burnley & Brighton away but only a single game fixture against Liverpool in GW35. Whichever player you might want to choose, it will be a gamble Camarasa has 2 goals in the last 3 games (but both home games), he might even be on penalties # FPL # GW34 # DGW34'
18: b'Murray & Knockaert are the only attacking players to consider, I don\xe2\x80\x99t think Murray will start both games but he could make a start & sub appearance. At the back Duffy is goal threat whilst the other 2 to consider are Dunk & Ryan. # FPL # GW34 # DGW34'
19: b'Brighton With back to back up double games with 2 home games in GW34 (Bournemouth & Cardiff) followed up by 2 less attractive away games in GW35, look to get in 2 of their players and maybe transfer one out in GW35. # FPL # GW34 # DGW34'
20: b'Wildcard If bench boasting in GW35 then you need a decent bench and to set up for the remaining weeks of the season, aim to have 13-15 dgw players. If not BB, then get 11-12 players that have 2 games with other 3-4 players who have good future games # FPL # GW34 # DGW34'
21: b'Tactics If you no longer have the Free Hit chip or Wildcard then my suggestion is do 2-3 transfers this week and get 2 Brighton players and a DGW35 player. Don\xe2\x80\x99t remove any Liverpool assets as you will need them for GW35. Look at my suggestions from each team # FPL # GW34 # DGW34'
22: b'FPL GW34 Preview Part 1 Brighton & Cardiff have 2 fixtures in GW34 followed by 4 additional fixtures in GW35 which will be the final dgw of season. This week\xe2\x80\x99s preview will look at the dgw player\xe2\x80\x99s from both week\xe2\x80\x99s and some single gw player\xe2\x80\x99s to think about # FPL # GW34 # DGW34'
23: b'# FPL # GW34 # DGW34 @ FPL_NZ @ LetsTalk_FPL @ OfficialFPL @ themh95 GW34 Preview : -Wildcard active -Duffy \xc2\xa9 -Hope Trippier starts -Still waiting on Deulofeu news -Murray for 1 week punt *If you like the fpl content retweet and follow me for more!!! *Good luck all !pic.twitter.com/4uJAtMC2Qp'
24: b"# GW34 wildcard decision no 6. Who in God's name do I captain in GW34? I must have changed my mind a dozen times today. Son and Sterling are both rotation risk coz of the smelly Champions League. # FPL # Wildcard"
25: b'# FPL # GW33 78 (-8) green 54k OR 184k Regained 1st in mini-league lead by 13 Draft # GW34 WC: Ryan, TAA, Robertson, Duffy, Son, Jota, Eriksen, Salah, Vardy, Jimenez, Rashford. Bench Lloris, Laporte, Doherty, JWP # GW35 BB Duffy>Valery'
26: b'Our WILD # GW34 Wildcard episode is up! BGW33 Beauties CL/EL Implications Wildcard Dilemmas Wildcard Punts In Every Position < 5% Caps Your Questions Name Game https://soundcloud.com/wt-fpl/ep24 # WTFPL @ FPLBrit # FPL # GW34'
27: b'# FPL # GW34 Fantasy Forecast The Hype Team ( @ HypeTrainSam, @ HypeTrainPhil and @ HypeTrainRob) take on @ Capkin_Gaming in Premier League predictions, Gameweek insight, and in picking a Scout Picks team. Read here https://www.thehypetrain.co.uk/single-post/2019/04/11/FANTASY-FORECAST-201819-FPL-Gameweek-34 \xe2\x80\xa6pic.twitter.com/ZtJBn7ntsA'
28: b'# FPL # Fantasy who to start? # GW34'
29: b"4th Wildcard Draft: -Template front 3 -Robertson and Laporte in defense. Had extra cash and didn't know who to upgrade to in mid-fwd posotions Thoughts? # FPL # FPLCommunity # wildcard # GW34 # GW35 # DGW35 # DGW34 # GW35BBpic.twitter.com/mZa95CbHOp"
30: b'He is indeed lit! # FPL # FPLCommunity # GW34 pic.twitter.com/3PdQb8mmPt'
31: b"Random update for # gw34 On WC and gonne a Brighton defender. My season can't get much worse anyway. # yolo # FPL pic.twitter.com/JSwKjRGnSX"
32: b'Player Status Change Koscielny DF ARS 5.4 Alonso DF CHE 6.4 Diam\xc3\xa9 MF NEW 4.8 # FPL # GW34 http://www.fpl247.com'
33: b'I\xe2\x80\x99m done looking at FH teams. If anyone wants me I\xe2\x80\x99ll be pretending it\xe2\x80\x99s a Saturday deadline and I have 1 FT instead. Done looking at everyone losing their shit on Twitter about captaining Duffy. Can\xe2\x80\x99t take it anymore. (Yes, I\xe2\x80\x99m captaining Duffy too) # FPL # GW34 pic.twitter.com/a6jfhLSxeD'
34: b'Which combo would you go for? Can\xe2\x80\x99t afford Tripper/Robbo? # GW34 # FPL @ FPLGeneral @ FFScout @ FFootballHub @ FPLFamily @ LetsTalk_FPL'
35: b'# FPL # GW34 pic.twitter.com/2wlLNcYBpl'
36: b'NEW POST - fantasy premier league DGW34 - a change to my wildcard team https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-dgw34-change-wildcard/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fantasypl # GW34 # DGW34 # wildcardpic.twitter.com/WIXzuXrGUp'
37: b'Im struggling here,who would you pick between Gudmundsson(CAR), Rondon(LEI) and Wilson (BHA)? THANK YOU # GW34 # FPL'
38: b'How does this look like for a WC team? Too ballsy to go without City coverage? # FPL # GW34 # WCpic.twitter.com/4Cj2LwpNky'
39: b'NEW POST - fantasy premier league GW34 \xe2\x80\x93 forward player rankings https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-tips-forwards-gw34-rankings/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fantasypl # GW34 # DGW34 # wildcardpic.twitter.com/ZtDmjSwvPD'
40: b'Do you need any advice for # GW34 guys? # FPL'
41: b'I think I\xe2\x80\x99m 85% locked in # FPL # FPLCommunity # GW34 pic.twitter.com/dYQNARD9Jy'
42: b"My very lengthy perspective on Spurs' (depleted) # FPL assets for # GW34 Though this was based on latest injury updates, we'll probably have 3 more by Saturday! https://twitter.com/FPLMyClub/status/1116432952248999936 \xe2\x80\xa6"
43: b'Who will you give the captain\xe2\x80\x99s armband to for # GW34? \xe2\x80\xa2\xe2\x80\xa2\xe2\x80\xa2 # premierleague # fantasypremierleague # fplcommunity # fantasypl # fpl # fantasyfootball # football # soccer # futbol # liverpool\xe2\x80\xa6 https://www.instagram.com/p/BwINFk6hSO3/?utm_source=ig_twitter_share&igshid=wkyjp0v9zbww \xe2\x80\xa6'
44: b'Tottenham By @ FPLdepression # FPL # THFC # COYS # GW34 pic.twitter.com/1ISybFVq3p'
45: b'GW34 Review/Preview Thread # FPL # GW34 # DGW34'
46: b'Eden Hazard is currently the most transferred out player ahead of # GW34! Will he come back to bite all those # FPL managers in the ass? And Liverpool fans, too...'
47: b"There's so much confusion this week on who to have in your team, especially if you're on your # FPL wildcard! Ahead of # GW34, have a read of the fantastic tips article below by @ MitchellC_FF247 and gain some clarity! https://fantasyfootball247.co.uk/fantasy-football-tips-gameweek-34/ \xe2\x80\xa6"
48: b'The @ FPLWildCats are now # Live on @ YouTube Come chat all things # FPL # GW34 & the Chip Strategies with us now: https://www.youtube.com/c/FPLWildCats/live \xe2\x80\xa6pic.twitter.com/NniunOVuLU'
49: b'Is Son rising tonight or tomorrow? We\xe2\x80\x99re seeing differing predictions. # FPL # GW34 # FPLCommunity'
50: b'Will you be following your team against your minileague rivals in our Live Centre during # GW34? # FPL'
51: b'# MyFPLCaptainsMatchUp I am taking on @ fpl_tactician in a wide open week in terms of FPL assets! Each choosing a # GW34 team with no budget to try and outscore each other - abit of fun and extra in-game competition! May the best gaffer win! # FPL # GW34 pic.twitter.com/MmYA0gU6T2'
52: b'Kane ruled out and Alli almost. Does it mean Son is nailed or rested for UCL? # FPL # GW34'
53: b'GW 34 Wildcard Can do Mane->Sterling and Siggy ->Richy Transfer plans: Siggy as a punt then Deulf/Hughes/Doucour\xc3\xa9 in for 35 DGW BB Thoughts guys? # FPL # FPLCommunity # GW34 pic.twitter.com/HH0F0FMeNp'
54: b'Opinions on TAA (will own Robbo)? High PPM and good value compared to Salah & Mane. Con no double GW, but fantastic fixtures after Chelsea. Gomez back fit? # fpl # GW34 pic.twitter.com/ZO1su0fq7U'
55: b'# GW34 Wildcard Draft #2 What are you\xe2\x80\x99re thoughts ladies and Gents # FPLCommunity # FPL \xe2\x81\xa6\xe2\x81\xa6 @ LetsTalk_FPL\xe2\x81\xa9 \xe2\x81\xa6 @ FPLFamily\xe2\x81\xa9pic.twitter.com/fy0lmIrY0M'
56: b'Player Status Change Kane FW TOT 12.6 # FPL # GW34 http://www.fpl247.com'
57: b'Kane no estar\xc3\xa1 contemplado para la # GW34 \xc2\xbfQui\xc3\xa9n es su potencial reemplazo? # BenditoFantasy # FPL https://twitter.com/SpursOfficial/status/1116403472201584641 \xe2\x80\xa6'
58: b'Rate my team! # gw34 # dgw34 # dgw # fpl # wildcard # wc @ ffscout_az @ LetsTalk_FPLpic.twitter.com/J41l9nGY4Q'
59: b'# FPL thoughts... # GW34'
60: b'Spurs also reveal that Dele Alli fractured his left hand in the same game and he will now be assessed to determine his availability for the match against Huddersfield Town. # FFScout # FPL # GW34 # DGW34 # THFC'
61: b'Spurs confirm that Harry Kane sustained "a significant lateral ligament injury to his left ankle" in the win over Manchester City on Tuesday. Kane will continue to be assessed over the coming week and no timeframe was put on his return. # FFScout # FPL # GW34 # DGW34 # THFC'
62: b'GENUINELY SURPRISED AT THE REACTION TO MY FINAL SOLO WC POD DRAFT. THANKS FOR THE SUPPORT # fpl # fantasyfootball # gw34 # dgw34 # dgw35 # WildCard # FantasyPL # ffscout # FPLCommunity # ARSNAP https://youtu.be/qRwGNi9xNFo pic.twitter.com/J22duuOuy1'
63: b'I am ready for # GW34 # FPL # EPL # FantasyFootballpic.twitter.com/U8VbkgJ0iJ'
64: b'Chelsea XI to face Slavia Prague: Kepa; Azpilicueta, R\xc3\xbcdiger, Christensen, Alonso; Jorginho, Barkley, Kova\xc4\x8di\xc4\x87; Pedro, Giroud, Willian. Eden Hazard and Gonzalo Higuain are among the substitutes. # FFScout # FPL # GW34 # DGW34 # SLACHE'
65: b'Arsenal XI to face Napoli: Cech; Sokratis, Koscielny, Monreal; Maitland-Niles, Torreira, Ramsey, Kolasinac; Ozil; Aubameyang, Lacazette. # FFScout # FPL # GW34 # DGW34 # ARSNAP'
66: b'Harry Kane "has sustained a significant lateral ligament injury to his left ankle" \'Fractured left hand\' for Dele Alli - # GW34 availability to be assessed # FPL # THFC # COYS # DGW34https://twitter.com/SpursOfficial/status/1116403472201584641 \xe2\x80\xa6'
67: b'Shane Duffy points at home this season: 7, 1, 4, 5, 6, 1, -2, 6, 2, 6, 7, 9, 2 Average: 4.15 # FPL # GW34'
68: b'# LEGIONSOFPOOM # GW34 Top rope - Ryan Count out - Lossl Ringleader - Vardy OR - 111k Getting closer to top club. Really need Spurs cover but that MF is # FPL pic.twitter.com/8HNTU91uvO'
69: b"WC Final Draft DONE!! More than happy with this team. It covers everything for GW34 & BB DGW35, with minimal hits from GW 36-38. Let's do it!! # FPL # GW34 # DGW34 # FPLCommunity https://twitter.com/FPL_Foreman/status/1116401219289976832/photo/1pic.twitter.com/ucE1g3jJyK pic.twitter.com/uMKgD8uQ3O"
70: b'Which FPL teams have the most - and least - favourable run-ins? We look at the fixture difficulty for all 20 Premier League clubs. https://www.fantasyfootballscout.co.uk/2019/04/11/which-teams-have-the-best-and-worst-remaining-fpl-fixtures/ \xe2\x80\xa6 # FPL # GW34 # DGW34'
71: b'# FPL team selection for # GW34 and preplanning for # DGW35 Son is my \xc2\xa9 pic.twitter.com/3LwYnCp2Cc'
72: b"It's worth keeping an eye on Lacazette and Aubameyang tonight, particularly against competitive opposition in Napoli. Great scouting chance before tomorrow night's deadline. # FPL # GW34 # FPLCommunityhttps://twitter.com/Arsenal/status/1116395910223880192 \xe2\x80\xa6"
73: b'Happy with my setup for the rest of the season. # gw34 locked in!!! Captain Duffy!!! Madness or just quiet brilliance..... happy with my return to a big 5 in midfield # fpl # FPLCommmunity @ FFScout @ fplguy1 @ PlanetFPLPod @ WGTA_FPL @ WGTA_Nickpic.twitter.com/Hzy5oqQg5R'
74: b'Latest gw34 wildcard draft Kept 2x Liverpool defenders. Any changes required? # FPL # GW34 pic.twitter.com/XexHP8OGbU'
75: b'Overall rank: 12,640 Points: 55 Taking a -4 hit for Hazard saved my week. Need a big # GW34 if I want to make top 10k. # FPL pic.twitter.com/8OIYYAlBUF'
76: b'Seagulls are beautiful creatures... # FPL # GW34 pic.twitter.com/hx854h6KRu'
77: b'Glenn Murray points at home this season: 5, 12, 2, 9, 7, 8, 7, 1, 1, 1, 2, 2, 2, 0, 2. Average: 4.06 # FPL # GW34'
78: b'Dear # FPL managers. Remember about right goalkeeper, if you have Lloris+Hamer on WC. I just realized that I had all the time Hamer in the 1st squad. Maybe I need glasses. @ OfficialFPL # FPLCommunity # GW34 pic.twitter.com/CY9SWkyB4w'
79: b'Thanks guys # FPL # FPLCommunity # FantasyPL # GW34 https://twitter.com/PlanetFPLPod/status/1116061196803874817 \xe2\x80\xa6'
80: b'MID \xe2\x80\x94 Premium With Kane appearing to be injured after hobbling off during Tuesday\xe2\x80\x99s CL match, Son could return to being the attacking focal point for Spurs. With HUD (H) up next, a double-digit return could be on the cards if he finds that form again. # FPL # GW34 # FPLCommunitypic.twitter.com/4iYO4ZygoJ'
81: b'See what Poch says at the presser tomorrow. If Alli is out, Son starts v Huddersfield for me. Spurs need Top 4, can\xe2\x80\x99t see them them going into the game without Son as well as Kane and Alli # FPL # GW34 https://twitter.com/standardsport/status/1116304065770721280 \xe2\x80\xa6'
82: b'MID \xe2\x80\x94 Budget Seemingly back in form, Jota offers great value as a 3rd/4th midfielder when building those final squads. Having returned 30pts in his last 5, including 2 goals and 2 assists, his average of 6ppg over that time could be great for the DGW. # FPL # GW34 # FPLCommunitypic.twitter.com/CgfwTGFdQB'
83: b'3rd Wildcard Draft: - Triple Brighton - Triple Spurs - Triple Wolves Thoughts? # FPL # FPLCommunity # wildcard # GW34 # GW35 # DGW35 # DGW34pic.twitter.com/PCUhAavz8g'
84: b'# GW34 fixture analysis: Wildcard transfer targets, Kane injury, schedules, rotation & run-in planning # FPL @ DannyJamieson @ FplWolf @ James_FPL @ FPLFamily @ WGTA_FPL @ FPLSecrets @ FPL_physio +more # FPLCommunity # DGW34 # DGW35 TY to all tagged https://www.thestatszone.com/fpl-gameweek-34-fixture-analysis-wildcards-kane-injury-rotation-and-season-run-in-planning-18-19 \xe2\x80\xa6pic.twitter.com/KA3XuVMjS7'
85: b'Best Watford player to have in # fpl for # gw34 and # gw34 ?'
86: b'@ OfficialFPL sent out a reminder the deadline is tomorrow so everyone starts rushing in players tonight so increases happen tonight.....cheers # FPL # GW34 # DGW34'
87: b'# FPL Midfielders # GW34 # Sterling # Palace # Salah # Chelsea # Hazard # Liverpool # Mane # Chelsea'
88: b"Stag's Take will be written this eve. I hear some of you are on... Wildcards? What's on the mind folks? # FPL # GW34"
89: b'FPL community\xe2\x80\x94\xe2\x80\x94 If you had to choose one, who is it?! # fpl # GW34'
90: b'Most Transferred out Today 1) Kane FW TOT 12.6 18058 2) Hazard MF CHE 11.1 14156 3) Pogba MF MUN 8.7 11938 4) Man\xc3\xa9 MF LIV 10.1 10567 5) Fraser MF BOU 6.3 8584 # FPL # GW34 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
91: b'Most Transferred in Today 1) Son MF TOT 8.6 37985 2) Ag\xc3\xbcero FW MCI 11.7 19351 3) Duffy DF BHA 4.7 19026 4) Murray FW BHA 6.3 16130 5) Eriksen MF TOT 9.2 15318 # FPL # GW34 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
92: b'# FPL # gw34 Eriksen for Mane? Will Son really play a full 60 when Spurs can win without him? And Murray with the armband feels counterintuitive. Thoughts? pic.twitter.com/ngikt43Iy1'
93: b'Too little time to trawl through the remaining FPL fixtures? Fear not - our resident FPL guru @ ColmVHayes has done all the heavy lifting for you and even put it into a handy article for you to read https://www.thestatszone.com/fpl-gameweek-34-fixture-analysis-wildcards-kane-injury-rotation-and-season-run-in-planning-18-19 \xe2\x80\xa6 Not all heroes wear masks # FPL # GW34'
94: b'Have you logged in on our website already to check your team evaluation and projected points for # GW34? # FPL pic.twitter.com/VTXFssVvOC'
95: b'Boly > Doherty is my latest thought. # FPL # GW34'
96: b'Completely different draft. # FPL # FPLCommunity This draft has been decided with # DGW34, # GW34, # DGW35 and # UCL in mind. What do you think pic.twitter.com/pLkd6uOszX'
97: b'Give me a good reason why not... # fpl # fplcommunity # GW34 pic.twitter.com/VtusNNgaIo'
98: b'# GW34 Captaincy Picks With the injury to Kane, many managers have lost their \xe2\x80\x98obvious\xe2\x80\x99 pick. We have highlighted our top picks for GW34, let us know if you agree or if we have missed one out! [Thread] # FPL # FPLCommunity'
99: b'Completely different draft. # FPL # FPLCommunity This draft has been decided with # DGW34, # GW34, # DGW35 and # UCL in mind. What do you think pic.twitter.com/N9ylIwssKP'
100: b'TC mood # FPL # GW34 pic.twitter.com/LrlXgCOr3x'
101: b'Completely different draft. # FPL # FPLCommunity This draft has been decided with # DGW34, # GW34, # DGW35 and # UCL in mind. What do you think pic.twitter.com/DFHIFN1RHO'
102: b'Player Status Change Mbenza MF HUD 5.9 Daly MF HUD 4.5 # FPL # GW34 http://www.fpl247.com'
103: b'Lloris is probably the best nailed TOT defense going from GW34 to the end. # FPL # GW34'
104: b'Completely different draft. # FPL # FPLCommunity This draft has been decided with # DGW34, # DGW35 and # UCL in mind. # GW34 What do you think pic.twitter.com/XQkPq2Uk8H'
105: b'Player Status Change Keane DF EVE 4.8 Ayit\xc3\xa9 MF FUL 4.3 Markovic MF FUL 4.8 # FPL # GW34 http://www.fpl247.com'
106: b"Who is best Captain choice this # GW34? Currently on Son with Kane's injury. # FPL # FPLCommunity"
107: b'Un punto interesante a considerar es que Tottenham tiende a jugar horrible despu\xc3\xa9s de tener partidos de Champions League. # Son # Captain # GW34 # FPL # FantasyPL # FPLCommunity'
108: b'# FPL # GW34 Weekly Differentials @ HypeTrainSam explores a hidden Fantasy gem in each Premier League fixture ahead of the upcoming Gameweek that might make the difference in your squad. Read here https://www.thehypetrain.co.uk/single-post/2019/04/11/WEEKLY-WILDCARDS-201819-FPL-Gameweek-34 \xe2\x80\xa6pic.twitter.com/A8qLjRsraV'
109: b'Will Aguero start at Palace (or be rested for C.L) ... # MCFC # FPL # GW34'
110: b'Which Man City player do you recon will score the most points in # GW34? # FPL # WildCard # FantasyPL # FantasyPremierLeague # ManCity'
111: b'(1) Gameweek 34 competition is now OPEN! PRIZE = 100 STELLAR **THERE WILL ONLY BE A PRIZE IF THERE ARE OVER ENTRIES SO PLEASE RT AND SHARE ** Comment to enter! Player MUST START or entry is void Score = Banker Pts minus Blanker Pts # fpl # gw34 pic.twitter.com/5ctCGzd1ap'
112: b"I've kept the wildcard questions to a minimum but I do have one Which midfielder should I go for? If I go for Jota or Ward Prowse I will have money left to bring in Mane for Huddersfield at home. # FPL # GW34 # GW35BB"
113: b'Is anyone considering Llorente while Kane is out? Last time Kane was injured, Llorente returned attacking points in 3 out of 4 games # FPL # FPLCommunity # GW34 # GW35 # GW35BB # DGW34 # DGW35 # WildCard'
114: b'# FPL # GW34 Does anyone use a strategy of picking up a player who you think is going to go up in value before the start of the GW, then transfer them back for the player you had before? This seems like a strategy only valid for a WC play. Or am I just absolutely off my rocker?'
115: b'Hey # FPLCommunity! So I can\xe2\x80\x99t decide between the two. Any help? Vote and let me know why below # FPL # GW34'
116: b'Player Status Change Gro\xc3\x9f MF BHA 6.7 Diam\xc3\xa9 MF NEW 4.8 # FPL # GW34 http://www.fpl247.com'
117: b"Who are the best defenders for your new Wildcard squad? We've had a look... READ HERE https://www.fantasyfootballscout.co.uk/2019/04/11/the-best-defenders-for-a-second-wildcard-squad/ \xe2\x80\xa6 # FPL # GW34 # DGW34 # FantasyPL"
118: b'# FPL # GW34 Captain options ...'
119: b'2nd Wildcard Draft: - Triple City - Triple Wolves - Triple Spurs Thoughts? # FPL # FPLCommunity # wildcard # GW34 # GW35 # DGW35 # DGW34pic.twitter.com/tzQpDyyYPZ'
120: b'1st Wildcard Draft: -No Watford players -No United players -Vardy to Lacazette for # GW35 Thoughts? # FPL # FPLCommunity # wildcard # GW34 # GW35 # DGW35 # DGW34pic.twitter.com/gFd0OLSHBI'
121: b'Scott Parker: "Floyd Ayit\xc3\xa9 has been back training, today was his first day back. Alfie Mawson\xe2\x80\x99s come through a couple of under-23s games. He\xe2\x80\x99s probably still a little bit short in the sense of being ready for the weekend, but he\xe2\x80\x99s getting closer.\xe2\x80\x9d # FFScout # FPL # GW34 # DGW34'
122: b'NEW POST - fantasy premier league GW34 \xe2\x80\x93 midfield player rankings and stats https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-tips-midfielders-gw34-rankings/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fantasypl # GW34 # DGW34 # wildcardpic.twitter.com/h4UR8HhXZ8'
123: b'Three reasons to avoid Auba next GW: 1. \xe2\x80\x9cgetting better\xe2\x80\x9d 2. \xe2\x80\x9ccan start\xe2\x80\x9d 3. \xe2\x80\x9ccan play after\xe2\x80\x9d # FPL # FPLCommmunity # GW34 https://twitter.com/BenDinnery/status/1115998983233654785 \xe2\x80\xa6'
124: b'Benitez: "The rest of the players, Diame and everyone, is available." # FFScout # FPL # GW34 # DGW34 # NUFC'
125: b"STEVE-O'S FINAL WC DRAFT UP NOW TO VIEW LINK BELOW https://youtu.be/qRwGNi9xNFo # fpl # fantasyfootball # gw34 # dgw34 # dgw35 # WildCard # FantasyPL # ffscoutpic.twitter.com/j4tiRuYX8x"
126: b'Ralph Hasenhuttl: "We have Ingsy back. Lemina is still injured, he can\'t train with the team. Jannik didn\'t have any problems [after returning in the Liverpool game]. The rest, apart from the long-injured players like Obafemi, are in the group." # FFScout # FPL # SaintsFC # GW34'
127: b'Sean Dyche says that Peter Crouch is still unavailable after appendix surgery, while Phil Bardsley is \xe2\x80\x98touch and go\xe2\x80\x99 as he recovers from a gashed leg. # FFScout # FPL # GW34 # DGW34 # twitterclarets'
128: b'LOVING how fiercely debated this WC has turned out to be. Not too templatey, pros and cons to >95% of all choices... I expect that only Duffy and Jim\xc3\xa9nez will feature in the majority of teams. # FPL # FPLCommunity # FantasyPL # GW34'
129: b'Best premium striker for # GW34? Comment if it\xe2\x80\x99s another # FPL # FPLCommunity'
130: b'The # GW34 deadline is approaching Need some last minute tips for your @ OfficialFPL team? We discuss 5 potential players worth including this week # FPL http://offsiderulepodcast.com/2019/04/11/fpl-five-to-watch-in-gw34/ \xe2\x80\xa6pic.twitter.com/jU2YiMyFyn'
131: b'Stats pre- # GW34 1. Shots Inside Box 2. Goal Attempt Assists / Chances Created 3. Goal Attempts Conceded Inside Box 4. Big Chances Conceded # FPL pic.twitter.com/sct2CDYjvn'
132: b"Chris Hughton confirms that Pascal Gross and Solly March have trained this morning and will be assessed ahead of Saturday's match. # FFScout # FPL # GW34 # DGW34 # BHAFC"
133: b'Rafael Benitez confirms that long-term injury victims Florian Lejeune and Sean Longstaff are his only confirmed absentees for the trip to Leicester. # FFScout # FPL # GW34 # DGW34 # NUFC'
134: b'Gross anyone? # fpl # gw34 https://twitter.com/OfficialBHAFC/status/1116321386434265088 \xe2\x80\xa6'
135: b'My latest wildcard tinkering (Kieran)... Would like Vardy/KDB, but going without Aguero feels too risky. Punt on an in form Everton and Siggy to grab some hauls! Thoughts? # fpl # FPLCommunity # gw34 pic.twitter.com/meGMOKq1M3'
136: b'# FPL # GW34 Wildcard Draft no.7: Going KDB? Going KDB over Sterling can give me funds to prepare to upgrade Vardy to Lukaku/Auba/Laca. Or I can easily upgrade to Salah if needed on GW36. Seems like keeping some funds is the way to go. pic.twitter.com/ic6jWIezlx'
137: b"Wildcard Active - Team Locked in Overall ranking 264,890 ITB 0.1m Captain - Son Heung-min Taken a gamble to Tripple Brighton assets for DGW34 Tripple Spurs Double city I'm trusting Lacazette and Jimenez to deliver Lindelof? gut selection # FPL # GW34 pic.twitter.com/lGRVyif71A"
138: b'My latest wildcard draft is five triple ups. Go hard or go home! # FPL # GW34 # GW34WC # DGW34pic.twitter.com/YZUiKj7jO7'
139: b"Jan Siewert confirms that Ben Hamer will start in goal against Spurs, while Isaac Mbenza hasn't trained today because of illness. # FFScout # FPL # GW34 # BGW34 # HTAFC"
140: b'Manuel Pellegrini confirms that Andriy Yarmolenko, Carlos Sanchez, Andy Carroll and Winston Reid remain out, while Jack Wilshere will feature again for the U23s before returning to first-team contention. Samir Nasri has a calf problem. # FFScout # FPL # WHUFC # GW34 # DGW34'
141: b'Fantasy Premier League Gameweek 34 wildcard options # FPL # Wildcard # GW34 https://majorbuckley.wordpress.com/2019/04/11/fpl-gameweek-34-wildcard-options/ \xe2\x80\xa6'
142: b'DEF \xe2\x80\x94 Premium With little competition for his place with Aurier injured, Trippier offers attacking potential for Spurs, starting with HUD (H) this weekend. Buoyed by Tuesday night\xe2\x80\x99s win over City, Spurs could kick on from now to GW38. # FPL # GW34 # FPLCommunitypic.twitter.com/ZdugGYIdH2'
143: b'Liverpool triple-up? Best Kane replacement? Must-have players? Leicester options? What to do with Hazard? Those # GW34 and # wildcard questions answered in our latest collab with @ FootballAdvice5. # FPL # FPLCommunity @ OfficialFPLhttp://www.footballadvice.co.uk/wildcard-gw34-fpl-question-and-answer/ \xe2\x80\xa6'
144: b'DEF \xe2\x80\x94 Budget Our favourite way into Brighton\xe2\x80\x99s double gameweeks has to be with Shane Duffy! Almost an ever-present for Brighton this season, his goal threat is his biggest bonus, with his total standing at 5 so far for this season. # FPL # GW34 # FPLCommunitypic.twitter.com/y5jr2Ms2mZ'
145: b'Who to start this week? # FPL # FPLCommunity # GW34'
146: b'NEW POST - Rob Reid @ Thefpl_vet with his fantasy premier league GW34 player picks Rob has finished 3 of the last 4 seasons in the top 0.5% of FPL managers https://www.fantasyfootballgeek.co.uk/rob-reid-fantasy-premier-league-gw34-player-picks/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW34 # DGW34 # wildcardpic.twitter.com/maUOrm92oA'
147: b'Thoughts on this wildcard draft team? Plenty in the bank to make moves # FPL # FPLCommunity # GW34 pic.twitter.com/1iF4lxKdFJ'
148: b"# GW34 wildcard planning is more or less done now. I'm happy with this, and how each gameweek looks with this squad of players over the next few weeks. A nice bench for GW35 Bench Boost as well. 0.2m being kept back to do Vardy to Firmino in GW35. # FPL pic.twitter.com/1KBchiNTRT"
149: b"We know you're all super giddy about Brighton and Cardiff's double gameweek, but don't forget there are other teams in the Premier League: https://the4pointhit.wordpress.com/2019/04/10/fantasy-forecast-gameweek-34/ \xe2\x80\xa6 # FPL # FPLCommunity # FantasyPL # fantasypremierleague # harrykane # GW34 # DGW34"
150: b'Top owned players right now ahead of # GW34 # FPL pic.twitter.com/s9AGScVp7l'
151: b'Tonight\xe2\x80\x99s the night! The @ FPLWildCats will be # LiveStreaming around 8:30pm Discussing all things # fpl # GW34 and chip strategies in the # FantasyPremierLeague! Any questions for the panel or the polls? We\xe2\x80\x99d love to hear them pic.twitter.com/MPNEyEYwuL'
152: b'Rizk gir deg v\xc3\xa5re Fantasy Premier League-tips f\xc3\xb8r Gameweek 34! Vi girer opp mot Double Gameweek og anbefaler signeringer og kapteinsvalg for de kommende rundene. https://rizk.com/no/sportsbook/insider/fotball/fantasy-premier-league-gameweek-34/13109 \xe2\x80\xa6 # fpl # 2pl # gw34 # rizk'
153: b'OGS on Rashford sub off last night; "There is a lot of reasons for different subs, but Rashy has been running, he\xe2\x80\x99s been ill, he\xe2\x80\x99s been injured, so he\xe2\x80\x99s not as fit as he normally is" Will he play against West Ham on Saturday? # FPL # FPLCommmunity # GW34'
154: b'3 highly ranked managers going over their Wildcard teams ahead of # GW34 to finish the # FPL season on this episode of the FPL Surgery: https://soundcloud.com/fplsurgery/128thEpi \xe2\x80\xa6 Overall rank: Stephan: 649th @ haugsrud Iceman: 1,835th @ JamesDrewery Peter: 3,116th @ mathsafe_fpl # upthepod'
155: b'If you know, you know. # GW34 # FPL pic.twitter.com/5V2iEFHMow'
156: b"FPL headlines for this week: \xc2\xb7 The Aguero vs Kane debate \xc2\xb7 Are Leicester's nightmare final fixtures actually that bad in light of their form? \xc2\xb7 Will Liverpool (Mane, Salah) bottle it? \xc2\xb7 Are we planning in transfers for after # GW34 # FPL # upthepodhttps://soundcloud.com/fplsurgery/127thEpi \xe2\x80\xa6"
157: b"NEW POST - Fantasy premier league GW34 captain poll There's also an early DGW35 captain poll Plus polls to show what your current wildcard team is looking like https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-gw34-captain-poll-wildcard/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fantasypl # GW34 # DGW34 # wildcard # eplfantasy # fplupdatespic.twitter.com/wrK5sZEcsx"
158: b'In our latest article, @ LetsTalkSoccer2 has taken a look at the underlying stats for some of the best wildcard strikers For more information, check out the article http://www.footballadvice.co.uk/wildcard-gw34-fpl-question-and-answer/ \xe2\x80\xa6 # FPL # FPLCommunity # GW34 pic.twitter.com/AShXuI4C9u'
159: b'No transfers this week. Plan to do 2-3 ahead of GW35 in order to have 10-11 DGW players. # FPL # GW34 pic.twitter.com/sGaYU1nivm'
160: b'Czy to jest ju\xc5\xbc ten ostateczny sk\xc5\x82ad? Zobaczymy. Coraz bli\xc5\xbcej idea\xc5\x82u. # GW34 # dgw35 # jakgractoznajlepszymi # fpl # polandfplpic.twitter.com/dG9OatXFpU'
161: b'Which United player to own? # fpl # gw34'
162: b'Who to start? # fpl # gw34'
163: b'Looks like this will be my final wildcard draft, unless we get some unexpected team news later. Thoughts? # FPL # FPLCommunity # GW34 pic.twitter.com/DtBS0zKpHK'
164: b"# WeCouldBeFriendsBut you don't have Fernando Llorente on your # GW34 wildcard... # FPL pic.twitter.com/wXfy8lsAFp"
165: b"In case you don't know, I do a weekly # FPL pod with my good buddy Ger. And here is the latest episode ahead of # GW34. This week, it's # WildCard season baby! This was recorded immediately after Spurs v City on Tuesday so most of the discussion we assume Kane is out for the DGW.https://twitter.com/fplhangover/status/1115958234861404161 \xe2\x80\xa6"
166: b'http://YOUTUBE.COM/ELITEFPLPODCAST # gw34 # dgw34 # dgw35 # WildCard # FantasyPL # ffscout # fpl # fantasyfootballpic.twitter.com/qlqocBSbZJ'
167: b'# GW34 wildcard decision no 5. Does Matt Doherty start all 3 of Wolves next 3 games in GW33 and GW34? Or will he suffer some rotation? # FPL # Wildcard'
168: b'Hazard heroics, Kane\xe2\x80\x99s injury and planning for both # GW34 & # DGW35. Here\xe2\x80\x99s our latest # FPL podcast episode https://podcasts.apple.com/gb/podcast/all-out-attack-an-fpl-podcast/id1445951541?i=1000434644176 \xe2\x80\xa6'
169: b'Last plug of the week. Still plenty in there to help with wrapping up your # GW34 teams and # FPL WCs https://twitter.com/RenegadesFpl/status/1115539103561523201 \xe2\x80\xa6'
170: b'\xc3\x87a va trop loin @ OfficialFPL # reallyintoit # fantasypl # FPL # GW34 pic.twitter.com/uSWxVmUwdN'
171: b'New episode available now! https://audioboom.com/posts/7229967-deeney-in-the-dock \xe2\x80\xa6 Footballers behind bars Misadventures with cars A look ahead to the weekend fixtures # fpl # GW34 How to train your toddler Brighton and Cardiff players. Worth it? Apple https://itunes.apple.com/gb/podcast/fantasy-football-hangover/id1429063726?mt=2&ls=1 \xe2\x80\xa6pic.twitter.com/4Uld0gAezi'
172: b'Most Transferred out Today 1) Kane FW TOT 12.6 5673 2) Hazard MF CHE 11.1 3780 3) Pogba MF MUN 8.7 3060 4) Man\xc3\xa9 MF LIV 10.1 2861 5) Fraser MF BOU 6.3 2288 # FPL # GW34 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
173: b'Most Transferred in Today 1) Son MF TOT 8.6 9647 2) Ag\xc3\xbcero FW MCI 11.7 5326 3) Duffy DF BHA 4.7 5139 4) Eriksen MF TOT 9.2 4925 5) Murray FW BHA 6.3 3535 # FPL # GW34 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
174: b"It doesn't matter if you are wildcarding or not, this article is for you We have gone through team-by-team, picking out the best options and those to avoid http://footballadvice.co.uk/gw34-fpl-wildc \xe2\x80\xa6 # FPL # FPLCommunity # GW34"
175: b'The Scout Squad picks for GW34, as selected by @ FFScout_Paul, @ FFScout_Joe, @ SkontoRigga and Peter Kouwenberg. Only four players received unanimous backing this week... https://www.fantasyfootballscout.co.uk/2019/04/11/the-scout-squad-for-double-gameweek-34/ \xe2\x80\xa6 # FPL # GW34 # DGW34'
176: b'Overnight price fallers Lookman MF EVE 4.9 Rashford FW MUN 7.4 Shaw DF MUN 5.0 # FPL # GW34 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
177: b'Overnight players available Rashford FW MUN 7.4 Delph DF MCI 5.3 # FPL # GW34 http://www.fpl247.com/player/returning \xe2\x80\xa6'
178: b'# GW34 # FPL # RefStats Goals? \xf0\x9d\x97\x9f\xf0\x9d\x97\x98\xf0\x9d\x97\x9cNEW, \xf0\x9d\x97\xa6\xf0\x9d\x97\xa2\xf0\x9d\x97\xa8WOL, \xf0\x9d\x97\xa0\xf0\x9d\x97\xa8\xf0\x9d\x97\xa1WHM Penalties? \xf0\x9d\x97\xa6\xf0\x9d\x97\xa2\xf0\x9d\x97\xa8WOL, LIVCHE Red Cards? \xf0\x9d\x97\x95\xf0\x9d\x97\xa8\xf0\x9d\x97\xa5CAR, \xf0\x9d\x97\x99\xf0\x9d\x97\xa8\xf0\x9d\x97\x9fEVE Winners? LEI, TOT, BHA, BUR, SOU, MUN, ARS # DGW34 # WhatTheRef # RefOffpic.twitter.com/z36AL6xWub'
179: b"What's the best back line for # GW34? # FPL"
180: b'@ OfficialFPL Price Changes (645 am IST - 11th Apr 2019) Price Rises: None Price Drops: Lookman # EFC \xc2\xa34.9 Shaw # MUFC \xc2\xa35.0 Rashford # MUFC \xc2\xa37.4 # FFEPriceChanges # FPL # GW34'
181: b'# GW34 captains poll. # vardy # son # duffy # sterling # FPL # FPLCommunity'
182: b'Everton in the Last 3 GameWeeks: Everton 2-0 Chelsea West Ham 0-2 Everton Everton 1-0 Arsenal Goals Scored: 5 Goals Conceded: 0 Clean Sheets: 3 Everton defenders are Hot again ? # FPL # GW34 <Admin # Biebek>'
183: b'# FPL # FPLCommunity # GW34 # DGW34 Milivojevi\xc4\x87 Alli, Eriksen or Son for a -8...'
184: b'This team may be too top heavy (or bottom light) a team. I have never had this much ideas for a wildcard team. # FPL # GW34 pic.twitter.com/odzwiGYdrO'
185: b"# FPL # gw34 Loving this draft. Would love feedbacks! Triple Spurs Keeping Mohammed 'differential' Salah 2x BHA D. 7 ITB to get rid of dunk for Holebas next week if he is fit. pic.twitter.com/qN5oPkhZb2"
186: b'This is the 2nd draft and most likely the final one. # FPL # DGW34 # GW34 pic.twitter.com/oNMb2JDtqb'
187: b'New podcast for Always Cheating Patreon supporters! Topics: - Spurs: Who to trust for your WC team? Are any captain-able? - The emerging template for GW34/GW35 squads - My current wildcard team - KdB v. Sterling Listen/sign-up here: https://www.patreon.com/posts/always-cheating-26024455?utm_medium=social&utm_source=twitter&utm_campaign=postshare \xe2\x80\xa6 # FPL # GW34'
188: b"Don't forget to watch our latest # FPL video with final wildcard drafts for # GW34. https://youtu.be/aNjTi9CSwhY pic.twitter.com/uVAdmmKF1U"
189: b'@ FMLFPL Alon and Walsh, thanks for your guidance and banter all season long. Hoping with this Wild Card to turn around what has been a tricky # FPL season so far. On the plus side, before # GW30 I stood at 732k. Now before # GW34 my OR is at 260k. So heading in the right direction! pic.twitter.com/1Bpq59kXT8'
190: b'Near finalizing GW 35 Tielemans out to jwp or Deulofeu according to fitness & form TBD Any thoughts are appreciated ?! # FPL # GW34 pic.twitter.com/tykySavOKj'
191: b'Really struggling to fill those fwd spots now Harry is crocked. Jimenez is locked in. Arsenal play 4/6 away away from home & Laca has not scored any away goals Vs teams not called Ful, Car or Hud # GW34 # FPL'
192: b"Really (possibly delusionally) happy with my # GW34 wildcard squad: Keeps 3 LIV v CAR (35), HUD (36) 3 Spurs should avoid rotation Watford's GW35 fixtures If I panic over Man City in GW35, Murray + Eriksen becomes Aguero + Hojbjerg Thoughts?? # FPL pic.twitter.com/va6VTKzCGD"
193: b'Hmmm # FPL # GW34 pic.twitter.com/7tGxNhHCaO'
194: b'Player Status Change Rashford FW MUN 7.5 # FPL # GW34 http://www.fpl247.com'
195: b'Ive decided for # gw34 Im going to pick a really great team and win # FPL pic.twitter.com/fEXhVtDWSZ'
196: b'Current WC thinking... I really, really like this draft. Jota/Son/Salah all effectively going to be OOP forwards. Nice captaincy options until end of season. Good GK rotation. Ings the only real punt, but it could pay off over the next two # FPL # FPLCommunity # gw34 pic.twitter.com/ItqnoBM0c3'
197: b'Wildcard draft. Thoughts welcomed. 1.4m in the bank # FPL # GW34 # THFCpic.twitter.com/CyBC1XGpnn'
198: b'Burnley Barnes Owned: 55% Last GW: 6 Total points: 220.5 Opponent: Cardiff (H) Southampton Ings Owned: 60% Last GW: N/A Total points: 72 Opponent: Wolves (H) # GW34 # fantax # FPL # fantasyfootball # FantasyPL # letsfantasyfootball'
199: b'Leicester Gray Owned: 42% Last GW: 5 Total points: 158.5 Opponent: Newcastle (H) Brighton Knockaert + Bissouma Opponent: Bournemouth (H) # GW34 # fantrax # toggatrax # FPL # FantasyPL # fantasyfootballpic.twitter.com/Tm9gCX3lRX'
200: b'Tonight\xe2\x80\x99s # FPL wildcard draft plan. Not keen on the triple Spurs TBH. May save some cash for a GW36 Ag\xc3\xbcero return # GW34 Bench: Leno / Deeney / Doherty / Doucour\xc3\xa9 # GW35 Bench Boost Foster & Firmino (-4) # GW36 ? # GW37 Rashford # GW38 ? *subject to change, Ts&Cs applypic.twitter.com/DJRLM8YTyW'
201: b'Southampton Valery Owned: 15% Last GW: 8.25 Total points: 127.5 Opponent: Wolves (H) Brighton Bernardo Owned: 9% Last GW: 5 Total points: 114.5 Opponent: Bournemouth (H) # GW34 # fantrax # toggatrax # fantasyfootball # FPL # FantasyPL'
202: b"Which Brighton assets are the best # FPL options for # GW34 and # GW35? We've had a comprehensive look at the key stats in our latest article, with a focus on: Albion and opposition team stats Goal threat Assist potential Clean sheet chanceshttps://www.fantasyfootballscout.co.uk/2019/04/10/brightons-fpl-players-assessed-ahead-of-their-double-gameweeks/ \xe2\x80\xa6"
203: b'# GW34 is one of the most talked about weeks of the # FPL season. We\xe2\x80\x99ve contributed to a Q&A article with @ FootballAdvice5. Topics addressed... Liverpool triple-up Best Kane replacement Must-have players Leicester options What about Hazardhttp://www.footballadvice.co.uk/wildcard-gw34-fpl-question-and-answer/ \xe2\x80\xa6'
204: b'Brighton Ryan Owned: 42% Clean sheets: 5 Saves: 74 Save percentage: 64.3% Last GW: -4 Total points: 110.5 Opponent: Bournemouth (H) # GW34 # fantrax # FPL # fantasyfootball # FantasyPL'
205: b'CaPTaiN PiCK \xc2\xa9 for # Gameweek34 # GW34 # FPL # FantasyPL # DGW34 # FantasyPremierLeague # FPLCommunity # FPLFamily # FantasyFootball'
206: b'# FPL Gameweek 34 # GW34 Preview from FISO: https://www.fiso.co.uk/fpl-season-2018-19-gameweek-34-preview/ \xe2\x80\xa6'
207: b"FANTASTIC SHOW OF SUPPORT TONIGHT WATCHING US LIVE. TRULY CAN'T THANK YOU ENOUGH https://youtu.be/IkUo8O2g1RA # fpl # fantasyfootball # FPLCommunity # GW34 # dgw34 # dgw35 # WildCard # FantasyPL # ffscoutpic.twitter.com/ELyjGhtnEx"
208: b"# GW34 Wildcard Q&A article We have teamed up with @ LetsTalkSoccer2 to answer the hottest topics Kane alternatives Triple Liverpool? Keep Leicester? 'Essential picks' http://www.footballadvice.co.uk/wildcard-gw34-fpl-question-and-answer/ \xe2\x80\xa6 # FPL # FPLCommunity"
209: b'Manchester United XI to face Barcelona: De Gea, Young, Lindelof, Smalling, Shaw, Dalot, McTominay, Fred, Pogba, Rashford, Lukaku. # FFScout # FPL # GW34 # DGW34 # MUFC # MUNFCB'
210: b'Thinking of bringing in more than one Brighton defender this week but don\xe2\x80\x99t have a solid # brexit strategy in place # fpl # gw34'
211: b'Rashford ... # FPL # GW34 https://twitter.com/TyMarshall_MEN/status/1116034827952824321 \xe2\x80\xa6'
212: b'Matty Ryan (\xc2\xa34.4m) plays BOU/CAR in # GW34 & wol/tot in # GW35. Brighton have just six clean-sheets this season, & he\xe2\x80\x99s ranked 15th overall (did miss four matches during the Asian Games) for saves-made (averaging 2.7 saves per 90 minutes). In your wildcard squad? # FPL'
213: b'Think I know the answer to this one but... Who do I start this week? # FPL # GW34 # Bandwagon'
214: b'Maurizio Sarri says that Chelsea need to change "five or six players" for their match against Slavia Prague on Thursday. Eden Hazard was one of the players said to be "tired" after his exertions against West Ham. # FFScout # FPL # GW34 # DGW34 # ChelseaFC'
215: b'GW \xe2\x80\x94 Premium It\xe2\x80\x99s important to remember that there are still fixtures other than just DGW35 to consider, and for that, we look to Alisson. With CAR, HHUD, NEW & WOL in Liverpool\xe2\x80\x99s last 4 weeks, they could all turn out to be CS in their title push. # FPL # GW34 # FPLCommunitypic.twitter.com/Sl9OH19YmA'
216: b'FPL Managers, tell me your thoughts on Salah. Back in form and due a haul or over the hill? Can afford either # GW34 # FPL'
217: b'GK \xe2\x80\x94 Budget Ok, this is Mr Obvious for a WC GK spot, but Mat Ryan is our budget pick. Back-to-back doubles, including Bournemouth and Cardiff at home offer CS potential, and the games against Wolves & Spurs could easily see save points heading his way. # FPL # GW34 # FPLCommunitypic.twitter.com/BKz82ebeuz'
218: b'Kane injury: My WC draft / / / / / /| | |\\ \\ \\ \\ \\ \\ \\ / / / / / / | | | \\ \\ \\ \\ \\ \\ \\ # GW34 # FPL'
219: b"If this was your squad and you couldn't make transfers, would start any of the Subs? If so, who's getting the chop for who? # GW34 # FPL pic.twitter.com/uDYK60kuxk"
220: b'Most Transferred out Today 1) Kane FW TOT 12.6 45711 2) Hazard MF CHE 11.1 11237 3) Man\xc3\xa9 MF LIV 10.1 10173 4) Pogba MF MUN 8.7 9400 5) Fraser MF BOU 6.3 8545 # FPL # GW34 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
221: b'Most Transferred in Today 1) Son MF TOT 8.6 42308 2) Ag\xc3\xbcero FW MCI 11.7 30409 3) Duffy DF BHA 4.7 17283 4) Eriksen MF TOT 9.2 15355 5) Murray FW BHA 6.3 13825 # FPL # GW34 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
222: b'NEW POST - fantasy premier league GW34 \xe2\x80\x93 player rankings for Defenders and Goalkeepers Includes a focus on the double gameweek teams https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-defender-tips-gw34-rankings/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fantasypl # GW34 # DGW34 # wildcard # freehit # eplfantasy # fplMY # fplupdates # fplislife # FPLuspic.twitter.com/JZ5UmNcUK2'
223: b"# FPL # GW34 Wildcard time! Gone with a mix of in form players and DGW players. Southampton's fixtures make we want a striker, but it's not clear who'd start out of Austin, Ings and Shane Long. So gone with Brighton's Murray for now. Any Saints fans in the know? pic.twitter.com/mtZU3BVOpv"
224: b'Not Wildcard though. # FPL # FPLCommunity # GW34 pic.twitter.com/8oTbh8P8Ec'
225: b"Here's what we see: Son has better odds in scoring goals upfront. Eriksen may get both goals & assists. Spurs has just beaten Man City. They're flying high. Both playing upfront against one broken Huddersfield. It's gonna be a slaughterhouse if Spurs is hungry enough. # GW34 # FPL"
226: b'New "post-Champions League/post-Kane injury" podcast for Always Cheating Patreon supporters coming tonight! Patrons: Q\'s for tonight pod? Become a Patreon supporter & get exclusive access to our Patreon pods, Slack, private leagues, etc here: http://www.patreon.com/alwayscheating # FPL # GW34'
227: b'# FPL # GW34 Wildcard Draft no.6: Going Vardy! Really like the look of this team. \xc2\xa30.0m left ITB. Vardy will become Deeney on GW35, to prepare funds for post GW35 changes. Thoughts? pic.twitter.com/Ki0e0fP5eQ'
228: b'(Noob here, first year in FPL). Someone please tell me I\xe2\x80\x99m not crazy with this lineup. # fpl # gw34 # noobpic.twitter.com/VBKUNRaNtk'
229: b'Please the announcement of Harry Kane injury??? # FPL @ OfficialFPL @ FFScout Crucial for planing our # GW34 & # DGW35 [Period]'
230: b'Unai Emery: "We are going to assess tomorrow. Granit [Xhaka] and Laurent [Koscielny] are improving and they today with us, but I would rather wait for tomorrow morning to decide." # FFScout # FPL # GW34 # DGW34 # ArsenalFC'
231: b"It's goals and assists for Roberto Firmino his last competitive starts. We look at the Brazilian forward's appeal since his return to a central position and bring you the Daily Salah... https://www.fantasyfootballscout.co.uk/2019/04/10/salah-and-mane-blank-as-firmino-continues-fine-form-as-a-central-striker/ \xe2\x80\xa6 # FPL # GW34 # DGW34 # LiverpoolFC"
232: b'Player Status Change Evans DF LEI 4.8 Albrighton MF LEI 5.1 # FPL # GW34 http://www.fpl247.com'
233: b'Rodgers when asked if Vardy\'s groin problem needs "managing" or if it is no longer an issue: "We\'ll just have to see if there\'s any more reaction to it. It was just something that happened within the game, so we\'ll just assess that." # FFScout # FPL # GW34 # DGW34 # LCFC'
234: b'Rodgers on Vardy: "He\xe2\x80\x99s absolutely fine. He felt a slight niggle towards the end of the game. Rather than risk it, we just took him off. He\'s recovered well in the early part of the week but trained absolutely fine. He\xe2\x80\x99ll be ready for Friday." # FFScout # FPL # GW34 # DGW34 # LCFC'
235: b"# GW34 wildcard decision no 4. With Kane's latest injury, which of these forwards should I get? (I need 2) # FPL # Wildcard"
236: b'# GW34 wildcard decision no 3. Which of these midfielders to get in on my WC? # FPL # Wildcard'
237: b'http://YOUTUBE.COM/ELITEFPLPODCAST # fpl # fantasyfootball # FFScout # FantasyPL # FPLCommunity # GW34 # dgw34 # dgw35 # WildCardpic.twitter.com/LDTjJ9VSyy'
238: b'It\'s a "mini double gameweek" to take advantage of according to @ MarcJobling amidst the Kane frustrations in this week\'s Projections https://www.thestatszone.com/fpl-gameweek-34-projections-18-19 \xe2\x80\xa6 # fpl # gw34 # HarryKane # FPLCommunity'
239: b'Rodgers: "Harry [Maguire] is back in the squad which is great. Jonny [Evans] has recovered from his injury, so he came out and trained today. Marc Albrighton has been training now the last week or so, so he looks very, very good." # FFScout # FPL # GW34 # DGW34 # LCFC'
240: b'Deulofeu won the poll vs Doucoure by 63% to 37%, so what about Deulofeu or Jota? # fplwildcard # FPL # gw34 # DGW35 # wildcard'
241: b'Rodgers: \xe2\x80\x9cDaniel [Amartey] is obviously with the medical and sports science team so we\xe2\x80\x99ll see how that goes between now and the end of the season." # FFScout # FPL # GW34 # DGW34 # LCFC'
242: b"Here's a Wildcard XV for players that have featured in every single Premier League game this season, cause why not? # FPL # Wildcard # GW34 # Rotationproofpic.twitter.com/1xbwE30Hey"
243: b'After the Kane injury our wildcard plans have changed a fair bit! Here is the current team with players who we are more certain of choosing, what recommendations would you make for the empty spots? # FPL # FPLCommunity # GW34 pic.twitter.com/3OY5zWOhDx'
244: b'Brendan Rodgers says that Jamie Vardy is "absolutely fine" following a slight groin niggle. Jonny Evans and Harry Maguire have trained all week after missing the win over Huddersfield, while Marc Albrighton has also re-joined the squad. # FFScout # FPL # GW34 # DGW34 # LCFC'
245: b'For those that are wildcarding, this article is for you We have gone through team-by-team, picking out the best options and those to avoid http://www.footballadvice.co.uk/gw34-fpl-wildcard/ \xe2\x80\xa6 # FPL # FPLCommunity # GW34'
246: b"ICYMI: new Always Cheating Podcast. 83 minutes on wildcards, # GW34 strategy, planning for the rest of the season - and the 79 minutes where we don't talk about Harry Kane is still relevant! https://soundcloud.com/alwayscheating/ep-168-wildcards-and-the-fpl-endgame-gw33-34 \xe2\x80\xa6 # FPL # hailcheaters"
247: b"Pitch invader clashes with Fabian Delph after causing Harry Kane's injury Later investigations showed that the spurs fan transfered in # Kane in his # FPL team for -4 pts ahead of # GW34 pic.twitter.com/Bxk7bO1SgF"
248: b"Been tinkering all week and I think this is the final draft that's good to go. Any comments, opinions and suggestions are welcome I've built this with GW34, BB GW35 & GW36, 37 & 38 in mind. # GW34 # FPL # FPLCommunitypic.twitter.com/gR2Lnd8qXm"
249: b"Podcast Alert With the # FPL blank gameweeks now firmly behind us, we get a chance to reflect on what lies ahead in # GW34. It's Wildcard Season! What could stop us now... wait... What's that? # HarryKane could be out for the rest of the season?... https://soundcloud.com/user-768411468/fplhangoverep35 \xe2\x80\xa6"
250: b'Just realised how close my team to be outside 10k # FPL # FPLCommunity # GW34 # gargatronpic.twitter.com/TEhnJ3RMiQ'
251: b'So anyone watch Liverpool vs Porto last night? How did Salah, Mane, Firmino look as # fpl assets? From highlights Firmino and Mane look value for money but it was very restricted highlights. # gw34 # LIVPOR'
252: b'Who is the best captain for GW34? # FPL # FPLcommunity # GW34'
253: b'With Kane looking out for the season now, we\xe2\x80\x99re thinking of reversing these. Higuain Aguero Salah Son/Eriksen Good moves? # FPL # FPLCommunity # GW34 https://twitter.com/ArrowFPL/status/1114855631280836610 \xe2\x80\xa6'
254: b'Here Comes The SON | Gameweek 34 | FPL 2018/2019 https://youtu.be/JWGg9wAMSHI Today we review a real dream or nightmare gameweek 33 before taking a look at gameweek 34 and the fixture run heading into the final few games of the season. # FPL # Gameweek34 # GW34 # FPLCommunity'
255: b'# GW34 # FPL pic.twitter.com/Q0WEaI7tuq'
256: b'Llorente Such a good enabler. Nice alternative/ addition to Deulofeu # FPL # GW34'
257: b'My # FPL # GW34 wildcard plans are in tatters with Harry Kane\xe2\x80\x99s injury.'
258: b'NEW POST - Fantasy premier league - a few thoughts and changes to the wildcard team after the Kane injury https://www.fantasyfootballgeek.co.uk/fpl-wildcard-teams-gameweek-34-kane-injury/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # GW34 # DGW34 # wildcard # eplfantasy # fplMY # fplislife # fantasypremierleagueislife # FPLus # fpltreview # fplwildcardpic.twitter.com/gco79nmbI3'
259: b'Made a spreadsheet ranging the teams from easiest to hardest program, helping navigate wc and prepare for the season run-in! Hope you guys find it helpful. # gw34 # fpl # fplcommunitypic.twitter.com/8NQWQZYpbl'
260: b'Is Auba or is Lukaku a better shout for my # WC? # FPL # GW34'
261: b'My squad looks like this for # GW34 Hope for Wolves clean sheet # FPLCommunity # FPLMY # fpl pic.twitter.com/1k7eBw8ZOY'
262: b'Here are top alternatives for Harry Kane over the next period # GW34 # DGW35 # FPL pic.twitter.com/aM51u4xgPK'
263: b"This is fun. Kane definitely injured. Everyone jumping on Son, but doubts over whether he is going to be fit/rested too. Definitely two camps forming. I'm in this one... # FPL # GW34 pic.twitter.com/X9bYKZVW90"
264: b'Firmino vs Mane last four matches. # FPL # GW34 pic.twitter.com/w1n4bmI0Ae'
265: b'Player Status Change Delph DF MCI 5.3 # FPL # GW34 http://www.fpl247.com'
266: b"Surely it's the right thing to do? @ OfficialFPL # FPLCommunity # fpl # FantasyPL # GW34 pic.twitter.com/FuJzMCvxqk"
267: b'Is anyone considering a punt on Lukaku? He does love to score v West Ham # fpl # gw34 # FPLWildCard'
268: b'LATEST STEVE-O WC VIDEO AVAILABLE TO WATCH NOW https://youtu.be/R325p6i0TLY # FPL # fantasyfootball # FPLCommunity # WildCard # dgw34 # gw34 # dgw35 # FantasyPL # ffscoutpic.twitter.com/TpJvrxs41u'
269: b'Draft #2 and might be the final one. # FPL # FPLCommunity # GW34 # DGW34pic.twitter.com/MRpW5mfV3C'
270: b'# FPL # GW34 CAPTAIN PICKS is now online on the Polestar Football youtube channel. # PremierLeague # Gameweek34 # FPLCommunity # FollowThePolestar Click here to watch https://youtu.be/A914BL0A1xg pic.twitter.com/PHLUtkDgpR'
271: b"Food for thought: Aguero Captain in # GW34 as CP have been poor at home and have defensive injuries plus wanting to make up for his missed penalty? Double Liverpool defence as Chelsea don't have much rest ahead of the game and apart from Hazard not much offensive threat? # FPL"
272: b'Overnight Risers: Digne \xc2\xa35.3m Son \xc2\xa38.6m Kane \xc2\xa312.6m Overnight Fallers: Mitrovic \xc2\xa36.3m Ag\xc3\xbcero \xc2\xa311.7m # FPL # GW34 # FantasyPL'
273: b'The Kane injury might be a blessing in disguise for us chunky chippers. The extra funds can be spread out more, meaning a stronger bench for BB35/36. I wish I could use it this week actually. # FPL # gw34'
274: b'This is currently my best wildcard without Kane ahead of # GW34 # FPL pic.twitter.com/GiBgahFanM'
275: b'With Kane being ruled out for # GW34, who is now the best captaincy pick? Comment below if you think someone else # FPL # FPLCommunity'
276: b"Already in but I'm thinking to kick Sterling out # FPL # FPLCommunity # GW34 pic.twitter.com/pyFzDcKPPf"
277: b'Which budget midfield combo for # FPL # GW34?'
278: b'If Kane is out for the run in it will probably be worth considering a Spurs midfield double up. Son is an absolute but who do you pick as your second? # fpl # wildcard # fplwildcard # gw34 # dgw35'
279: b'# GW34 thoughts... # FPL'
280: b'Price Changes (4/10/2019) Risers: Digne \xc2\xa35.3m Son \xc2\xa38.6m Kane \xc2\xa312.6m Fallers: Mitrovic \xc2\xa36.3m Ag\xc3\xbcero \xc2\xa311.7m # FPL # GW34 # FPL_Price'
281: b'FPL OFFICIAL Price Changes (4/10/2019) Overnight Risers: Digne \xc2\xa35.3m Son \xc2\xa38.6m Kane \xc2\xa312.6m Overnight Fallers: Mitrovic \xc2\xa36.3m Ag\xc3\xbcero \xc2\xa311.7m # FPL # GW34 # FPL_PriceChanges # Aye'
282: b'First WC Draft thoughts?? 7m itb Punt on Murray??? # FPL # fpl # fplcommunity # FPLCommmunity # gw34 pic.twitter.com/bGFa4SY5jZ'
283: b'My first Kaneless wildcard draft! (Firmino comes in because he really impressed me yesteday, miles ahead of Salah and Man\xc3\xa9) # FPL # GW34 pic.twitter.com/mgyPfsZZ5u'
284: b"I was pretty set on my wildcard team at this time yesterday. One Kane injury later and I've made five changes # FPL # GW34"
285: b'For those NOT on a WC, avoid the temptation to make early moves, even if it might price you out later. One this this Kane injury has shown is that you can easily get burned. Wait til news starts coming out Thurs/Friday and make those moves on the back of more info. # FPL # GW34'
286: b"GW33: 58 points Overall points: 2,047 OR: 7,378 ( 1,304) Luiz Maddison Vardy Considering I fielded 10 and didn't have Hazard lucky to stay inside the top 10k Wildcard activated # FPL # GW34 # WeGoAgain # Dontgetcaughtout # FridayKickOff # Bringitpic.twitter.com/WSIHLwWruz"
287: b'With Kane being out for the foreseeable future, our # GW34 team-by-team analysis will get you on track http://www.footballadvice.co.uk/gw34-fpl-wildcard/ \xe2\x80\xa6 # FPL # FPLCommunity # Kane'
288: b"Who needs premium strikers? I'm very happy with this wildcard team. Prefer Murray to Camarasa for a one week punt (will become Deeney next week). No reason to take out Vardy imo. # FPL # GW34 pic.twitter.com/ucyxPEajM4"
289: b'GW34 clean sheet odds TOT: 50% MCI: 48% MNU: 42% LEI: 41% BUR: 39% LIV: 38% EVE: 36% SOU: 34% BRI: 32% & 45% WOL: 31% ARS: 27% BOU: 26% CAR: 23% & 25% NEW: 19% WAT:19% FUL: 18% CHE: 16% CRY: 12% WHU: 12% HUD: 9% # FPL # GW34 # FPLCommunity # xCS # xGAhttps://www.fantasyfootballscout.co.uk/comment/20182507 \xe2\x80\xa6'
290: b'Most Transferred out Today 1) Kane FW TOT 12.6 20326 2) Hazard MF CHE 11.1 4050 3) Man\xc3\xa9 MF LIV 10.1 3739 4) Pogba MF MUN 8.7 3186 5) Bernardo Silva MF MCI 7.6 3101 # FPL # GW34 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
291: b'Most Transferred in Today 1) Son MF TOT 8.6 16805 2) Ag\xc3\xbcero FW MCI 11.7 11681 3) Eriksen MF TOT 9.2 5976 4) Duffy DF BHA 4.7 5746 5) Jim\xc3\xa9nez FW WOL 6.8 5140 # FPL # GW34 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
292: b'Draft \xe2\x9e\x82 \xe2\x80\x94 the no Kane version # FPL # GW34 pic.twitter.com/gfhG4unYzW'
293: b'Overnight price fallers Ag\xc3\xbcero FW MCI 11.7 Mitrovic FW FUL 6.3 # FPL # GW34 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
294: b'Overnight price risers Digne DF EVE 5.3 Kane FW TOT 12.6 # FPL # GW34 http://www.fpl247.com/player/price/weekly?change=rise \xe2\x80\xa6'
295: b'Overnight players unavailable Kane FW TOT 12.6 Bernardo Silva MF MCI 7.6 Alli MF TOT 8.8 Rico DF BOU 4.1 # FPL # GW34 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
296: b'Overnight players available Ag\xc3\xbcero FW MCI 11.7 Gomez DF LIV 4.8 Llorente FW TOT 5.1 # FPL # GW34 http://www.fpl247.com/player/returning \xe2\x80\xa6'
297: b'Post kane injury redrafted WC34 Any thoughts? # FPL # GW34 pic.twitter.com/vl3joKAMYd'
298: b'Mood. # GW34 # FPL https://twitter.com/FPLGeneral/status/1115714362461892608 \xe2\x80\xa6'
299: b'Kane injury: My WC draft / / / / / /| | |\\ \\ \\ \\ \\ \\ \\ / / / / / / | | | \\ \\ \\ \\ \\ \\ \\ # GW34 # TOTMCI # FPL'
300: b'@ OfficialFPL # fpl # GW34 lukaku or rashford?'
301: b'http://YOUTUBE.COM/ELITEFPLPODCAST # fpl # fantasyfootball # gw34 # dgw34 # FantasyPL # ffscout # FPLCommunitypic.twitter.com/VK2uIm9gbI'
302: b'# FPL # GW34 # OddsAnalysispic.twitter.com/jeHycUzlU2'
303: b"@ FFScout Albeit only been up for a few hours, but that's crazy # FPL # FPLCommunity # gw34 # dgw34 # FantasyPL # Kane https://youtu.be/_F2zj2GJr-I pic.twitter.com/GG7LTkKfXh"
304: b'Kane off injured is actually a relief for me. Team looks more balanced now. # FPL # GW34'
305: b'# FPL # GW34 Wildcard Draft no.5: Going Kane-less. Rest of the team seems balanced. No MU players though. Worth going for ManC defense? pic.twitter.com/CVrI48jjZJ'
306: b'@ OfficialFPL Price Changes (645 am IST - 10th Apr 2019) Price Rises: Digne # EFC \xc2\xa35.3 Son # COYS \xc2\xa38.6 Kane # COYS \xc2\xa312.6 Price Drops: Mitrovic # FFC \xc2\xa36.3 Ag\xc3\xbcero # MCFC \xc2\xa311.7 # FFEPriceChanges # FPL # GW34'
307: b"# FPL # FPLCommunity # GW34 # DGW34 Kane's latest injury gives me something of a captaincy dilemma! Without doing any more transfers... (I know, I know...) ...my choices are:"
308: b'Current WC team. Son & bsilva are not 100% nailed on. Waiting for injury updates. If son is out, lucas would come into my team. I do like bsilva as my city midfield option. Punt on lukaku could work out . # fpl # FPLCommunity # FPLFamily # GW34 pic.twitter.com/pnVCxVgy8g'
309: b"# FPL # GW34 # WildCard @ LetsTalk_FPL @ FPL_NZ @ FPLtips @ OfficialFPL Given Kane recent news I'm trying a million draft to make it work, so I replaced him with a spurs defender & now I'm between two choices: 1)Double spurs mid + Salah + Firmino 2)Double liverpool mid + Son + Lacazette"
310: b"# FPL # GW34: Let's look for potential captains. No captain armband: which one are you willing to lose points?"
311: b'My current # FPL # GW34 wildcard team... thoughts welcome! pic.twitter.com/KtAxtoRbLS'
312: b'Amen to that. # FPL # GW34 # DGW34pic.twitter.com/JyDT1lgZWH'
313: b'True as well. But, with the way that # FPL has gone this season, doesn\xe2\x80\x99t it just feel like the type of GW that will invoke a number of tweets on Saturday night such as; \xe2\x80\x9cCan\xe2\x80\x99t believe I ditched Fraser, King & Wilson....what a horrible # GW34!\xe2\x80\x9d'
314: b'# fpl # gw34'
315: b'Fixture and form-based # FPL predictions for # GW34, # GW35 and # GW36https://fantasyfootballpredictions.uk'
316: b'128th EPISODE OF THE # FPL SURGERY PODCAST WILD CARD CHAT with @ mathsafe_fpl @ haugsrud & @ JamesDrewery WC teams half reveiled (subject to change) # GW34 https://soundcloud.com/fplsurgery/128thEpi \xe2\x80\xa6 # upthepod'
317: b'Has it really come to this!? # FPL # GW34 pic.twitter.com/NF8XqDestC'
318: b'I honestly can\xe2\x80\x99t bring myself to get rid of AWB what a beautiful boy he has been # FPL # GW34'
319: b'Player Status Change Gomez DF LIV 4.8 Walker DF MCI 6.4 Ag\xc3\xbcero FW MCI 11.8 Llorente FW TOT 5.1 Rico DF BOU 4.1 # FPL # GW34 http://www.fpl247.com'
320: b'Any feedback for the manager of this # GW34 team? \xe2\x80\xa2\xe2\x80\xa2\xe2\x80\xa2 # premierleague # fantasypremierleague # fplcommunity # fantasypl # fpl # fantasyfootball # football # soccer # futbol # liverpool\xe2\x80\xa6 https://www.instagram.com/p/BwDSeCehGUz/?utm_source=ig_twitter_share&igshid=1b897t3vrlqf7 \xe2\x80\xa6'
321: b'Anyone else thinking Firmino for their WC? - Good form - Good fixtures after Chelsea - No competition for position - No DGW # FPL # GW34'
322: b'Player Status Change Bernardo Silva MF MCI 7.6 Alli MF TOT 8.8 Kane FW TOT 12.5 # FPL # GW34 http://www.fpl247.com'
323: b'Thread (1/2): List over teams fdr through the rest of the campaign, from most to least attractive (team, mean fdr, tot fdr / number of remaining games). More detailed spreadsheet coming tomorrow. # wildcard # fpl # gw34 Bou 2,4 12/5 Ful 2,4 12/5 New 2,6 13/5 Ars 2,67 16 / 6'
324: b'127th EPISODE OF THE # FPL SURGERY PODCAST Our guests this week are 2 regulars on the Surgery @ mathsafe_fpl who is currently ranked 3,116th overall & @ haugsrud who is currently ranked 649th overall, as the Iceman slips to 1,835th. # GW34 https://soundcloud.com/fplsurgery/127thEpi \xe2\x80\xa6 # upthepod'
325: b'For those considering captaining Duffy, just take a step back and consider that again. Captaining a Brighton defender? Risk beyond measure. Madness (but of course it could pay off). However, not for me. # FPL # GW34'
326: b'New dilemma now, which mid do I bring in? # FPL # GW34'
327: b"Up from 50k to 24k in the two last GW's # Chuffed WC for # GW34 # FPL pic.twitter.com/rwertYQQEC"
328: b'Initial Kane update from Pochettino # FPL # GW34 # wildcardhttps://twitter.com/SpursOfficial/status/1115730224258461697 \xe2\x80\xa6'
329: b'Wailcard played when harry kane is injured # FPL # GW34 pic.twitter.com/hE6xWAkQd3'
330: b'MY # FPL WildCard # Gameweek34 Preview Video is now # LIVE! https://youtu.be/XUuH2EnjRl4 # Gameweek33 Review # Gameweek34 Preview WildCard # GW34 key players! # FantasyPremierLeague - WildCard Tips Feat. @ FantasyFootyFix Please Like & Subscribe'
331: b'NEW POST - fantasy premier league form \xe2\x80\x93 underlying stats form tables up to GW34 Includes an FPL form team for the double gameweek players https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-form-underlying-gw34/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fantasypl # GW34 # DGW34 # wildcard # eplfantasy # fplMY # fplupdates # fplislife # FPLuspic.twitter.com/YebvGNMuzg'
332: b'133k # fpl players have brought Kane in for # GW34 pic.twitter.com/GOoojPOLDa'
333: b"So Son has scored 2 of Tottenham's 3 Home goals at the new stadium. And with Kane injured (looking like for a long time) ahea of a tasty Home fixture against # Huddersfield I guess it's time to get in # SON # FPL # GW34 # TOTMCIpic.twitter.com/0CQD0pwjxV"
334: b'Kusut cuy # fpl # gw34 pic.twitter.com/gfBEBp0L3N'
335: b'Son is quickly looking as must-have player for # GW34. However, how long will Kane be out, probably not too long? # FPL'
336: b'Ft! Tottenham 1-0 Man City : Son : Eriksen # FPL # GW34 # ChampionsLeague <Admin # H17>'
337: b'Really unsure where to go with this WC now # FPL # FPLCommunity # FantasyPL # GW34'
338: b'FT! Liverpool 2-0 Porto : Keita , Firmino : Firmino , TTA Liverpool already qualified ? # FPL # GW34 # ChampionsLeague <Admin # H17>'
339: b'Kane replacement? # FPL # GW34 *other strikers are Deeney and Ag\xc3\xbcero *not on a WC'
340: b'Seems obvious? # FPL # GW34 pic.twitter.com/B06xZKoQZT'
341: b'Ok, so who transferred Kane OUT and Aguero IN the quickest....? I was drafting my wildcard team at the time so within 10 seconds for me. # FPL # GW34'
342: b"Son goal! with Kane out, I'd say he's essential for DGW35! # FPL # FPLCommunity # TOTMCI # DGW35 # WC34 # DGW34 # GW34 # GW35 # WildCardpic.twitter.com/TScXpW3HDk"
343: b'Heung mIN Son?! # UCL # FPL # FantasyPL # GW34 # TOTMCIpic.twitter.com/NfE6Q9fUJG'
344: b'Goal! Tottenham 1-0 Man City (77") : Son : Eriksen # FPL # GW34 # ChampionsLeague <Admin # H17>'
345: b'The new look WC draft.. minus Kane # FPL # GW34 pic.twitter.com/kSoEtwRu2w'
346: b'So how fit is Fernando Llorente # fpl # gw34'
347: b'Wildcard Bitches # FPL # wildcard # fplwildcard # gw34 # dgw35pic.twitter.com/v5d8tqhfUN'
348: b'Kane out means hello sonny boy # GW34 # FPL pic.twitter.com/6OzEd0Olgw'
349: b'Is Moura a possibility now? # FPL # GW34'
350: b'Plans for my # GW34 wildcard team after Kane\xe2\x80\x99s injury # FPL pic.twitter.com/lrwuR63RO4'
351: b"Ashley Barnes you're in! # FPL # Kane # GW34"
352: b'# FPL # GW34 Fuck what I said about Kane this morning. He is out for the season.'
353: b'So that\xe2\x80\x99s everyones # GW34 # wildcard plans ripped up then?? # FPL # Kane'
354: b'Harry Kane off injured!!! Ankle injury That changes everything! great to be on a wildcard # FPL # TOTMCI # FPLCommunity # GW34 # DGW34 # WC34 # Wildcardpic.twitter.com/TwYu3HWRMn'
355: b'Seems like Kane can already be excluded from the list of captain options # FPL # GW34 # FPLCommunityhttps://twitter.com/fplreview/status/1115668986396594176 \xe2\x80\xa6'
356: b'Well that\xe2\x80\x99s just completely fucked up my wildcard. Back to the planning board. # kane # fpl # gw34'
357: b'Kane injures and there goes the plans out of the window! # FPL # GW34'
358: b'KANE OUT OF DOUBLE GAMEWEEK # fpl # FPLCommmunity # gw34 # ucl'
359: b'Top differential picks for # GW34 # FPL pic.twitter.com/1uEPY72i9G'
360: b'Is anybody considering KDB more after he starts on the bench in the CL? # FPL # FPLCommunity # GW34'
361: b'Goal! Liverpool 2-0 Porto (29") : Firmino : Alexander-Arnold Another "5-0" Loading # FPL # GW34 # ChampionsLeague <Admin # H17>'
362: b'# GW33 73pts (-4) all out # GW32 Rank Increase 90k # GW33 Rank Increase 46k 2 game weeks has seen me rise 136k places! Currently sitting at 144k overall Wildcard active for # GW34! # FPL\xe2\x80\xa6 https://www.instagram.com/p/BwC-xmbgtAN/?utm_source=ig_twitter_share&igshid=prdo2r83fzme \xe2\x80\xa6'
363: b'Goal! Liverpool 1-0 Porto (6") : Keita : Firmino # FPL # GW34 # ChampionsLeague <Admin # H17>'
364: b'# FPL # GW34 Bernardo @ City_Watchhttps://twitter.com/Sammy_Goal/status/1115682304117096449 \xe2\x80\xa6'
365: b'Thigh strain for Bernardo Silva # FPL # GW34 # MCFC # TOTMCIhttps://twitter.com/Sammy_Goal/status/1115682304117096449 \xe2\x80\xa6'
366: b'Klopp, on Monday, re Gomez: "We should not think about Joe for the next one or two weeks because now he needs really proper training." # LFC # FPL # GW34 # Robertson # TAAhttps://twitter.com/LFC/status/1115677565459554307 \xe2\x80\xa6'
367: b'Trying to find a way to get Kane, Aguero, Vardy and Jimenez in to my WC team. Think I might be waiting a while.... # FPL # GW34'
368: b'# mcfc BSilva not in the Line up tonight? Think he will play against palace? # fpl # gw34'
369: b'Where on earth is Andrew Ropertson? @ BenDinnery @ OfficialFPL # FPL # LFC # GW34 https://twitter.com/LFC/status/1115671578057105409 \xe2\x80\xa6'
370: b'Walker and more surprisingly Delph fit, think I\xe2\x80\x99ll be giving mendy a miss on my WC then # FPL # GW34'
371: b'Great pod lads. I\xe2\x80\x99m gonna have to take a hammer to my Son Wild Card pick now and see how I can wedge in Eriksen. Just when I thought I had # FPL # GW34 sorted.'
372: b'[1/6] # GW34 Projection Thread First looking at captain options, BHA players standout in particular Mat Ryan and Shane Duffy look solid picks. Kane, Alli & Eriksen are premium alternatives for those not convinced by BHA datasource: http://www.fplreview.com/team-planner # FPL # FPLCommunitypic.twitter.com/HWtk0QY0jH'
373: b'# GW33 Summary () All out Overall rank up to 239k Vardy Hazard # BGW33 # GW33.. Wildcard Active for # GW34 # FPL # FPLCommunitypic.twitter.com/E5Y3lRbOMj'
374: b'Everton in the Last 3 Gameweeks: Everton 2-0 Chelsea West Ham 0-2 Everton Everton 1-0 Arsenal Goals Scored: 5 Goals Conceded: 0 Clean Sheets: 3 Everton defenders are Hot again ? # FPL # GW34 <Admin # Biebek>pic.twitter.com/pDDDiXXFK2'
375: b'Most Transferred out Today 1) Hazard MF CHE 11.1 15457 2) Ag\xc3\xbcero FW MCI 11.8 14701 3) Man\xc3\xa9 MF LIV 10.1 13324 4) Alonso DF CHE 6.4 12285 5) Pogba MF MUN 8.7 11622 # FPL # GW34 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
376: b'Most Transferred in Today 1) Kane FW TOT 12.5 27783 2) Son MF TOT 8.5 21566 3) Duffy DF BHA 4.7 21195 4) Jim\xc3\xa9nez FW WOL 6.8 18083 5) Murray FW BHA 6.3 15616 # FPL # GW34 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
377: b'# GW33 summary; : 8437 FelipeHazard = : Salah and Hazard : Hazard # GW34; WC # FPL pic.twitter.com/Z9igPina7C'
378: b'# FPL Harry Kane # GW34 Anyone??? pic.twitter.com/rm1KuEsbUD'
379: b'We have gone BIG and created a team and player analysis ahead of # GW34. Check out our thoughts on the best players to own for your wildcard, a lot of time invested so appreciate any retweets! http://www.footballadvice.co.uk/gw34-fpl-wildcard/ \xe2\x80\xa6 # FPL # FPLCommunity # WildCard'
380: b'And here are the top players according to Foomni Power Index. Mr. Babel is quietly doing a pretty decent job down there # FPL # GW34 pic.twitter.com/mpQRAN4NkH'
381: b'Here are the most in-form players right now. There are some surprising names on the list! # FPL # GW34 pic.twitter.com/007LrxDnoo'
382: b'# FPL # GW34 Wildcard Draft no.4: Salah in for the fixture. Will he be essential again at the final 4 GWs? Aguero is the one dropped. And that triple BHA defense though. pic.twitter.com/uSdPiW5eWw'
383: b"I'm currently on Robertson and TAA on my Wildcard but I'm also considering Robertson/ TAA & Mane. I can also triple up but will have to bench all three in # GW34 as Liverpool faces Chelsea. # FPL # FPLCommunity"
384: b'India Rank up at # FPL # GW34 # FPLCommunitypic.twitter.com/qJcIscE4oY'
385: b'\xc2\xa9 # GW34 captain picks # FPL Kane, Vardy, Sterling, Duffy & Camarasa @ Dan_KP @ FPLViper @ LiveLCFC @ FPLGeneral @ OfficialFPL @ the_art_of_fpl @ FFScout @FplNorske @ FPL_Enthusiast TY all # FPLcommmunity # fantasypl # freehit # wildcard # DGW34 https://www.thestatszone.com/fpl-gameweek-34-captain-picks-18-19 \xe2\x80\xa6pic.twitter.com/PvCxknEJWi'
386: b'# GW33 review Vardy, Hazard, Digne Boruc, Van Dijk, Barnes, Wilson, Rondon 79 points OR 9776 Great to be back in top 10k for 1st time since GW14 2 FT for # GW34, no WC but still have BB to play # FPLCommunity # FPL pic.twitter.com/HhmF4YZAyw'
387: b'# FPL # GW34 Wildcard Draft no.3: Without LIV attackers and with Aguero in contention. Option 1: Triple BHA defense, with Sterling in. Option 2: Sterling becomes KDB and Dunk becomes Trippier. pic.twitter.com/LnOWSmTH79'
388: b'NEW POST - fantasy premier league GW34 \xe2\x80\x93 analysing the teams of 10 top FPL managers https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-transfer-tips-gw34-10-top-fpl/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fantasypl # GW34 # DGW34 # wildcardpic.twitter.com/4DE95MXN66'
389: b'https://youtu.be/_F2zj2GJr-I # fpl # fantasyfootball # FPLCommunity # CHEWHU # BGW33 # gw33 # gw34 # dgw34 # dgw35 # WildCard # FantasyPL # ffscoutpic.twitter.com/DpRthsyIiq'
390: b"It's double differentials from @ ColmVHayes in our captaincy candidates for Gameweek 34 https://www.thestatszone.com/fpl-gameweek-34-captain-picks-18-19 \xe2\x80\xa6 # FPL # FPLCommunity # GW34"
391: b'# FPL # Gameweek34 BEST FIXTURES is now online on the Polestar Football youtube channel. # premierleague # FPLCommunity # GW34 # FPLWildcard # FollowThePolestar Click here to watch https://youtu.be/dB14v4V9Yio pic.twitter.com/y5tL96XT3T'
392: b'We\xe2\x80\x99re not wildcarding this week (not jealous, at all... honest), so we won\xe2\x80\x99t have lots of team line ups to share with you. But! What we\xe2\x80\x99re going to do instead for this week\xe2\x80\x99s Ones to Watch is 8 player picks \xe2\x80\x94 One budget, one premium \xe2\x80\x94 for each position. # FPL # GW34 # FPLCommunity'
393: b'WC idea #1. Then Deeney for Murray GW35 for bench boost. What ya think? # FPL # GW34 # DGW35pic.twitter.com/4TKfbTcAZ5'
394: b'WILDCARD DARE! New video! GeoGuessr determines the team! # FPL # FPLCommunity # GW34 https://youtu.be/Cackqzsxb9s'
395: b'1st wildcard draft ahead of # GW34 - thoughts? Thinking possibly going Gunn over Ryan? Opinions on Redmond & Deulofeu over JWP or other cheaper mid options? Also like Eriksen... # FPL pic.twitter.com/efqNYZWk8l'
396: b'Price Changes (4/9/2019) Risers: Vardy \xc2\xa39.2m Fallers: Su\xc3\xa1rez \xc2\xa35.7m Pedro \xc2\xa36.3m Higua\xc3\xadn \xc2\xa39.4m Mawson \xc2\xa34.7m # FPL # GW34 # FPL_Price'
397: b'FPL OFFICIAL Price Changes (4/9/2019) Overnight Risers: Vardy \xc2\xa39.2m Overnight Fallers: Su\xc3\xa1rez \xc2\xa35.7m Pedro \xc2\xa36.3m Higua\xc3\xadn \xc2\xa39.4m Mawson \xc2\xa34.7m # FPL # GW34 # FPL_PriceChanges # Aye'
398: b'Our Preliminary Team to Watch for # GW34 is out! Are you preparing your wildcards? # FPL pic.twitter.com/A8xgQO82ww'
399: b'How about Ryan, Dunk and Murray?? # FPL # GW34'
400: b"Gonzalo's doing 1 tonight ... # FPL # GW34"
401: b'Hasil # GW33 62pts Rank GW 585.908 Overall GW 1.622.9333 # FPL # GW34'
402: b'NEW POST - fantasy premier league DGW34 \xe2\x80\x93 the FFGeek team points plus a few more thoughts on the wildcard team https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-teams-dgw34-ffgeek-early/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fantasypl # GW34 # DGW34 # wildcardpic.twitter.com/4qviiw6JJz'
403: b'Quick look at the # FPL fixtures till end of season to help with our WC teams. As mentioned on our pod looking to get in players that cover # GW34 & # GW35 & also see us out till end of season where possible. Liking the Camarasa for 34 then switch to a # DGW35 BB player move.pic.twitter.com/IJcK2gJDdS'
404: b'If going by the eye test then KDB should be the first City asset in the WC. I\xe2\x80\x99m tempted by him over Sterling # FPL # FPLCommunity # GW34'
405: b'Have you activated your # Wildcard? Stay tuned for news about a big # GW34 Q&A article coming from fplfootballadvice. \xe2\x80\xa2\xe2\x80\xa2\xe2\x80\xa2 # premierleague # fantasypremierleague # fplcommunity # fantasypl # fpl\xe2\x80\xa6 https://www.instagram.com/p/BwB9Pqihs4Z/?utm_source=ig_twitter_share&igshid=1dows55rtp1e0 \xe2\x80\xa6'
406: b'We have a BIG wildcard article dropping later today Keep your eyes peeled! # FPL # FPLCommunity # GW34'
407: b"Since I have used the wildcard before # GW23, the result is in front of your eyes. I wouldn't say that was a wrong decision. With the upcoming two transfers I plan to make for # GW34 and probably one more for # DGW35, TC & BB left, I am still in the game for the final push. # FPL pic.twitter.com/gZTRblyqrJ"
408: b'# FPL # GW34 Any suggestions on this wildcard team? Feel like it\xe2\x80\x99s only with a few teams like it though. pic.twitter.com/eH9QLv3MVs'
409: b'NEW POST - Andrew Ferguson @ Fergi222 reviews his teams in # FPL, TFF, Sky & Sun + his plans for # GW34 with a draft # wildcard Andrew finished top 1k in TFF, Sky & FPL +15k in Sun in 17/18. https://www.fantasyfootballgeek.co.uk/gw34-fantasy-football-tips-andrew-ferguson/ \xe2\x80\xa6 # sundreamteam # telegraphfantasyfootball # skysportsfantasyfootballpic.twitter.com/wQ74BToGjh'
410: b'# FPL # Gameweek34 TEAM SELECTION is now online on the Polestar Football youtube channel. # PremierLeague # GW34 # WildCard # FPLCommunity # FollowThePolestar Click here to watch https://youtu.be/u6nNbHYxkBc pic.twitter.com/eWCpypYcBR'
411: b"Don't listen in Anchor as it's a bit meh. Click on anchor link then choose listen in other app and pick your app of choice. As mentioned last time we will get SoundCloud if decide to keep up this experiment next season. # FPL # GW34 https://anchor.fm/renegades/episodes/Episode-18-GW34-e3m69g \xe2\x80\xa6pic.twitter.com/Sb9abD5PrQ"
412: b'Who would you prefer in your # WildCard team for # GW34 ?? # fpl'
413: b"72 all out for me. OR 2,881 -> 2,313 Sterling -> Hazard (FT) went well! Hazard DIDN'T TROLL!! (pretty troll thing to do?!) Vardy Party was great Rest - meh # GW34 means WC time! Total reshuffle in order... # fpl pic.twitter.com/JIkMM6JT1r"
414: b'Episode 18 - all things # GW33 & # GW34 - The worst 3 rendition ever - Willy loses \xe2\x82\xac1million - Cheer up its only # FPL More links in comments below. As always appreciate all listens, shares and feedback folks https://open.spotify.com/episode/72BrbEmbPocxIjmBsE6RG0?si=KXsXdQ3CQiuc94Ci3pW7sg \xe2\x80\xa6'
415: b'If you are/were using your wildcard this week, what are/would be your plan regarding owning Kane &/or Aguero? Let\xe2\x80\x99s assume both men are passed fit for the weekend following their CL game this week. # FPLPollOfTheWeek # GW34 # FPL'
416: b'Eden Hazard Last 5 games: 4 goals 1 assist 14 passes lead to shot world class # CHEWHU # CFC # gw34 # FPL # FPLCommunitypic.twitter.com/mYGRkgjrK1'
417: b'@ OfficialFPL Price Changes (645 am IST - 9th Apr 2019) Price Rises: Vardy # LCFC \xc2\xa39.2 Price Drops: Su\xc3\xa1rez # AFC \xc2\xa35.7 Pedro # CFC \xc2\xa36.3 Higua\xc3\xadn # CFC \xc2\xa39.4 Mawson # FFC \xc2\xa34.7 # FFEPriceChanges # FPL # GW34'
418: b'Gameweek 33 Top Players # FPL # GW34 http://fpl247.com/page/61a4ad55-9dcf-4aef-94d4-31948bc3d576 \xe2\x80\xa6'
419: b'Gameweek 33 Top Teams Transfer Analysis # FPL # GW34 http://fpl247.com/page/275ead54-c43e-4668-8809-78d8a7e614d0 \xe2\x80\xa6'
420: b'Gameweek 33 Top Teams Player Analysis # FPL # GW34 http://fpl247.com/page/a264f722-ca91-4e99-8a54-895587a258c0 \xe2\x80\xa6'
421: b'Gameweek 33 Top Teams Formation Analysis # FPL # GW34 http://fpl247.com/page/c51c127c-274c-40a3-857b-724a4dca20b1 \xe2\x80\xa6'
422: b'Finish # GW33 on 67 points (-4) after captain # Hazard deliveredNow onto my wildcard for # GW34. Feels wrong selling him after that MOTM performance though # FPL pic.twitter.com/xtU6fHqEHq'
423: b'Most Transferred out Today 1) Hazard MF CHE 11.1 6486 2) Ag\xc3\xbcero FW MCI 11.8 5948 3) Man\xc3\xa9 MF LIV 10.1 5644 4) Alonso DF CHE 6.4 5282 5) Higua\xc3\xadn FW CHE 9.4 5016 # FPL # GW34 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
424: b'Most Transferred in Today 1) Kane FW TOT 12.5 11887 2) Son MF TOT 8.5 9394 3) Duffy DF BHA 4.7 8765 4) Jim\xc3\xa9nez FW WOL 6.8 7404 5) Laporte DF MCI 6.0 6291 # FPL # GW34 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
425: b"Those that's not a WC, what are your next moves? I am currently thinking... # Azpel # Duffy # Zaha # Rashford # GW34 # FPL"
426: b'At the start of 2019, I was over 1,000,000 in OR. Top 250K now You can always turn your season around by taking advice, using it to make your own choices and taking some justified risks. Heck, if I can do it you definitely can # BGW33 # GW34 # FPL pic.twitter.com/uR1CmINF80'
427: b"# FPL # GW34 Review ~55(-4) pts ~ 148K (142k prev) Above average score but didn't help much as now on 3rd consecutive red arrow streak. Need to pick up the pace and target above 10k average pts every week from now on. WC is deployed this week & BB in DGW35. pic.twitter.com/P256nMMOPj"
428: b'# GW33 Review 82 points 63,599 OR (40k green arrow ) Hazard/Vardy Salah/Azpi/AWB/Pereira Much needed green arrow, into the business end of the season Wildcard activated, bring on # GW34 How did everyone else do? # FPL # FPLCommunitypic.twitter.com/pZhaeAWfhk'
429: b'The most-sold player of Gameweek 34 scored 16 points last night... https://www.fantasyfootballscout.co.uk/2019/04/09/hazard-delivers-parting-gift-as-fpl-sales-continue-ahead-of-gameweek-34/ \xe2\x80\xa6 # FPL # GW34 # DGW34 # CHEWHU'
430: b'Overnight price fallers Higua\xc3\xadn FW CHE 9.4 Mawson DF FUL 4.7 Pedro MF CHE 6.3 Su\xc3\xa1rez MF ARS 5.7 # FPL # GW34 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
431: b'Overnight price risers Vardy FW LEI 9.2 # FPL # GW34 http://www.fpl247.com/player/price/weekly?change=rise \xe2\x80\xa6'
432: b'Overnight players unavailable Kiko Femen\xc3\xada DF WAT 4.2 Lallana MF LIV 6.9 Schneiderlin MF EVE 4.2 # FPL # GW34 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
433: b'Overnight players available Pedro MF CHE 6.3 Loftus-Cheek MF CHE 5.2 # FPL # GW34 http://www.fpl247.com/player/returning \xe2\x80\xa6'
434: b'Don\xe2\x80\x99t get the love for Brighton defence... Don\xe2\x80\x99t get me wrong I\xe2\x80\x99ll have atleast one, but Cardiff (up second) will be fighting tool and nail for their PL survival. 2pts or less double or triple defence doesn\xe2\x80\x99t feel right to me. # fpl # fplcommunity # GW34'
435: b'Everyone on Wildcard right now.... # FPL # FPLCommunity # GW34 # GW35pic.twitter.com/VMUD8E55Gb'
436: b"Pod #168: We're in the # FPL Endgame now! Planning our late-season Wildcards we discuss all nine clubs doubling in # GW34 & # GW35. Which players and run-ins stand above the rest? Plus we continue our # AlwaysXGing illustration contest . # hailcheatershttps://soundcloud.com/alwayscheating/ep-168-wildcards-and-the-fpl-endgame-gw33-34 \xe2\x80\xa6"
437: b"*** Ep. 189 - On to # GW34 and the Doubles with a Full Head of Steam *** Huuuuuuuge pod with infinity amounts of action to talk about and Walsh on wildcard it's really just insane times and we talk about everything. http://fmlfpl.libsyn.com/ep-189-on-to-gw34-and-the-doubles-with-a-full-head-of-steam \xe2\x80\xa6 # FMLFPL # FPL # FantasyPL"
