1: b"Here's our updated lineup. We are currently considering other available options for our captain. # GW35 # FPL pic.twitter.com/rp1C9cQoAH"
2: b"Well with no wildcard, this is the best it's gonna get Would be tempted to take a -4 for an Arsenal defender but there will be so much rotation. Sadly can't afford another City defender either, and none of the others inspire me much to take the punt TC Kun # FPL # DGW35 # GW35 pic.twitter.com/19uCUBZR1F"
3: b'What is the probability that Eriksen is benched during the DGW? # fpl # gw35 # DGW35'
4: b'GW35 locked in **BENCH BOOST ACTIVE** OR: 26,471 15 players, all seemingly fit and well, 12 with two games, and triple Liverpool against Cardiff. Feeling pretty confident of a very good gameweek (famous last words...) Good luck everyone! # FPL # GW35 pic.twitter.com/CSN97JScpW'
5: b"Absolute Shithousery formation just because I'm using bench boost # FPL # FPLCommunity # GW35 pic.twitter.com/YcJGoGVOk6"
6: b'My # DGW35 team locked in! Triple Captain active on Kevin De Bruyne Let\xe2\x80\x99s get it! # FPL # GW35 pic.twitter.com/RWFBnlkgLE'
7: b'No transfers for me tonight Will be holding my moves as long as possible to see which players do and don\xe2\x80\x99t get off those Man City and Spurs team buses in the morning # FPL # GW35 pic.twitter.com/Spmn1Is7dB'
8: b"People think giving fantasy football advice is easy. Well it isn't, which is why we gave up months ago. Now we just have a little cry and blame everything from Cannon and Ball to our own stupidity: https://the4pointhit.wordpress.com/2019/04/18/fantasy-forecast-gameweek-35/ \xe2\x80\xa6 # FPL # FPLCommunity # DGW35 # GW35 # FantasyPL"
9: b'Silly season time. All in on captain Gray & bench boost. My final rank probably lives or dies by what happens this gameweek. Que sera sera. # fpl # GW35 pic.twitter.com/yEeUzfPfIW'
10: b'Locked with Bench Boost # FPL # GW35 # DFW35pic.twitter.com/2FlTz650ti'
11: b'The Man City result this week changes everything. City attack is now a must. Press Conferences Transfers made Bench Boost Active Captain Decision OR: 115 # FPL # FPLCommunity # DGW35 # GW35 Good luck all pic.twitter.com/iyVsNvm7MD'
12: b'My # FPL free hit team for # DGW35 (I think lol) keep swapping captains armband...just like Wolves home games...any last minute advice will be much appreciated! # GW35 pic.twitter.com/79AbnHj2qk'
13: b'# GW35 # FPL # RefStats Goals? BOUFUL, HUDEWAT, EVEMUN, ARSCRY, WOLARS Penalties? MCITOT, HUDWA, ARSCRY Red Cards? WHMLEI, WATSOU Winners? BOU, HUD, WHM, BHA, NEW, MUN, ARS, TOTg2, WATg2 # DGW35 # WhatTheRef # RefOffpic.twitter.com/ecABfRlayo'
14: b'The obvious debate for an Arsenal forward? # fpl # DGW35 # gw35 # benchboost'
15: b'Wolves By @ OGold80 # FPL # Wolves # wwfc # GW35 pic.twitter.com/07nDUfNjxw'
16: b'# FPL # GW35 Weekly Differentials @ HypeTrainSam explores a hidden Fantasy gem in each Premier League fixture ahead of the upcoming Double Gameweek that might make the difference in your squad. Read here https://www.thehypetrain.co.uk/single-post/2019/04/19/WEEKLY-WILDCARDS-201819-FPL-Gameweek-35 \xe2\x80\xa6pic.twitter.com/xBNbJUtKZ5'
17: b"Llorente comfortably wins the # FPLCommunity poll as the best Deeney replacement <\xc2\xa36M. If he starts against Brighton he should prove the best choice too I've included FPL Review data with the following expected mins Llorente[65], Gray[60], Ings[60], Rondon[80] # FPL # GW35 pic.twitter.com/i1esrkXnSg"
18: b"I'm choosing to think about the DGW as a SGW plus a back-up. Its insurance against a rest in one game, and I'm only expecting 90mins from them all as I would any other week. I'm doing that for my sanity. # FPL # GW35 pic.twitter.com/VrCcrHPqkf"
19: b'# FPL # GW34 42pts red 43k OR 227k very poor for WC but all set for # GW35 BB Ryan/Duffy>Gunn/Bednarek for -4 gives \xc2\xa32m ITB for planned remaining transfers 11 with 2 games Jimenez (C) Expect rotations aplenty but hopefully each have at least 1 productive game pic.twitter.com/KBJTIsmmYv'
20: b"My bench boost team for # GW35 Hazard + Ryan Sterling + Foster (-4) Sterling (c) - expecting him to destroy our reserves tomorrow lunchtime Couldn't get rid of all the Brighton scum, but just 1 I can handle... Good luck everyone # FPL pic.twitter.com/5nHh2i8Bsy"
21: b'Arsenal By @ GiroudsTop # FPL # AFC # COYG # GW35 pic.twitter.com/bAkfOVdYeK'
22: b'Monreal or VVD for Gw35?? @ OfficialFPL # FPLCommunity # FPL # GW35 Already own Robertson..!!'
23: b'Hoping that this week\xe2\x80\x99s BB is better than last week\xe2\x80\x99s WC. # FPL # GW35 # DGW # BBActive # 14DGWerspic.twitter.com/l1zkNnpvvp'
24: b'I know I want a MCI defender, but which one? Mendy - can he start twice in quick succession, attacking Walker - not done a whole lot wrong lately, has been dropped randomly before Laporte - two clangers against Spurs, has a history of turning up in DGWs # FPL # DGW35 # GW35'
25: b"NEW POST - Fantasy premier league \xe2\x80\x93 FFGeek contributors show their GW35 teams part 2 There's @ JordanSadler95 @ MleichtD @ alexwaterbaby Yaniv Salomon and Sergio Torija https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-team-tips-gw35-ffg-contribs2/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW35 # DGW35 # wildcard # fplislifepic.twitter.com/80Z51TNybt"
26: b'Evening all. Time has come to launch the bench-boost chip into the pot, so here\xe2\x80\x99s how we\xe2\x80\x99re shaping up. Captain Son leads treble Man City, Arsenal & Saints, double Spurs & Wolves, & lone representatives from Liverpool & Watford. Good luck all! Green arrows incoming! # GW35 # FPL pic.twitter.com/vusFOy70EF'
27: b'Also, once you are logged in, after deadline has passed, you can access our LIVE CENTRE and follow the point changes live for all 3 squads you connected for that gameweek! # FPL # FPLCommunity # GW35 # DGW35 Sign up guys! https://foomnianalytics.com/signup.php pic.twitter.com/cWTBSwFLpZ'
28: b'# FPL # GW35 Fantasy Forecast The Hype Team ( @ HypeTrainSam, @ HypeTrainPhil and @ HypeTrainRob) take on @ FFootball92 in Premier League predictions, Double Gameweek insight, and in picking a Scout Picks team. Read here https://www.thehypetrain.co.uk/single-post/2019/04/19/FANTASY-FORECAST-201819-FPL-Gameweek-35 \xe2\x80\xa6pic.twitter.com/Yb2xVgdjed'
29: b'Three diamonds in front positions! Jimenez Good luck, mates! Madness. # GW35 # DGW35 # Aguero # Jimenez # Wilson # FPL pic.twitter.com/FIKdKbZ92H'
30: b'Enjoyed the pod @ 59thMinutePod @ FPLGeneral I have the dreaded bench you described! Could make changes to bring in Wilson/SOT Def for Deeney/Duffy but tempted to forget all plans of bench boosting this week # fpl # GW35 pic.twitter.com/BOSlTtR7WJ'
31: b'Most important player this DGW? # GW35 # FPL'
32: b'FPLowe \xc5\x9bwirki, help. Do ko\xc5\x84ca sezonu,chce zrobi\xc4\x87 tercet Robbo+AWB(od GW36)+X. Na \xc5\x82awce Jan Dijk i R.Bennett ale nie wiem czy wywala\xc4\x87 BHA ju\xc5\xbc teraz czy po DGW # FPL # FPLCommunity # GW35 # jakgractoznajlepszymi @ FantasyPL_FPL @ fplpoland # kana\xc5\x82angielski @ GRUWWA @ mbulski23 @ M_Gutka'
33: b'Can you guess the most likely goalscorers in # GW35? 1. (82%) 2. (78%) 3. (75%) Check all the odds relevant to # FPL, here https://www.fantasybet.com/blog/clean-sheet-odds-gameweek-35/ \xe2\x80\xa6'
34: b'GW35 Captain poll From these 4, who would you pick # fpl # GW35'
35: b'Player Status Change Smithies GK CAR 4.2 Duhaney DF HUD 4.0 # FPL # GW35 http://www.fpl247.com'
36: b'THANK YOU FOR JOINING US LIVE DISCUSSING DGW35 https://youtu.be/u2On_FKgRF4 # fpl # fantasyfootball # dgw35 # gw35 # ffscout # fplcommunity # FantasyPLpic.twitter.com/qnElfIh3iP'
37: b'NEW POST - fantasy premier league \xe2\x80\x93 the FFGeek team for GW35 https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-team-selection-gw35-ffgeek/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fantasypl # GW35 # DGW35 # wildcard # freehitpic.twitter.com/SWOWBuRyjP'
38: b'Best replacement for Troy Deeney? # GW35 # DGW35 # FPL'
39: b"Advice Shop: Closed! Good luck this GW everyone. ICYMI we've put out 2 podcasts out this week: our regular pod and a bonus pod for Patrons. You can access the Patreon pod here: http://www.patreon.com/alwayscheating # FPL # GW35 https://twitter.com/hailcheaters/status/1119302679862358019 \xe2\x80\xa6"
40: b'King King got no attacking points last week in a game that Bournemouth scored 5 goals in, this time around I think he might just be amongst the goals or assist against Fulham Enjoy the final DGW of the season everybody # FPL # GW35 # DGW35'
41: b"Sane I expect Sane to start against Spurs, with the success Sterling enjoyed out wide against Spurs' defence I think Sane might get some attacking points Llorente I expect Llorente will start against Man City, could he score twice against them in a week? # FPL # GW35 # DGW35"
42: b"Differential Punts Doucoure Due to fact that Watford's doubles consist with a game against Huddersfield, the DGW33 hero might just strike again. Deulofeu is another option if fit # FPL # GW35 # DGW35"
43: b'If you think Sterling has a good chance at starting both games or at least start one game and play 20 minutes in the other then you can\xe2\x80\x99t look beyond him for your Triple Captain, he has the added benefit of 5 points for a goal & 1 clean sheet point # FPL # GW35 # DGW35'
44: b'Hazard He scored 30 points over GW32 & GW33 and should have had at least one goal if not two against Liverpool. Burnley at home is a great fixture for hazard who is now only 7 points behind Salah as the top FPL points scorer of this season so far # FPL # GW35 # DGW35'
45: b'SGW Captain Punts Salah or Mane With Salah back to scoring form with 2 goals in 2 PL games and a goal in the CL, you have fancy Salah against Cardiff. Mane however has been the more consistent goalscorer since GW23 # FPL # GW35 # DGW35'
46: b'The problem with both Aguero & Sterling is they might get rested in 1 of the 2 games. I expect Jimenez to start both games, so it depends what sort of risk do you want to take on your captain. Also consider these single game players: # FPL # GW35 # DGW35'
47: b'Sterling does not have a great record against ManU but this United side isn\xe2\x80\x99t great in defence. Sterling scored twice at home against Spurs in the PL last season plus scored twice in the Champions league in mid week. He is in great form at the moment # FPL # GW35 # DGW35'
48: b'Aguero scored against Spurs in Champions League who have 1 clean sheet in 6 away games. Aguero has scored 10 goals against Spurs in 14 PL matches, I\xe2\x80\x99d back Aguero to add to that tally On top of that City have play ManU away who haven\xe2\x80\x99t kept a PL clean sheet in 6 games # FPL # GW35'
49: b'Aguero loves playing the big sides at home, last 2 home outings against a top side at home were against Arsenal & Chelsea in which Aguero scored a hat trick in both games. # FPL # GW35 # DGW35'
50: b'DGW Captains Jimenez 3 out of the last 4 PL home games have produced double digit hauls. Wolves play twice at home against teams that struggle for away cleansheets, Wolves love the big games at home so Jimenez v Arsenal could produce dividends # FPL # GW35 # DGW35'
51: b'Who do I pickup for # FPL # Gameweek35 # GW35 ?'
52: b'Who is the most transferred out players ahead of # GW35 in # FPL:'
53: b'On a FH for # GW35 & showing tremendous faith in the Liverpool lads as a Utd fan & on a SGW That\xe2\x80\x99s what # FPL does to you pic.twitter.com/zMBoT8VW5x'
54: b'Who is the most transferred in players ahead of # GW35 in # FPL:'
55: b"The Always Cheating Advice Shop is open for the next 20 minutes. Fantasy Premier League questions? Let's hear them. Preemptive note: I currently rank the Top 5 (C) picks in the following order: 1) Jim\xc3\xa9nez, 2) Sterling, 3) KdB, 4) Aguero, 5) Son Let's do this. # FPL # GW35 pic.twitter.com/rXfu8FuYz2"
56: b'# GW35 BENCH BOOST OR 13,164 Jim\xc3\xa9nez 12x DGW players (-4 with Deeney/Duffy out for Masina/Wilson) Expecting rotation from the Spurs\xe2\x80\x99 players. Good luck all - let\xe2\x80\x99s see those teams # FPL pic.twitter.com/qtty1pZRe6'
57: b'# FPL Midfielders # GW35 # Sterling # Spurs # ManU # Hazard # Burnley # Pogba # EFC+ # MCFC # Eriksen # MCFC+ # Brighton'
58: b'Anyone want to hear my top # FPL picks from Huddersfield for # gw35? pic.twitter.com/NbVjwGwh2e'
59: b'Gameweek 35, where all your dreams can come true. As long as your dreams involve wearing a suit lined with sandpaper before sliding down a mountain. https://the4pointhit.wordpress.com/2019/04/18/fantasy-forecast-gameweek-35/ \xe2\x80\xa6 # FPL # FPLCommunity # GW35 # DGW35 # FantasyPL # fantasypremierleague'
60: b'So here is me for # GW35 Bench boost activated Deeney OUT for Wilson Duffy OUT for Yoshida Captain currently on Kun but very tempted with Son, KDB and Jimi. Just cannot decide OR 28,529 Good luck everyone P.s not owning Sterling scares me # fpl pic.twitter.com/zonEiuSxNU'
61: b'After the previous week\'s "challenging conditions", shall we say, the site team\'s plans for # FPL # GW35 impersonated Brexit by not really knowing where they\'re going or what to achieve \xe2\x80\x8d\xe2\x80\x8d Theresa, take note - something was finally agreed on: https://fantasyfootball247.co.uk/ff247-fantasy-football-site-team-gw35/ \xe2\x80\xa6'
62: b'Do you guys need any advice for # GW35? # FPL'
63: b'LOCKED IN # GW35 My FPL Captain: Jim\xc3\xa9nez (subject to change after a few ) Transfers (-4): Salah Sterling Rondon Jim\xc3\xa9nez Fairly confident in this team, hope Salah ejection doesn\xe2\x80\x99t come back to bite me on the arse will have him back next GW Good luck all! # FPL pic.twitter.com/UDtILlz786'
64: b'Hmmm bench boost or triple captain? I have one free transfer # FPL # GW35 # DGW35pic.twitter.com/EmNk7M6WPY'
65: b'Player Status Change Alonso DF CHE 6.3 # FPL # GW35 http://www.fpl247.com'
66: b'Ryan Gunn is the obvious target if you have no money, Patricio/Foster/Leno are ones to consider if you have upto 0.5m to spend. If money is no issue then get one of top premium keepers such as Ederson, Allison or Lloris # FPL # GW35 # DGW35'
67: b'Of course the best sceanrio would be if you can upgrade these players to Liverpool or Man City defenders but I wanted to keep replacements within the same price point # FPL # GW35 # DGW35'
68: b"Duffy to Boly seems ideal to me as they the are the same price with Boly providing an attacking threat just like Duffy or you can downgrade to one of the players i mentioned as Dunk's replacements. # FPL # GW35 # DGW35"
69: b'Duffy/Dunk replacements There aren\xe2\x80\x99t many players to replace Dunk with at 4.4 or below. Yoshida/Bednarek are probably the ones to look at with Romain Saiss as an outside option. Coady at 4.5 is probably the best option # FPL # GW35 # DGW35'
70: b"Those are the candidates to replace Deeney in our squads, my main advice is look longer term then just GW35. The last thing you want to do is replace Deeney's replacement Wilson or Firmino would be my choice even though they have single game in GW35 # FPL # GW35 # DGW35"
71: b'Firmino Liverpool\xe2\x80\x99s fixtures against Cardiff in GW35 & Hudderfield in GW36 make him a good option and he also has form with 3 goals & assists in last 5 games. Perez/Rondon Nice fixtures apart from the Liverpool game plus some sort of form to go with it. # FPL # GW35 # DGW35'
72: b'Wilson Bournemouth play Fulham(H) in GW35 with the other 3 remaining games against Southampton(a), Spurs (H) & palace(a). Those fixtures might just be good enough to look at Wilson for the rest of the season # FPL # GW35 # DGW35'
73: b'Llorente If you can deal with limited minutes &/or rotation then Llorente could be a good pick, he is priced at a bargain 5.1. He scored the vital goal in the CL semi final, so his confidence must be sky high plus he an assist last week against Huddersfield # FPL # GW35 # DGW35'
74: b"FPL GW35 Preview P2 Deeney replacements Andre Gray looks set to replace Deeney but he faces competition from Isaac Success Whilst Gray might score in 1 of the 2 games, I just don\xe2\x80\x99t rate him and don't want to be stuck with him for remaining games of this season # FPL # GW35"
75: b'# FPL team news and injury updates for Gameweek 35 https://www.fantasyfootballscout.co.uk/2019/04/19/fpl-team-news-and-injury-round-up-double-gameweek-35/ \xe2\x80\xa6 # GW35 # DGW35'
76: b"NEW POST - Fantasy premier league \xe2\x80\x93 FFGeek Contributors Show Their # GW35 Teams Part 1. Includes a TC & 3 BBs There's @ jwcrilley @ Thefpl_vet @ StephenTroop Costas Chari, Rob Cosgrove & Mikael H https://www.fantasyfootballgeek.co.uk/fpl-team-tips-gw35-ffgeek-contribs1/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # DGW35 # wildcardpic.twitter.com/pM3TffpMiZ"
77: b'Captaincy poll, which City maestro gets your vote? # fpl # gw35'
78: b'Offering the potential of a double GW in 35, Llorente is the cheapest of our Deeney replacements so far. Llorente has been directly involved in 13 goals in his last 10 Spurs starts, offering excellent potential with Kane unavailable through injury. # FPL # GW35 # FPLCommunitypic.twitter.com/NMmbFpjqCT'
79: b'http://YOUTUBE.COM/ELITEFPLPODCAST # fpl # fantasyfootball # dgw35 # gw35 # ffscout # fplcommunity # FantasyPLpic.twitter.com/QctQ9FHHGW'
80: b'Most Transferred out Today 1) Vardy FW LEI 9.1 47712 2) Hazard MF CHE 11.0 47443 3) Deeney FW WAT 5.9 22500 4) Maddison MF LEI 6.8 17003 5) Richarlison MF EVE 6.4 16800 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
81: b'Most Transferred in Today 1) Sterling MF MCI 11.5 34554 2) Son MF TOT 8.8 34540 3) Lucas Moura MF TOT 6.8 34010 4) Jim\xc3\xa9nez FW WOL 6.9 33286 5) Redmond MF SOU 5.3 25292 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
82: b'# FPL # GW35 indecision time... A) Save FT B) Dunk to Masina (FT) C) Deulofeu (doubt) + Dunk to Redmond + Cathcart (-4)'
83: b'Triple GW35 If you delay your BB this week then DGW35 is a great week to use your Triple captain chip. Sterling/Aguero & Jimenez have 2 games, Salah/Mane & Hazard have nice a single game week fixtures. Look at my captains selection for more info # FPL # GW35 # DGW35'
84: b'I have Deeney, Duffy & Dunk in my squad, I plan to take hit and remove Deeney plus one more and BB with what I got and then concentrate on remaining weeks. You might want to take this approach or delay BB # FPL # GW35 # DGW35'
85: b"If your bench consists of Watford players then BB in GW37+38 doesn't look ideal, which leaves GW36 If you also have Southampton players on the bench then they have good fixtures GW36-38 (away game in GW37). This without taking other teams fixtures into account # FPL # GW35 # DGW35"
86: b'The problem with this approach is between now & the end of the season there will be a maximum of 4FT\xe2\x80\x99s remaining, do you want to plan half (or more) of them on bench players # FPL # GW35 # DGW35'
87: b'GW35 Bench Boast Delaying BB means your bench players will have a single game & rotation is rife at this time of the season. The benefit as stated previously is you more FT\xe2\x80\x99s to use to help you remove the players you don\xe2\x80\x99t want. # FPL # GW35 # DGW35'
88: b'Brighton & Deeney The less said about Duffy/Dunk/Ryan/Knockaert the better, now people are second guessing themselves as to if they should BB with Brighton assets Surely going into this week people weren\xe2\x80\x99t expecting too many points from their Brighton players # FPL # GW35 # DGW35'
89: b'In GW34\xe2\x80\x99s preview I went over potential DGW target\xe2\x80\x99s from each team so I won\xe2\x80\x99t go over old ground as you can read that from a previous thread. This week\xe2\x80\x99s preview will include Bench Boast with Brighton players, Deeney, triple captain chip, captains & punts # FPL # GW35 # DGW35'
90: b"FPL GW35 Preview P1 What a complete nightmare GW34 turned out to be, it just goes to show you can plan all you like but football is unpredictable and anything can happen DGW35 provides us a chance to bounce back after last week or even increase leads in ML's # FPL # GW35 # DGW35"
91: b"My thoughts on Spurs players ahead of # GW35 Very hard to call what team will be put out with all the injuries but I'm speculating that we'll rest players vs City and go full strength vs Brighton and West Ham after. # FPL https://twitter.com/FPLMyClub/status/1119262165851168768 \xe2\x80\xa6"
92: b"Looks like I'll be one of the 9% # FPL # GW35 https://twitter.com/Legomane_FPL/status/1119152205997592577 \xe2\x80\xa6"
93: b"Checking out the latest # AlwaysCaptainAguero tweets, I see I'm pretty much the only one using it for # GW35? What's wrong with you people? # FPL # FPLCommunitypic.twitter.com/bZ0QU5Dcqg"
94: b'Tottenham By @ FPLdepression # FPL # THFC # COYS # GW35 pic.twitter.com/lpbSzRs6w4'
95: b'# GW35 Squad Picks With Deeney\xe2\x80\x99s ban, it\xe2\x80\x99s spoiled our plan for BB in GW35. We\xe2\x80\x99ve settled for a -4 for KDB & Jim\xc3\xa9nez to come in to give us 7DGW players. We expect an OR hit, but we\xe2\x80\x99ll BB later. # Captain pick goes to Aguero for his record vs TOT & MUN. # FPL # Squad # FPLCommunitypic.twitter.com/tF2yy12BJM'
96: b"Sounds a lot like Poch will play a lot of different players vs City tomorrow. Could well see Skipp, KWP, Foyth, Sanchez, Llorente come in. I'm guessing it'll be rests for Toby and/or Jan, Trippier (wish he's be dropped tbh), Alli and/or Eriksen etc. # FPL # GW35 # FPLCommunitypic.twitter.com/Vpm1K7GbMN"
97: b"# gw35 # fpl think I'm good to go, unsure about captaincy though! pic.twitter.com/6UiFiwnl8C"
98: b'Have to clean up the mess I Made of my WC last week! BENCH BOOST ACTIVATED # GW35 # FPLCommunity # FPL # MurraySUCKS'
99: b"I think I'm going all-in. Sticking to Triple BHA defense and Bench Boosting. Since I'm already stuck in quicksand, might as well swim and enjoy it. Wish me luck people. # FPLCommunity # FPL # GW35"
100: b'# GW35 Triple Captain Pick Salah vs CAR (A) Salah appears to be finding his form again 4 returns in his last 5GW plus a CL goal midweek offers confidence vs Cardiff who average 1.85 goals against. This is in addition to our Captain Picks. # FPL # GW35 # TC # Captain # FPLCommunitypic.twitter.com/lSnP6c37oV'
101: b"And here is our # GW35 Dream Team. The difference is Sterling for Doucoure, otherwise it's the same sa Team to Watch # FPL pic.twitter.com/QuwkOvZK4A"
102: b'# GW35 Triple Captain Pick Ag\xc3\xbcero vs TOT (H) + MUN (A) Aguero has an impressive record vs TOT & MUN in the past. 18 goals & 2 assists in 22 games vs the two offers a potential big return in DGW35. This is in addition to our Captain Picks. # FPL # GW35 # TC # Captain # FPLCommunitypic.twitter.com/LPZD7xvakf'
103: b'For me, a -4 is neither here nor there right now. # FPL # GW35'
104: b"So it's the time of the year where it's come down to pride and mini leagues # GW35 # FPL pic.twitter.com/CyKy5MrhxC"
105: b'FPL squad for # GW35 Bench boost active Current rank: 17k Thoughts? # FPL pic.twitter.com/idhQWwn0Ca'
106: b'# GW35 Captain Picks \xe2\x98\x85\xe2\x98\x85\xe2\x98\x85\xe2\x98\x85 Aguero vs TOT (H) + MUN (A) \xe2\x98\x85\xe2\x98\x85\xe2\x98\x85 Jimenez vs BHA (H) + ARS (H) \xe2\x98\x85\xe2\x98\x85 Salah vs CAR (A) \xe2\x98\x85 Son vs MCI (A) + BHA (H) # FPL # GW35 # Captain # FPLCommunity # MCI # WOL # LIV # TOTpic.twitter.com/iUYCdCrfxr'
107: b'Here comes our final # GW35 team to watch. This is one mighty bench! Algo hoping for a BB? # FPL pic.twitter.com/p9sUxEf9sS'
108: b"Managers, I have a feeling Pep's talisman gonna outscore quite easily Sterling & KDB in the double # GW35. # FPL # DGW35 # Aguerooooooooooooooooooooohttps://twitter.com/MailSport/status/1119175061540429824 \xe2\x80\xa6"
109: b'Llorente vs. Gray comparison # FPL # GW35 https://twitter.com/fplpoland/status/1119239115348807681 \xe2\x80\xa6'
110: b'Player Status Change Ramsey MF ARS 7.1 Xhaka MF ARS 5.2 # FPL # GW35 http://www.fpl247.com'
111: b". @ bskbroiler's commitment to high production values have always been the secret sauce of our podcast, and that's never been more true than in the intro to this week's Patreon Podcast. https://www.patreon.com/posts/kitchen-table-14-26209412 \xe2\x80\xa6 Great listen for anyone debating # GW35 transfers, (C) picks, etc. # FPL"
112: b'Schlupp is confirmed to miss rest of the season, and Algo is certain someone from Southampton should be his # FPL replacement # GW35 pic.twitter.com/TfN3AvENDE'
113: b"# FPL # FPLCommunity # DGW35 , # GW35 My transfer thoughts I'm currently leaning towards Will Hughes with Deeney suspended Watford are likely to rely on their wingers(Deulofeu/Hughes) A) CamarasaHughes B) Camarasa/DuffyRedmond/Valery(-4) C) Camarasa/DuffyH\xc3\xb8jbjerg/Kola(-4)"
114: b'Just started following @ foomnianalytics - a helpful resource allowing comparisons between players and player combinations. Recommended! Enjoy. # GW35 # FPL'
115: b'Arsenal confirm that Aaron Ramsey (hamstring) will miss Sunday\xe2\x80\x99s match and will be assessed over the coming days. Granit Xhaka (hip) and Denis Suarez (groin) are being assessed ahead of the visit of Crystal Palace, while Sokratis is suspended. # FFScout # FPL # GW35 # DGW35'
116: b'Player Status Change Schlupp DF CRY 4.5 # FPL # GW35 http://www.fpl247.com'
117: b'Live press conference round-up starting at 2.45pm BST. @ DavidMunday815 and @ SkontoRigga bring you the latest injury news from the pre-match pressers happening across the country. https://www.youtube.com/channel/UCKxYKQ8pgJ7V8wwh4hLsSXQ/live \xe2\x80\xa6 # FFScout # FPL # GW35 # DGW35'
118: b'If you had \xc2\xa322.8m in the bank, how would you spend it? # FPL # GW35'
119: b'# FPL # GW35 team \xe2\x98\x86 Bench boost active \xe2\x98\x86 Deeney & Duffy Wilson & Bednarek \xe2\x98\x86 Sterling captain \xe2\x98\x86 Rank: 2,998 \xe2\x98\x86 TV: \xc2\xa3107.9 pic.twitter.com/xy4EnFFv0N'
120: b'Roy Hodgson on Jeffrey Schlupp: "He won\'t play again this season, the ankle injury is such that it will take the three or so weeks we have left (to heal)." # FFScout # FPL # GW35 # DGW35 # CPFC'
121: b'Player Status Change Chamberlain MF LIV 6.4 # FPL # GW35 http://www.fpl247.com'
122: b'Predicted to rise soon: Redmond Sterling Foster Aguero Get them in quick! # FPLCommunity # FPL # GW35 pic.twitter.com/0xMm2JQcz8'
123: b'Mkhitaryan selected by 5.1% is he worth a punt for the dgw? # Fpl # GW35'
124: b'Guardiola: "We\'ll see today how the people recovered, mentally and physically. After we will make a decision tonight because tomorrow morning we play early on. We\'ll see, in terms of selection." # FFScout # FPL # GW35 # DGW35 # MCFC'
125: b'Pep Guardiola on whether Oleksandr Zinchenko could be fit to return: "Yesterday he makes part of the training, yeah." # FFScout # FPL # GW35 # DGW35 # MCFC'
126: b'137 point lead going into this Gameweek... have I got it wrapped up? # fpl # GW35'
127: b'Final # FPL team for # GW35. Feeling really comfortable with this team, brought in Doucoure and Son for a -4 hut. Captaining Jimmy with two home games # FPLCommmunitypic.twitter.com/9iFNoGLGJG'
128: b'# GW35 Captain is proper stumping me, someone help # FPL'
129: b'Warnock on Aron Gunnarsson: "Gunnars had a spasm in his back but I think that\'s just old age! He\'ll be alright, I think." # FFScout # FPL # GW35 # DGW35 # CCFC'
130: b'Neil Warnock on whether Harry Arter will be fit to feature on Sunday: "I wouldn\'t have thought so, no. He\'s touch and go for the Fulham game, that\'s what the physio told me." # FFScout # FPL # GW35 # DGW35 # CCFC'
131: b'A straight swap, price wise, for Deeney, with 9 goals, 5 assist and 18BPS for the season so far. His stats show has 69 attempts on goal vs 52 of Deeney in 500 less minutes, proving he\xe2\x80\x99s more than capable of replacing the Watford man. # FPL # GW35 # FPLCommunitypic.twitter.com/o9mmDEagah'
132: b'Klopp: "Dejan was ill, so he should be available again. We will see that. Heard nothing after the Porto game. Nothing real serious, should be OK. They should be all in." # FFScout # FPL # GW35 # DGW35 # LiverpoolFC # LFC'
133: b'Klopp: "Joe [Gomez] looked good [on Wednesday]. Whether he will start, we will see. We have a lot of players with a lot of rhythm but it\'s good to have him." # FFScout # FPL # GW35 # DGW35 # LiverpoolFC # LFC'
134: b'NEW POST - fantasy premier league captain tips # GW35 \xe2\x80\x93 captain options analysed plus transfer poll results We look at fixtures, bookies odds, the polls, the FFGeek contributors picks and a load of stats https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-captain-tips-gw35-transfers/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fantasypl # DGW35pic.twitter.com/pO7sb2ADc9'
135: b'Jurgen Klopp: "We are not tired. We recover, training is a lower intensity at the moment because we cannot do a lot. But we don\'t have to do a lot, the most important sessions of the week are the games we play." # FFScout # FPL # GW35 # DGW35 # LiverpoolFC # LFC'
136: b'Who would you rather have in your # fpl team for # gw35'
137: b'Worth a hit? Totally expect Vardy to troll if I do this... # fpl # gw35 pic.twitter.com/4dCN3lcLXy'
138: b'A Double Gameweek 35 special of our stats-based Big Numbers piece. We present the stand-out statistics concerning: Goalkeepers Defenders Midfielders Forwards Teams https://www.fantasyfootballscout.co.uk/2019/04/19/fpl-double-gameweek-35-an-analysis-of-the-key-underlying-stats/ \xe2\x80\xa6 # FPL # GW35 # DGW35'
139: b"Don't forget you can sign up for free on our website, and have you # FPL team evaluated ahead of # GW35! https://www.foomnianalytics.com/signup.php"
140: b'@ OfficialFPL @ FFScout help needed! Should I transfer out Lukaku and Eriksen for Laca and De Bruyne for 8 pt hit? Current team below. Already transferred out Dunk to Cathcart # FPLCommunity # FPL # gw35 # FantasyPL # fantasypremierleaguepic.twitter.com/QuYvqkA6eO'
141: b'Huddersfield Town By @ denny_ledger # FPL # HTAFC # GW35 # DGW35pic.twitter.com/lSY0h0XFVJ'
142: b'Camarasa > Hojdberg for -4? # FPL # GW35 # FPLCommunity'
143: b'Captain guys??? # GW35 # FPL'
144: b'This is one of the most commonly asked questions on our website, and Algo prefers Hughes. In which camp are you? # GW35 # FPL'
145: b'GIORNATA DI # PremierLeague DOUBLE GAMEWEEK I nostri consigli al # FantasyPremierLeague su: chi acquistare chi vendere Scoprili qui # Fantacalcio # FPL # FPLCommunity # GW35 # DGW35 # fantasyfootballhttp://www.wikifanta.it/fantasy-premier-league-35a-giornata-consigli-per-gli-acquisti.html/ \xe2\x80\xa6'
146: b"# FPL POWER RANKINGS - # GW35 Here is a short 5min video to hopefully offer some transfer advice ahead of Double Gameweek 35. # DGW35 All RT's are very appreciated. I'd very much like as many of the # FPLCommunity to see it as possible. https://www.youtube.com/watch?v=4DV5bx7YW00 \xe2\x80\xa6"
147: b'Player Status Change Hazard MF CHE 11.0 Herrera MF MUN 5.0 # FPL # GW35 http://www.fpl247.com'
148: b'# DGW35 fixture analysis: Bench boosts, free hits, TCs & Deeney replacements # FPL @ StatOnScout @ FPLFairy @ FplFraud @ FanDocUnited @ Reuser5 @ FplOpinion @ TheFPLPrince @ fpl_tactician +more # GW35 # FantasyPL TY to all tagged # FPLCommunity https://www.thestatszone.com/fpl-double-gameweek-35-fixture-analysis-free-hits-triple-captains-bench-boosts-and-deeney-replacements-18-19 \xe2\x80\xa6pic.twitter.com/8Cb4zwqogS'
149: b'Solskjaer: "Ander is back in training, he\xe2\x80\x99s been working really hard. Eric will be back in training over the weekend, Antonio we\xe2\x80\x99re not sure about yet. Nemanja and Alexis had a good session yesterday as well, so they will probably be involved." # FFScout # FPL # GW35 # DGW35'
150: b'Maurizio Sarri on Eden Hazard\'s knock: "No, nothing serious I hope and I think. It\'s only a knock, it\'s only a strong knock. I think that we can recover him for the next match on Monday." # FFScout # FPL # GW35 # DGW35 # ChelseaFC'
151: b'Player Status Change Fosu-Mensah DF FUL 4.5 # FPL # GW35 http://www.fpl247.com'
152: b'Here is our current bench boost team for # GW35 \xc2\xa30.5m ITB 1 FT What transfers would you recommend? # FPL # FPLCommunity # Deeneypic.twitter.com/6J9VmMWfiq'
153: b"Breakout Picks # GW35 The latest @ FFScout Hot Topic asks: 1. Who will find form this week? 1. Seen something in the stats? 3. Who's ready for a breakout performance? Who in your side is the biggest # FPL differential? # FantasyPL https://www.fantasyfootballscout.co.uk/2019/04/19/captain-sensible-no-leading-option-for-double-gameweek-35/?hc_page=11&hc_sort_by=comment_date#hc_comment_20244844 \xe2\x80\xa6"
154: b'Eddie Howe on Bournemouth\'s team news: "Pretty much as we were, I don\'t think we\'ve got any major differences from last week. We still have a lot of players out on a long-term list but no great changes." # FFScout # FPL # GW35 # DGW35 # afcb'
155: b'Fulham have confirmed that Timothy Fosu-Mensah is set to undergo knee ligament surgery. # FFScout # FPL # GW35 # DGW35 # FulhamFC'
156: b'Gerard Deulofeu - Any news regarding his injury? # FPL # Gw35 # FantasyPL @ FPLhyena @ FPLUpdates_Tips @ OfficialFPL # FPLCommunity'
157: b'Which do you prefer? Bench Boost active. # GW35 # FPL'
158: b'Overall points 2,095 rank 8,021 I have taken the 3rd hit (-4) of the season. Deeney Wilson Duffy Kiko Femenia Had to get some cash for Deeney to WIlson upgrade so Duffy had to go. Bench Boost Active! Captain Jimenez NOT locked in! Good luck all! # FPL # GW35 # DGW35pic.twitter.com/8UmN4cKkdt'
159: b'We made some tweaks to Algo last night in order to get more balanced projections, so be prepared to our final squad for # GW35 this afternoon after pressers # FPL'
160: b'Captain for # GW35 # FPL'
161: b"Vardy's fixtures start to turn after # GW35, so should owners sell this week? Check out @ LetsTalkSoccer2 and our thoughts http://www.footballadvice.co.uk/gw35-fpl-question-and-answer/ \xe2\x80\xa6 # FPL # FPLCommunity # Vardy"
162: b'Deulofeu???? What we doing fellow owners? I got him on WC due to Gracia saying he was fit, now his comments leave me none the less in the know... Keep? Find alternative? # fpl # FPLCommunity # GW35'
163: b'TC Aguero in GW32 fetched me - 30 points FH GW33 fetched me - 85 points What do you think my BB in # GW35 will fetch me? Anything above 15/20 points will be wild! # FPL # FPLCommmunitypic.twitter.com/io6nCMfRmI'
164: b'NEW POST - Rob Reid with his fantasy premier league GW35 player picks Rob @ Thefpl_vet has finished 3 of the last 4 seasons in the top 0.5% of FPL managers https://www.fantasyfootballgeek.co.uk/rob-fantasy-premier-league-gw35-player-picks/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW35 # DGW35 # wildcardpic.twitter.com/pGF5lKJ9ig'
165: b'This time I have computed the combined probability of scoring 4 or more in both matches (p1*p2) based on the model output so that it will be easy to pick players without much ado. These are the list of players who have a combined probability of at least 10%. # GW35 # FPL pic.twitter.com/YN6mg5j6lU'
166: b"Who's your GW35 captain? # FPL # BenchBoost # fantasyfootball # GW35"
167: b'# Spurs to make their move for 11-goal striker and \xc2\xa320million rated defender # COYG # Bonuscodes # UCL # MCITOT # PremierLeague # FPL # FPLCommunity # gw35 https://www.shoot.co.uk/tottenham-hotspur-line-up-double-deal-for-striker-maxi-gomez-and-defender-luiz-felipe/?utm_source=feedburner&utm_medium=feed&utm_campaign=Feed%3A+co%2FJuds+%28Shoot%29 \xe2\x80\xa6'
168: b'Most Transferred out Today 1) Vardy FW LEI 9.1 6412 2) Hazard MF CHE 11.0 3629 3) Deeney FW WAT 5.9 3242 4) Murray FW BHA 6.4 2288 5) Maddison MF LEI 6.8 2254 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
169: b'Most Transferred in Today 1) Lucas Moura MF TOT 6.8 4254 2) Son MF TOT 8.8 4215 3) Jim\xc3\xa9nez FW WOL 6.9 4200 4) Sterling MF MCI 11.5 3632 5) Gray FW WAT 5.9 3444 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
170: b'Overnight price fallers Batshuayi FW CRY 6.4 King FW BOU 6.5 Richarlison MF EVE 6.4 Sigurdsson MF EVE 7.3 Steele GK BHA 3.9 Zaha FW CRY 6.8 Higua\xc3\xadn FW CHE 9.1 # FPL # GW35 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
171: b'Overnight price risers Wilson FW BOU 6.7 # FPL # GW35 http://www.fpl247.com/player/price/weekly?change=rise \xe2\x80\xa6'
172: b'Overnight players unavailable Ramsey MF ARS 7.1 Chicharito FW WHU 6.1 McCarthy GK SOU 4.3 Winks MF TOT 5.5 Vestergaard DF SOU 4.6 Austin FW SOU 5.5 Grant FW HUD 5.0 Targett DF SOU 4.2 # FPL # GW35 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
173: b'Overnight players available Billing MF HUD 4.5 Ayit\xc3\xa9 MF FUL 4.3 Schneiderlin MF EVE 4.2 # FPL # GW35 http://www.fpl247.com/player/returning \xe2\x80\xa6'
174: b'GW 35 One FT used Barnes out, Jimenez in Triple Captain (!) No hits Slightly regretting not having Son Or KDB, but they\xe2\x80\x99re not worth a hit given my midfield\xe2\x80\x99s favourable fixtures Turning Mexican for the weekend. I\xe2\x80\x99ve always loved burritos # fpl # Gw35 pic.twitter.com/Cj6WdpK5YD'
175: b'http://YOUTUBE.COM/ELITEFPLPODCAST # fpl # fantasyfootball # dgw35 # gw35 # FPLCommunity # ffscout # FantasyPL # premierleague # premiership # englishpremier # epl # youtube # podcastpic.twitter.com/i8r1QNPBaE'
176: b'Have put the model to run for # GW35 Will be posting results for all the players with double game week, who cross the threshold for at least one of their fixtures. # MachineLearning # FPL'
177: b"New 'Kitchen Table' Pod Brandon previews many of the big # GW35 dilemmas including: Brighton defender panic, Bench Boost indecision, and so many captain candidates! Become a supporter to access exclusive KTS podcast episodes. # FPL # hailcheatershttps://www.patreon.com/posts/kitchen-table-14-26209412 \xe2\x80\xa6"
178: b'Who to get in the team for # GW35 ??? # FPL'
179: b'Dunk Bednarek Deeney ITB 6.3m Can\xe2\x80\x99t decide on a 3rd striker to replace Deeney # DGW35 # GW35 # FPL'
180: b'Should I? -28 and use BB plus lineup better future matchups? Or is there hope in current team? # FPL # aguero # gw35 # fpltips # premierleaguepic.twitter.com/tLY0uG1EEu'
181: b'Price Changes (4/19/2019) Risers: Wilson \xc2\xa36.7m Fallers: King \xc2\xa36.5m Steele \xc2\xa33.9m Higua\xc3\xadn \xc2\xa39.1m Zaha \xc2\xa36.8m Batshuayi \xc2\xa36.4m Sigurdsson \xc2\xa37.3m Richarlison \xc2\xa36.4m # FPL # GW35 # FPL_Price'
182: b'FPL OFFICIAL Price Changes (4/19/2019) Overnight Risers: Wilson \xc2\xa36.7m Overnight Fallers: King \xc2\xa36.5m Steele \xc2\xa33.9m Higua\xc3\xadn \xc2\xa39.1m Zaha \xc2\xa36.8m Batshuayi \xc2\xa36.4m Sigurdsson \xc2\xa37.3m Richarlison \xc2\xa36.4m # FPL # GW35 # FPL_PriceChanges # Aye'
183: b"Don't miss this week's deadline!! # FPL # GW35"
184: b'# GW35 # fpl # FPLCommunity # FantasyPL LOCKED...Redmond armband puntpic.twitter.com/h95LdboUUx'
185: b'Emery: "It\xe2\x80\x99s very important now for the players to have some rotation because some players are injured and after the match today we need different players with a new energy. Some of the players after the match today maybe cannot play on Sunday." # FFScout # FPL # GW35 # DGW35'
186: b'Unai Emery on Aaron Ramsey: "He was in a very good moment, he was with a big behaviour and commitment to do something important. His injury today can give us some matches without him. I don\xe2\x80\x99t know [if he\'ll return before the end of the season].\xe2\x80\x9d # FFScout # FPL # GW35 # DGW35'
187: b'Player Status Change Ramsey MF ARS 7.1 Torreira MF ARS 4.7 # FPL # GW35 http://www.fpl247.com'
188: b"We'd like to apologise to Aaron Ramsey for tipping him to have a glorious end to the season. Any Premier League players who may be reading; We accept cash bribes to never mention your name. https://the4pointhit.wordpress.com/2019/04/18/fantasy-forecast-gameweek-35/ \xe2\x80\xa6 # FPL # FPLCommunity # GW35 # DGW35 # FantasyPL # FantasyLeague"
189: b'Whenever anyone talks about budget Watford defense, they bring up Cathcart or even Masina. Isn\xe2\x80\x99t Kiko Femen\xc3\xada a better pick? Or am I missing something? # FPL # FPLcommunity # GW35 pic.twitter.com/Tlgs4qntuc'
190: b"Looking at getting a Man City defender in this week. Really like Walker. Have this feeling Laporte will be rotated in one of the games, and Walker doesn't really have much competition at the minute. # FPL # DGW35 # GW35"
191: b"If you gain great pleasure from playing fantasy football, then you're a lucky, lucky soul. Here's the other side of that painful coin: https://the4pointhit.wordpress.com/2019/04/18/fantasy-forecast-gameweek-35/ \xe2\x80\xa6 # FPL # FPLCommunity # GW35 # DGW35 # FantasyPL # fantasypremierleague # FantasyLeague"
192: b'Locked in for # GW35 30 players hopefully # benchboost # FPL pic.twitter.com/EdskOE1OfK'
193: b'Looking for a cheapish midfielder for # GW35/ # DGW35...thoughts or other ideas? # FPL'
194: b'"I\xe2\x80\x99m not angry. I\xe2\x80\x99m not even disappointed. I\xe2\x80\x99d just like to know what crime I committed so maybe I can do some community service instead, or even hard time. Anything but this endless torture." https://the4pointhit.wordpress.com/2019/04/18/fantasy-forecast-gameweek-35/ \xe2\x80\xa6 # FPL # FPLCommunity # GW35 # DGW35 # PremierLeague'
195: b'# GW35 pick Trippier rotation risk? Trent nailed? # FPL'
196: b'Milivojevic is also not doing too bad against Arsenal # GW35 # FPL pic.twitter.com/YNufiKqAZP'
197: b'What do you think of this stat guys? # GW35 # FPL pic.twitter.com/KLlyBcYYTV'
198: b'Who are the most compared pair of players on our comparison tool, ahead of # GW35? # FPL # DGW35'
199: b'Who to captain for Double Gameweek 35 ? *Main Picks* # DGW35 # GW35 # FPL'
200: b'Banker Jimenez Blanker Smalling # FPL # GW35 # FPLCommmunityhttps://twitter.com/FPLCrypto/status/1118944066400444416 \xe2\x80\xa6'
201: b'Week 35 Official FPL Player Picks # FPL # gw35 https://www.nevermanagealone.com/2019/4/18/18484875/epl-gw-35-official-fpl-player-picks?utm_campaign=2cents81&utm_content=chorus&utm_medium=social&utm_source=twitter \xe2\x80\xa6'
202: b'(1) Banker V Blanker (Gameweek 35) *DIGITAL CASH PRIZE IF THERE ARE OVER ENTRIES SO PLEASE RT AND SHARE * REPLY to enter! NB: Player MUST START(both games for DGW) or entry is void! Score = Points minus Points # fpl # gw35 # FPLCommunitypic.twitter.com/4ugxmS9nv4'
203: b'Burnley By @ ClaretFpl # FPL # BurnleyFC # twitterclarets # GW35 # DGW35pic.twitter.com/WuGh95SRj6'
204: b'GW35 Review/Preview Thread # FPL # GW35 # DGW35'
205: b'Player Status Change Ayit\xc3\xa9 MF FUL 4.3 Zambo Anguissa MF FUL 4.4 # FPL # GW35 http://www.fpl247.com'
206: b'Pre- # GW35 stats. 1. Shots Inside Box 2. Goal Attempt Assists / Chances Created 3. Goal Attempts Conceded Inside Box 4. Big Chances Conceded # FPL pic.twitter.com/p5vZoVa1ud'
207: b'# LEGIONSOFPOOM # GW35 Top ropes - Lucas / Dings Count outs - Mads / Barnes Ringleader - Agueroplane OR - 166k # FPL pic.twitter.com/Z9XWwdAorc'
208: b'Chelsea XI to face Slavia Prague: Kepa; Azpilicueta, Luiz, Christensen, Emerson; Kante, Kovacic, Barkley; Pedro, Giroud, Hazard. # FFScout # FPL # GW35 # DGW35 # ChelseaFC # CHESLA'
209: b'Arsenal XI to face Napoli: Cech; Sokratis, Koscielny, Monreal; Maitland-Niles, Torreira, Xhaka, Kolasinac; Ramsey; Aubameyang, Lacazette. # FFScout # FPL # GW35 # DGW35 # ArsenalFC # NAPARS'
210: b'My captain in Double # GW35 is ____________. \xe2\x80\xa2\xe2\x80\xa2\xe2\x80\xa2 # premierleague # fantasypremierleague # fplcommunity # fantasypl # fpl # fantasyfootball # football # soccer # futbol # liverpool # manchesterunited\xe2\x80\xa6 https://www.instagram.com/p/BwZ9qo7BLTu/?utm_source=ig_twitter_share&igshid=u4kjg3tbm828 \xe2\x80\xa6'
211: b'Parker: "Bettinelli is progressing well. Alfie Mawson still needs a little bit of time, in terms of training time, but certainly, he\xe2\x80\x99s edging closer." # FFScout # FPL # GW35 # DGW35 # FulhamFC'
212: b'# GW35 # FPL I do think @ ManCity will win against Spurs and might be an idea to get 3 city assets before GW.'
213: b'Player Status Change Schneiderlin MF EVE 4.2 Dier MF TOT 4.7 Winks MF TOT 5.5 Arnautovic FW WHU 6.8 Pe\xc3\xb1aranda FW WAT 5.0 # FPL # GW35 http://www.fpl247.com'
214: b'# FPL Gameweek 35 # GW35 Preview: https://www.fiso.co.uk/fpl-season-2018-19-gameweek-35-preview/ \xe2\x80\xa6'
215: b'NEW POST - fantasy premier league DGW35 \xe2\x80\x93 the FFGeek imaginary wildcard https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-wildcard-tips-dgw35-imaginary/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fantasypl # GW35 # DGW35 # wildcard # eplfantasy # fplMY # fplupdates # fplislife # fantasypremierleagueislife # FPLus # fpltreview # fplwildcardpic.twitter.com/mGT1bO5RMP'
216: b'Pochettino on whether Eric Dier could return v Man City: "He has still not joined the team. Maybe tomorrow he can train with the team and then we need to assess whether it is OK for him to be part of the squad." # FFScout # FPL # GW35 # DGW35 # THFC'
217: b'Pochettino on whether Harry Winks could return v Brighton: "We don\'t know, we need to assess him tomorrow. Again today and tomorrow, we will see." # FFScout # FPL # GW35 # DGW35 # THFC'
218: b'Pochettino on Son being banned for the Champions League semi-final first leg: "Of course, that is going to be sure that if he is OK, he is going to play [in the league] because for the first leg of the Champions League he is going to be suspended." # FFScout # FPL # GW35 # DGW35'
219: b'No cell signal. Weak hotel wifi. My # FPL # GW35 transfers in risk. But what a landscape!!!! pic.twitter.com/sOK8GNGQ0G'
220: b"Sterling or Vardy for # GW35? Considering Sterling's rotation risk/worse fixtures # FPL # FPLCommunity @ OfficialFPL"
221: b'GW 35 INSIDER TOP TIP A++++++ Captain options in following order, courtesy of insider at @ FootballAssoc: - STERLING - DUFFY - PAULY POGBA # MuellerReport # mueller # fpl # gw35'
222: b'Pochettino on Moussa Sissoko: "We need to assess him tomorrow. We\xe2\x80\x99re not optimistic but today or tomorrow we are going to have a better idea." # FFScout # FPL # GW35 # DGW35 # THFC'
223: b'Pochettino: "That is the most important now thinking to try to take the best decision to try to help the team and to provide the team with good energy to be possible to fight and challenge for the three points." # FFScout # FPL # GW35 # DGW35 # THFC'
224: b'Mauricio Pochettino: "We need to assess the players, we need to assess some players that cannot be possible to play. Some small issues that maybe makes it not possible for some players to play on Saturday again." # FFScout # FPL # GW35 # DGW35 # THFC'
225: b'Calvert-Lewin has been quietly been going about his business under the radar. Since GW28, DCL has played 70mins+ each GW, with returns in 4/7 of those GWs Only 1.9% selected, and now a starter, he offers excellent value as a replacement for Deeney. # FPL # GW35 # FPLCommunitypic.twitter.com/3HCZ94zT7u'
226: b'Gracia on Troy Deeney\'s red card and suspension: "For me, it\xe2\x80\x99s not a red card and the club appealed but I think we\xe2\x80\x99ve lost. We have to play the next games without Troy, we have to be ready to compete without him." # FFScout # FPL # GW35 # DGW35 # WatfordFC'
227: b"With regards Masina. Few times I've been round that track. So it's not just gonna happen like that. Because he ain't no Holebas, girl. He ain't no Holebas, girl. # FPL # GW35 # HUDWAT"
228: b'Gracia on Gerard Deulofeu and Roberto Pereyra: "Both today trained with the team and we\xe2\x80\x99ll see tomorrow how they are to play. We\xe2\x80\x99ll decide tomorrow. They are training well but... I prefer to wait for tomorrow, to take the best decision." # FFScout # FPL # GW35 # DGW35 # WatfordFC'
229: b'Javi Gracia: "In this moment, we have Jose Holebas, Tom Cleverley, Domingos Quina and Penaranda. All of them are out of the team." # FFScout # FPL # GW35 # DGW35 # WatfordFC'
230: b'It\xe2\x80\x99s tempting. There\xe2\x80\x99s a lack of outstanding candidates. Think I\xe2\x80\x99m going for Jimenez # FPL # GW35'
231: b'@ OfficialFPL is it deadline for # FPL # GW35 already? pic.twitter.com/UWIo8qRG19'
232: b'My only wish with the # FPL site down: "Due to the massive DDos attack, we had to revert to our backup server and unfortunately we only manage to load up to GW33. To compensate, we offer every team the average score for GW34 and an extra wildcard for # GW35." # FPLCommunity'
233: b'Most Transferred out Today 1) Vardy FW LEI 9.1 20342 2) Hazard MF CHE 11.0 12346 3) Deeney FW WAT 5.9 10725 4) Maddison MF LEI 6.8 7824 5) Murray FW BHA 6.4 7694 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
234: b'Most Transferred in Today 1) Son MF TOT 8.8 15665 2) Jim\xc3\xa9nez FW WOL 6.9 13872 3) Lucas Moura MF TOT 6.8 13495 4) Sterling MF MCI 11.5 13494 5) Gray FW WAT 5.9 12358 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
235: b"Deeney's red card ruined your # GW35 plans? Check out our thoughts on the best replacements http://www.footballadvice.co.uk/gw35-fpl-question-and-answer/ \xe2\x80\xa6 # FPL # FPLCommunity # deeney"
236: b'Deeney replacement...? # FPL # FPLCommunity # GW35 # BenchBoost'
237: b"Don't forget that you can sign up at our website and get tailored advice for your team! # FPL # GW35 https://www.foomnianalytics.com/signup.php"
238: b'Pellegrini: "I think that Manuel Lanzini and Samir Nasri will not be available because of injury. Also, Javier Hernandez has a problem in his ear, so he couldn\'t work these last days. Marko works as normal the whole week." # FFScout # FPL # GW35 # DGW35 # WHUFC'
239: b'GW35 Thoughts We could see the best of Brighton over the next 2 fixtures or this could be the end of their PL run pushing them into relegation zone. I think they will bounce back. # FPL # GW35 pic.twitter.com/LWQHnFQfbI'
240: b'Lucas Moura is at the moment the most transferred in player in # GW35 # FPL pic.twitter.com/JNAEUFxW48'
241: b'Marco Silva on Everton\'s team news: "Just Yerry Mina is out [injured]. He\'s doing individual work, possible next week he will start full training with us." Andre Gomes begins a three-match ban. # FFScout # FPL # GW35 # DGW35 # EvertonFC'
242: b'Player Status Change Billing MF HUD 4.5 Sabiri MF HUD 4.3 Depoitre FW HUD 5.1 Grant FW HUD 5.0 # FPL # GW35 http://www.fpl247.com'
243: b'Deeney to... # FPL # GW35 # FantasyFootball # benchboost'
244: b"Siewert confirms that Philip Billing is fit and available but that he won't be considering Abdelhamid Sabiri for selection. # FFScout # FPL # GW35 # DGW35 # htafc"
245: b'Siewert: "Isaac is better and he could be back. Karlan has been ill, he had been weak. Today he trained a bit, I\'ll have to look if it is possible with him." # FFScout # FPL # GW35 # DGW35 # htafc'
246: b"Postaram si\xc4\x99 obejrze\xc4\x87 dzisiejsze # NAPARS, i zadecyduje czy b\xc4\x99d\xc4\x99 jecha\xc4\x87 do ko\xc5\x84ca sezonu z Kol\xc4\x85 na obronie lub te\xc5\xbc zachowam FT i w 36 kolejce wezm\xc4\x99 PvA i kogo\xc5\x9b do 4.1 ba\xc5\x84ki za Braci Brightoniec. Chcia\xc5\x82bym jakiego\xc5\x9b Laporte'a, ale braknie jakie\xc5\x9b 0.5 # FPL # jakgractoznajlepszymi # GW35 pic.twitter.com/w3bbxp4ejS"
247: b"Who's excited about a Thursday link drop? Everybody? Good. This week's pod: https://soundcloud.com/alwayscheating/ep-169-awesome-players-for-awesome-fixtures-gw34-35 \xe2\x80\xa6 New Patreon pod drops tonight with @ bskbroiler. Patrons, send in your Q's. Vote for Always Cheating in @ TheFBAs - only a couple of days left! https://footballbloggingawards.co.uk/vote-now/ # FPL # GW35"
248: b'None of the players who started in UCL pictured here # fpl # gw35 https://twitter.com/ManCity/status/1118883128288796672 \xe2\x80\xa6'
249: b"Definitely doing Hazard to Sterling this gameweek (don't want to lose Haz but no better way of getting Sterling) Also considering a -4 for Ryan to Foster (Bench boosting this week too) # FPL # GW35 # FPLCommunity"
250: b'Uncharacteristic performance last night - personally a little worried he misses out this weekend as an owner. # GW35 # FPL https://twitter.com/OptaJean/status/1118798006646648834 \xe2\x80\xa6'
251: b'Rodgers on Marc Albrighton: "I don\xe2\x80\x99t think he\'s ready for 90 minutes. It just depends on whether you want him to be starting a game and play 60/65 or come into the game like he did against Newcastle. He\xe2\x80\x99s another week or so further on in his fitness." # FFScout # FPL # GW35'
252: b"Brendan Rodgers didn't report any fresh injury news in his pre-match presser on Thursday. # FFScout # FPL # GW35 # DGW35 # LCFC"
253: b'Really wish I could have 7 mids and just 1 forward in my squad right now... # FPL # GW35'
254: b'Check out who tops our # FPL Power Index ahead of # GW35! pic.twitter.com/geo43HWpyq'
255: b"Dyche also confirms that Steven Defour won't feature again this season. # FFScout # FPL # GW35 # DGW35 # twitterclarets"
256: b'Dyche: "We\'re waiting on Phil Bardsley. We\'ll make a decision on that the next couple of days. Aaron Lennon\'s doing well, not there yet but he\'s more and more active. Crouchy is back on the move but not quite there yet." # FFScout # FPL # GW35 # DGW35 # twitterclarets'
257: b'Took a punt bringing Rashford in for Carry, leaves me with 2.0 ITB to upgrade someone else if needed # FPL # GW35 # DGW35pic.twitter.com/rkvJ5ypks4'
258: b'Some interesting tactical tweaks from Jurgen Klopp last night involving Sadio Mane, Mohamed Salah and Roberto Firmino https://www.fantasyfootballscout.co.uk/2019/04/18/liverpool-to-face-barca-five-days-after-gw36-match-with-huddersfield/ \xe2\x80\xa6 # FPL # GW35 # DGW35 # LiverpoolFC'
259: b'Who should I captain in # GW35 # FPL # Gameweek35 ?'
260: b'Do you guys need any advice for # GW35? # FPL'
261: b'Thinking of Deeney, Duffy, Laporte, Jota out De bruyne, Long, Jonny, Yoshida in for -12. Bench boosting. Am I mad? # GW35 # FPL pic.twitter.com/CukSWVFe4a'
262: b'Podcast Alert Episode 36 has dropped! Is there anything worse than a red arrow when you\xe2\x80\x99ve just played your wildcard? That\xe2\x80\x99s where Ger and I have both found ourselves after a poor GW34. Never mind all that though, double # GW35 is here! # FPL https://soundcloud.com/user-768411468/fplhangoverep36 \xe2\x80\xa6'
263: b'The best duo for # GW35 ? Pick a pair! # FPL # DGW35'
264: b'Rafael Benitez confirms that he has a fully fit squad apart from Sean Longstaff and Florian Lejeune. # FFScout # FPL # GW35 # DGW35 # NUFC'
265: b"Chris Hughton confirms that Brighton have no new injury concerns ahead of the weekend's match at Wolves. # FFScout # FPL # GW35 # DGW35 # BHAFC"
266: b"Sean Dyche confirms that Phil Bardsley is still a doubt for Monday's match at Chelsea. Peter Crouch is back in light training but will not be ready. # FFScout # FPL # GW35 # DGW35 # twitterclarets"
267: b'Player Status Change Lemina MF SOU 4.7 # FPL # GW35 http://www.fpl247.com'
268: b'First of our Deeney replacements is Perez. Three goals and an assist in his last 5GW has earned Perez a respectable 6ppg average. Selected by only 1.3% he represents a massive differential with a kind run of fixtures remaining for a strong finish. # FPL # GW35 # FPLCommunitypic.twitter.com/VhVmjArQhP'
269: b'# GW35 team Fell last week from 250K to 400K due to hits and a poor score of 49. No hits this time! Sterling might just be Captain for rest of the season. Deulofue is the only one still flagged but hoping he plays. Thoughts are most welcome! # FPL # FPLCommunitypic.twitter.com/jTBGDOBbZJ'
270: b'Jan Siewert says that Isaac Mbenza is "better" but Karlan Grant hasn\'t trained much this week because of illness. Laurent Depoitre is back in training but isn\xe2\x80\x99t an option this weekend. # FFScout # FPL # GW35 # DGW35 # htafc'
271: b'Scott Parker reveals that Timothy Fosu-Mensah (knee) is struggling to be fit for the weekend. # FFScout # FPL # GW35 # DGW35 # FulhamFC'
272: b'Latest video is up!! # FPL # GW35: The Fall of Troy (Team Review # GW34)https://youtu.be/21mFo-NxnU8'
273: b'Player Status Change McCarthy GK SOU 4.3 Austin FW SOU 5.5 Chicharito FW WHU 6.1 Targett DF SOU 4.2 Valery DF SOU 4.1 # FPL # GW35 http://www.fpl247.com'
274: b"With nothing to lose and no need to significantly rotate, here's how I expect Man City's attacking assets to perform the rest of the season. Load up, folks. # FPL # GW35 pic.twitter.com/JmvyeJXNbA"
275: b"Manuel Pellegrini thinks that Manuel Lanzini and Samir Nasri will not be available this weekend due to injury, while Javier Hernandez has a problem with his heel and hasn't trained for two days. Jack Wilshere and Carlos Sanchez have trained with the squad. # FFScout # FPL # GW35"
276: b'Hasenhuttl: "Yan Valery is OK. Michael Obafemi is not training with the group. Mario Lemina made a big step forward in the week. He\xe2\x80\x99s trained with the team and looks much better now. Maybe his injury time comes to an end." # FFScout # FPL # GW35 # DGW35 # SaintsFC'
277: b'# GW35 Q&A article We have teamed up with @ LetsTalkSoccer2 to tackle your questions Deeney replacements? Captaincy Picks Keep or sell Vardy? Single v double GW bench boost http://www.footballadvice.co.uk/gw35-fpl-question-and-answer/ \xe2\x80\xa6 # FPL # FPLCommunity # Deeney # vardy'
278: b'NEW POST - fantasy premier league GW35 \xe2\x80\x93 the fixture ease schedule We look for the teams with the best fixtures & give player suggestions plus stats to help you make your GW35 transfer choice https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-best-fixtures-gw35-fixture-ease/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fantasypl # GW35 # DGW35 # wildcardpic.twitter.com/Ggw3Dz1lz8'
279: b'Pricing: Salah is dropping and Redmond is rising. # FPL # FPLCommunity # GW35 pic.twitter.com/idkq8izdxC'
280: b'Kun 70mins in both? # fpl # GW35 https://twitter.com/FPL_vs/status/1118787052571713537 \xe2\x80\xa6'
281: b'# FPL # GW35 \xe2\x80\xa2 Bench Boost \xe2\x80\xa2 Squad Lock pic.twitter.com/TqSfMxiT6Y'
282: b'Best captain for # GW35 ? (Forget who you own) # FPL # fplcommunity'
283: b'\xc4\xb0s it worth moving Vardy to Laka this GW? # FPL # fplcommunity # GW35'
284: b'Przed # GW35 mam flashbacki z przesz\xc5\x82o\xc5\x9bci.5/6 dobrych na papierze opcji na C. Mo\xc5\xbce \xc5\x9bwie\xc5\xbcy jak poranna rosa Jimenez z 2 spoko spotkaniami u siebie,mo\xc5\xbce Son, cho\xc4\x87 z BHA mo\xc5\xbcliwy rest, mo\xc5\xbce Mane/Firmino na jedno s\xc5\x82abe Cardiff, a mo\xc5\xbce po prostu Kun. Easy. # FPL # jakgractoznajlepszymihttps://twitter.com/_yaser0_/status/1076898297741303809 \xe2\x80\xa6'
285: b'# GW35 Squad Preview Deeney replacements Captaincy picks Bench boost chat http://www.footballadvice.co.uk/bench-boost-gw35-fpl-squad-preview/ \xe2\x80\xa6 # FPL # FPLCommunity'
286: b'**GW35 Thread** In this thread I go through the best projected players in each position The best FPL Review captain choices based on xG + Odds are MCI trio Sterling, Aguero & KDB though all are rotation risks. Pogba, Auba & Eriksen offer more stable mins # FPL # FPLCommunity # GW35 pic.twitter.com/2TNmVshUoH'
287: b'Player Status Change Vestergaard DF SOU 4.6 # FPL # GW35 http://www.fpl247.com'
288: b'Positive update on Valery # FPL # GW35 # DGW35https://twitter.com/BenDinnery/status/1118808399314071554 \xe2\x80\xa6'
289: b'Ralph Hasenh\xc3\xbcttl says that defender Jannik Vestergaard is a doubt for the match against Newcastle on Saturday. # FFScout # FPL # GW35 # DGW35 # SaintsFC'
290: b'# FPL # FPLCommunity # GW35 # alwayscaptainaguerohttps://twitter.com/FPL_vs/status/1118787052571713537 \xe2\x80\xa6'
291: b'TAA.... Gomez came on for him last night in UCL, is Trent in danger of being benched for some games?? Could he rotate out of the squad for that Cardiff game? Thoughts? # fpl # FPLCommunity # GW35'
292: b'https://youtu.be/TJo6vmBeBUk # fpl # fantasyfootball # dgw35 # gw35 # ffscout # fplcommunity # FantasyPL # UCL # ManCityTottenham # MCITOT # Spurs # COYSpic.twitter.com/ceyHHu27qW'
293: b'# FPL # DoubleGameweek35 CAPTAIN PICKS is now online on the Polestar Football youtube channel. # PremierLeague # DGW35 # FPLCommunity # GW35 # Gameweek35 # FollowThePolestar Click here to watch https://youtu.be/Nz5Q7nBMKSY pic.twitter.com/Jeu5WhX8xJ'
294: b'DGW 35.. Who should I start out of the 3? # FPL # FPLCommunity # GW35'
295: b'NEW POST - Fantasy premier league GW35 captain poll \xe2\x80\x93 plus a transfer in and out poll and a what chip are you using poll https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-gw35-captain-poll-transfer/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW35 # DGW35 # fplcaptainpic.twitter.com/XqmSyik6Qd'
296: b'Most Transferred out Today 1) Vardy FW LEI 9.1 5644 2) Hazard MF CHE 11.0 3354 3) Deeney FW WAT 5.9 2819 4) Maddison MF LEI 6.8 2146 5) Sigurdsson MF EVE 7.4 2017 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
297: b'Most Transferred in Today 1) Son MF TOT 8.8 4671 2) Sterling MF MCI 11.5 3728 3) Lucas Moura MF TOT 6.8 3516 4) Jim\xc3\xa9nez FW WOL 6.9 3471 5) Ag\xc3\xbcero FW MCI 11.7 3086 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
298: b'Pilihan \xc2\xa9 yang tepat untuk # DGW35 # GW35 Kira-kira Siapa ? # FPL # PL Apakah ini pilihan Yanga teapt atau Mungkin ada pilihan lain ? @ mbah_FPL @ FPLCELEBES @ FplFraud @ BenDinnery @ KoFPLI @ SukaFPL @ BenCrellin @ panditfootball @ FPLCisewu @ OfficialFPL'
299: b'With five top 1k finishes between them, @ FFScout_Joe, @ FFScout_Paul @ ffscout_az and Peter Kouwenberg know their stuff. Here are the # FPL players they have each picked out for # GW35: https://www.fantasyfootballscout.co.uk/2019/04/18/the-scout-squad-for-fpl-double-gameweek-35/ \xe2\x80\xa6 # DGW35'
300: b'Overnight price fallers Fabianski GK WHU 4.7 Maddison MF LEI 6.8 Nasri MF WHU 4.9 Rond\xc3\xb3n FW NEW 5.9 Vardy FW LEI 9.1 # FPL # GW35 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
301: b'Overnight price risers Lucas Moura MF TOT 6.8 # FPL # GW35 http://www.fpl247.com/player/price/weekly?change=rise \xe2\x80\xa6'
302: b'Overnight players unavailable Sissoko MF TOT 4.9 Su\xc3\xa1rez MF ARS 5.7 # FPL # GW35 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
303: b'Overnight players available Alli MF TOT 8.8 # FPL # GW35 http://www.fpl247.com/player/returning \xe2\x80\xa6'
304: b'Fixture and form-based # FPL predictions for # GW35, # GW36 and # GW37https://fantasyfootballpredictions.uk'
305: b'What would you do with this lot? 1. Take a hit to have 14 DGW players + BB? If yes then who? 2. Only play 10 DGW players, keep BB for another week? Any moves needed? # FPL # FPLCommunity # GW35 pic.twitter.com/7wOmf9oIIY'
306: b'# FPL ~~! Gotta fit them all~~! # FPLCommunity # GW35 pic.twitter.com/TTUW9V0bLY'
307: b'Well,who deserves triple captain armband? # FPL # FPLCommunity # FantasyPL # football # GW35 @ FPLSecrets @ OfficialFPL Suggestions please # FPLMANGERS'
308: b'Eriksen (2 games) vs Mane/Salah (1 game & -4 pts) # FPL # FPLCommunity # GW35 Personally I think Eriksen can match them over 2 games. Seems silly to rush aboard the LIV train with multiple hits.'
309: b'Screw it? # FPL # FPLCommunity # GW35 pic.twitter.com/F0NhTXsSBP'
310: b"I reckon having Kun, Sterling, Eriksen & Son is good enough to cover their matches? I guess I couldn't have it all. Kinda gutted as my draft at a time had Kun, Sterling & KDB. My priority now is to bring back LIV attacking assets. Mane or Salah? # FPL # FPLCommunity # GW35"
311: b'Price Changes (4/18/2019) Risers: Lucas Moura \xc2\xa36.8m Fallers: Maddison \xc2\xa36.8m Vardy \xc2\xa39.1m Rond\xc3\xb3n \xc2\xa35.9m Fabianski \xc2\xa34.7m Nasri \xc2\xa34.9m # FPL # GW35 # FPL_Price'
312: b'FPL OFFICIAL Price Changes (4/18/2019) Overnight Risers: Lucas Moura \xc2\xa36.8m Overnight Fallers: Maddison \xc2\xa36.8m Vardy \xc2\xa39.1m Rond\xc3\xb3n \xc2\xa35.9m Fabianski \xc2\xa34.7m Nasri \xc2\xa34.9m # FPL # GW35 # FPL_PriceChanges # Aye'
313: b'Could be a simple -4 for me this week with the Deeney red card Deeney \xe2\x86\x92 Shane Long Duffy \xe2\x86\x92 TAA Or Deeney \xe2\x86\x92 Wilson Duffy \xe2\x86\x92 Bednarek # FPL # FPLCommunity # GW35'
314: b'Predicted Price Risers: Moura \xe2\x80\x93 Possibility 103,6% Predicted Price Fallers: Etheridge \xe2\x80\x93 Possibility 100,4% Fabianski \xe2\x80\x93 101% Vardy \xe2\x80\x93 102,2% Rondon \xe2\x80\x93 99,1% Barnes \xe2\x80\x93 97,4% # fpl # fplprice # fplupdate # GW35'
315: b'Now watch everyone blanks this weekend. # MCITOT It will just be typical of # FPL # GW35'
316: b'Zola on Rudiger: "There is a strong possibility that we will see him [in GW36], he is a warrior and does not want to miss a game like that. The next few days will be very important to see if he can continue to progress and recover so quickly." # FFScout # FPL # GW35 # DGW35'
317: b'Gianfranco Zola on Antonio Rudiger: "It looks not as bad as we thought. When he came off limping we were worried, but apparently, it is not that bad, plus he is a strong boy and he will be back sooner than you expect." # FFScout # FPL # GW35 # DGW35 # ChelseaFC'
318: b'129th EPISODE OF THE # FPL SURGERY PODCAST Our guest this week has 3 top 1k finishes and 6 top 20k finishes in # FPL, with the highest being 604th. Listen in as Bully, Iceman and @ fplguy1 prepare you for # GW35 # DGW35 https://soundcloud.com/fplsurgery/129thEpi \xe2\x80\xa6 # upthepod'
319: b'Player Status Change Sissoko MF TOT 4.9 # FPL # GW35 http://www.fpl247.com'
320: b'Aguero or Sterling or both (for a hit) # FPL # GW35......'
321: b'But the home win has paid off - @ SpursOfficial has knocked out @ ManCity from @ ChampionsLeague. Can Spurs beat Man City again later this week? # FPL # GW35'
322: b'Player Status Change Fernandinho MF MCI 5.3 Alli MF TOT 8.8 Llorente FW TOT 5.1 # FPL # GW35 http://www.fpl247.com'
323: b'What a game! And on an fpl note Son is banned from first leg so good for fpl teams (not that there\xe2\x80\x99s that much rotation up top now) # spurs # fpl # gw35'
324: b'When you realise you fell for the Brighton defense (Dunk & Duffy) in GW 34BIGGEST FRAUDS! # FPL # UCL # MCITOT # PORLIV # ManCity # MCFC # THFC # GW35 https://twitter.com/brfootball/status/1118623842161831937 \xe2\x80\xa6'
325: b'The symmetry # FPL # GW35 pic.twitter.com/gWSq29TIAa'
326: b'Who should I bring in for # GW35 ? Already on -4 # fpl @ FPL_Audit @ FPL_Connect @ myFPLcaptain @ FPLGeneralpic.twitter.com/mFZu1K6HHg'
327: b'Who do I captain in # gw35? # FPL'
328: b"Don't get your hopes high # fpl managers. Just because they've scored 5 in the first 20 minutes of a # UCL game, you can expect 1-1 draw on a Saturday with the couple of own goals. # GW35 # MCITOT"
329: b'Gomez back amongst the subs tonight. A small concern for TAA owners? # FPL # GW35 # DGW35https://twitter.com/LFC/status/1118570343398903810 \xe2\x80\xa6'
330: b'Liverpool XI to face Porto: Alisson, Alexander-Arnold, Matip, Van Dijk, Robertson, Fabinho, Milner, Wijnaldum, Man\xc3\xa9, Salah, Origi. # FFScout # FPL # GW35 # DGW35 # PORLIV'
331: b'Man City XI to face Spurs: Ederson, Walker, Kompany, Laporte, Mendy, Gundogan, Silva, De Bruyne, Bernardo, Sterling, Aguero. # FFScout # FPL # GW35 # DGW35 # MCITOT'
332: b'Spurs XI to face Man City: Lloris, Trippier, Alderweireld, Vertonghen, Rose, Wanyama, Sissoko, Eriksen, Alli, Lucas, Son. # FFScout # FPL # GW35 # DGW35 # MCITOT'
333: b'Does this mean Llorente starts in the DGW? # GW35 # FPL @ Frankwalsh82 @ fpl_phenom @ FPLCanuckhttps://twitter.com/SpursOfficial/status/1118575390539362304 \xe2\x80\xa6'
334: b'So, I see you\xe2\x80\x99re all worried about Brighton. You want my advice? Don\xe2\x80\x99t take points hits to get rid, they do, after all, still have two fixtures in # GW35. And who knows, maybe the closer they get to relegation the more they\xe2\x80\x99ll start ACTUALLY PLAYING FOOTBALL # FPL'
335: b'MY # FPL Double # Gameweek35 Preview Video is now # LIVE! https://youtu.be/8t0s5jqWUaU # Gameweek34 Review # Gameweek35 Preview Double # GW35 chat! # FantasyPremierLeague - Tips Feat. @ FantasyFootyFix Please Like & Subscribe'
336: b'Hello boiz, there\xe2\x80\x99s no podcast this week so you will be receiving some of The Hottest Takes from me direct to your timeline over the next couple of days. Brace yourselves... # FPL # GW35'
337: b'Running a little behind schedule this week on our picks and tips! For Ones to Watch this week we\xe2\x80\x99re going to go for swaps for that Deeney problem. First one will be around lunchtime tomorrow # FPL # FPLCommunity # GW35 pic.twitter.com/0OSztoqj21'
338: b"Southampton's form and fixtures Raul Jimenez's stats at home Bench boosting in GW35 vs GW36 We discuss it all here: https://www.fantasyfootballscout.co.uk/2019/04/17/digest/ \xe2\x80\xa6 # GW35 # DGW35 # FPL"
339: b'Most Transferred out Today 1) Vardy FW LEI 9.2 13365 2) Deeney FW WAT 5.9 11606 3) Hazard MF CHE 11.0 7304 4) Murray FW BHA 6.4 7004 5) Richarlison MF EVE 6.5 6280 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
340: b'Most Transferred in Today 1) Lucas Moura MF TOT 6.7 14258 2) Jim\xc3\xa9nez FW WOL 6.9 12498 3) Redmond MF SOU 5.3 10007 4) Aubameyang FW ARS 10.9 9967 5) Wilson FW BOU 6.6 9945 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
341: b'Just checked FPL & despite Swung from Moura to Son 4 point hit Ryan (c) Wilson 15 points as 12th man Still green arrow! Upto 38k Big decisions for GW35 # FPL # GW35'
342: b'UPDATED POST - fantasy premier league GW35 \xe2\x80\x93 analysing the teams of 10 top FPL managers - final article https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-transfer-tips-gw35-10-fpl-managers/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fantasypl # GW35 # DGW35 # wildcard # eplfantasy # fplMY # fplupdates # fplislife # fantasypremierleagueislife # FPLus # fpltreviewpic.twitter.com/s89VicySYa'
343: b'NEW POST - fantasy premier league GW35 \xe2\x80\x93 some early thoughts on the FFGeek team https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-teams-gw35-early-ffgeek/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fantasypl # GW35 # DGW35 # wildcardpic.twitter.com/iV2dEKJgFP'
344: b'Who will you captain in # GW35 ? # FPL # FPLCommunity @ FFScout_Joe @ FPLFamily @ ffscout_az @ 3AmigosFPL @ WGTA_FPL @ TheTinkerMen @ hailcheaters @ AlexScott @ FPLGeneral @ FPL_Audit @ Green_Windmill @ FPL_physio @ DavidMunday815 @ FplFreddo @ LetsTalk_FPL Share and retweet, please.'
345: b'Gameweek 34 Top Players # FPL # GW35 http://fpl247.com/page/356bde17-8396-466d-b97a-76d635de61f1 \xe2\x80\xa6'
346: b'Gameweek 34 Top Teams Transfer Analysis # FPL # GW35 http://fpl247.com/page/42647f76-22a1-4046-8ff9-22236277e893 \xe2\x80\xa6'
347: b'Gameweek 34 Top Teams Player Analysis # FPL # GW35 http://fpl247.com/page/6a95b8c7-ed43-4892-8975-519096638df8 \xe2\x80\xa6'
348: b'Gameweek 34 Top Teams Formation Analysis # FPL # GW35 http://fpl247.com/page/08f726b3-9d07-45ef-8d3a-bb8c663e312b \xe2\x80\xa6'
349: b'Player Status Change Su\xc3\xa1rez MF ARS 5.7 # FPL # GW35 http://www.fpl247.com'
350: b'Dilemma now to either bench boost or not ?? 1FT Mane Triple Cap anyone ? # GW35 # FPL pic.twitter.com/3Cbmdu6h5v'
351: b'# GW35 Bench Boost Preview Our bench boost is activated, but Deeney\xe2\x80\x99s red card has ruined our plans Check out our top replacements including our thoughts on the best captaincy pick http://www.footballadvice.co.uk/bench-boost-gw35-fpl-squad-preview/ \xe2\x80\xa6 # FPL # FPLCommunity # Deeney'
352: b'Ahead of their trip to Naples, Arsenal report that Denis Suarez (groin) will stay in London for treatment. Hector Bellerin (knee), Rob Holding (knee) and Danny Welbeck (ankle) remain out. # FFScout # FPL # GW35 # DGW35 # ArsenalFC'
353: b'# FPL # DoubleGameweek35 BEST FIXTURES is now online on the Polestar Football youtube channel. # premierleague # DGW35 # FPLCommunity # GW35 # Gameweek35 # FollowThePolestar Click here to watch https://youtu.be/78Jvx9YwPg4 pic.twitter.com/5fRhiAg9xB'
354: b"# FPL # GW34 behind us to 478k overall, still top my mini league Overcorrection this week (?) w/ a likely -12 hit. Everton didn't pan out, Brighton was just a stupid move and I'm a # GW35 BB # GW36 either the moves below or Man\xc3\xa9/Ag\xc3\xbcero cheers @ BenCrellin for the planner!pic.twitter.com/MdEHRrET6H"
355: b'Captain for # GW35...opinions? # FPL'
356: b'Look at Aguero historical stats! # FPL # GW35 https://twitter.com/FFootballHub/status/1118479564903190530 \xe2\x80\xa6'
357: b"Question: is there a single decent and reliable sub 5m defensive option for GW35? Jonny? One of Southampton's options? Is there a single Watford defender you can trust to start twice in a week? # FPL # GW35"
358: b'My # FPL # GW33 team would have bagged me 70 points excluding captaincy. Instead, my # wildcard # GW34 # DGW34 team got me a whopping 29 points including captaincy... and a drop of 90,000 overall rank Will the doubles in # GW35 # DGW35 make up for 40 points?pic.twitter.com/Kgy4uE3jOq'
359: b"Here's an early bird. # GW35 # FPL pic.twitter.com/Cdi3luFIAI"
360: b'GW 34 Overall rank: 263,047 All my rivals had used their wildcards and heavily backed three Brighton assets, having used my own wildcard back in January. Relieved that Hazard blanked Roll on GW35 # fpl # gw35 # FPLCommunitypic.twitter.com/VzfdmW2ASI'
361: b'FPL Holly is back this week with her selection of captain picks for Double # GW35. Last chance to play your triple captain chip (if you still have it) in a double game week - who gets the nod? http://fplbet.com/game-week-35-captain-picks/ \xe2\x80\xa6 # FPL @ FFCommunity_'
362: b'We also have some interesting Leicester trivia # FPL # GW35 pic.twitter.com/flw4NEVywt'
363: b'Now take a look at this stat # FPL # GW35 pic.twitter.com/IiAwsT37S1'
364: b'Wildcard Woes and Brighton Foes | Gameweek 35 https://youtu.be/ACW41kUFBuY This week we talk about gameweek 34 and the wildcard woes people felt plus players to avoid, pick and take a risk on for the # GW35 double gameweek, with a look towards the end of the season # FPL # FPLcommunity'
365: b"I'm struggling to figure out what players I need for DGW35 let alone GW1! @ FFScout @ OfficialFPL @ premierleague # FPL # fantasyfootball # FantasyPL # FFScout # FPLCommunity # gw35 # dgw35 https://youtu.be/hq7q6GxVCpk pic.twitter.com/OD1sGPxnJ5"
366: b'Are any Man Utd players worth considering for Double Gameweek 35? We assess their display in Barcelona last night and look further ahead to two more appealing fixtures in May... https://www.fantasyfootballscout.co.uk/2019/04/17/how-united-players-fared-in-their-last-game-before-double-gameweek-35/ \xe2\x80\xa6 # GW35 # DGW35 # FPL'
367: b'This is me after this GW # FPL # Deeney # FantasyPL # wildcard # DGW # GW35 # Premierleague # Homerpic.twitter.com/hDPcouNKZu'
368: b'\xc2\xa9 # DGW35 captain picks # FPL Aguero, Son, Lacazette, Jimenez & Gray (diff) @ FPLHeskibo @ FPL_Heisenberg @ FPLFamily @ FFScout_Joe @ FPL_Guidance @ fplchancer @ FPLTheAdam @ FPL_Audit @ FPLSWOT @ TalkingTown_ TY all # FPLcommmunity # fantasypl # GW35 https://www.thestatszone.com/fpl-double-gameweek-35-captain-picks-18-19 \xe2\x80\xa6pic.twitter.com/lf4c6YyDtR'
369: b"It's tense at the top of the Numbers Game league... @ Elwood_fpl takes a narrow 2-point lead into # GW35. Pod guest @ MasonNiallG still just in the race, while it's been a sad, sad season for James and @ _georget1999 Still all to play for. Godspeed, everyone # FPL pic.twitter.com/jMdgG8K7yt"
370: b'Plan to do this and activate BB anyways. Then play 3-5-2 for the rest of the season. # FPL # FPLCommunity # GW35 Thoughts? pic.twitter.com/zWchlFLNxm'
371: b"Note to self: It's not worth taking a hit for a defender, even though he has a DGW, even more so if he is a Top half defender. # FPL # FPLCommunity # GW35"
372: b'Which chip is the best to use for # GW35? # FPL # FPLCOMMUNITY'
373: b'Do you guys perhaps need come advice like this? # GW35 # FPL pic.twitter.com/9PyNzVwMRh'
374: b'Best Deeney replacements for # GW35 ? # FPL # FPLCommunity'
375: b'Planning to Bench Boost in Double Gameweek 35? We look at how effective the chip was last season. https://www.fantasyfootballscout.co.uk/2019/04/17/how-effective-was-the-bench-boost-chip-last-season/ \xe2\x80\xa6 # FPL # GW35 # DGW35'
376: b'Player Status Change Lamela MF TOT 5.9 Wilshere MF WHU 4.8 # FPL # GW35 http://www.fpl247.com'
377: b'# FPL # GW34 recap I brought in Kane early, and the fucker got injured so made transfers with a -16 Ended the week on 72, could\xe2\x80\x99ve been way way worse. Onto # GW35'
378: b'When should you play your bench boost? With the upcoming double # GW35, we have discussed when managers should play their bench boost, and if a double is the best time http://www.footballadvice.co.uk/fpl-bench-boost/ \xe2\x80\xa6 # FPL # FPLCommunity'
379: b'RT FPLChunk: Overall rank: 6,911 Points: 73 Wilson, Fraser and Pogba Hazard missed two sitters against Liverpool Onto # GW35 now. # FPL pic.twitter.com/K7T752kVhP Credit: Football__tweets'
380: b'RT FPLChunk: Overall rank: 6,911 Points: 73 Wilson, Fraser and Pogba Hazard missed two sitters against Liverpool Onto # GW35 now. # FPL pic.twitter.com/cJBDkawB4C'
381: b'RT FPLChunk: Overall rank: 6,911 Points: 73 Wilson, Fraser and Pogba Hazard missed two sitters against Liverpool Onto # GW35 now. # FPL pic.twitter.com/JgjghAfa1W'
382: b'Overall rank: 6,911 Points: 73 Wilson, Fraser and Pogba Hazard missed two sitters against Liverpool Onto # GW35 now. # FPL pic.twitter.com/GRXy8vpDro'
383: b'# FPL # DoubleGameweek35 TEAM SELECTION is now online on the Polestar Football youtube channel. # PremierLeague # DGW35 # FPLCommunity # GW35 # Gameweek35 # FollowThePolestar Click here to watch https://youtu.be/QDKNUARnb_Q pic.twitter.com/Lkirv8SU0Q'
384: b"Well wildcarding In # gw34 didn't go according to plan Still gonna go with bench boost in # GW35 and probably have another game week Haven't got a clue what to do with my free transfer this week # FPL # FPLcommunity # fantasypremierleague # fantasyplpic.twitter.com/8Vf4R0hQ3c"
385: b'We are live with our # GW35 pod. Tune in for Deeney rants, BB chats, and a few randomly sprinkled in GoT quotes (courtesy of Marz who has never even watched it ). Enjoy! # FPL https://twitter.com/3AmigosFPL/status/1118408974104186880 \xe2\x80\xa6'
386: b'# GW34 Review 47 points 72,492 OR (9k red arrow) Deeney/Duffy Jimenez/Aguero De Bruyne/Mane Overall a poor wildcard GW, the Duffy captaincy proving a BIG fail! All prepared for bench boost # GW35 How did everyone else do? # FPL # FPLCommunity # Deeneypic.twitter.com/eVLGINzANQ'
387: b'Most Transferred out Today 1) Vardy FW LEI 9.2 4449 2) Deeney FW WAT 5.9 4220 3) Murray FW BHA 6.4 2641 4) Hazard MF CHE 11.0 2406 5) Duffy DF BHA 4.8 2186 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
388: b'Most Transferred in Today 1) Lucas Moura MF TOT 6.7 4813 2) Jim\xc3\xa9nez FW WOL 6.9 4159 3) Redmond MF SOU 5.3 3500 4) Wilson FW BOU 6.6 3424 5) Aubameyang FW ARS 10.9 3380 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
389: b'Overnight players unavailable Pereyra MF WAT 6.0 Andr\xc3\xa9 Gomes MF EVE 5.4 Gunnarsson MF CAR 4.4 Lovren DF LIV 4.9 Arter MF CAR 4.9 # FPL # GW35 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
390: b'Overnight players available S\xc3\xa1nchez MF MUN 10.0 # FPL # GW35 http://www.fpl247.com/player/returning \xe2\x80\xa6'
391: b'# FPL # GW35 # OddsAnalysispic.twitter.com/4odNiOovwc'
392: b'Tempted to save the FT (field 11 dgw-ers) and keep the BB for # GW36 # GW35 # FPL # FPLCommunity'
393: b'Predicted Price Risers: None Predicted Price Fallers: Etheridge \xe2\x80\x93 Possibility 99,5% Fabianski \xe2\x80\x93 99,4% # fpl # fplprice # fplupdate # gw35'
394: b'Player Status Change Lovren DF LIV 4.9 Henderson MF LIV 5.3 # FPL # GW35 http://www.fpl247.com'
395: b'How you should pick your # FPL # GW35 Team if your a # LFC supporter Liverpool Supporters GW35 FPL Wildcard Teamhttps://youtu.be/kZ62M-wFNm8'
396: b'So I went with Duffy (c) & Ryan in net. On paper I thought it looked good, thought 1 CS vs Cardiff at least. It didn\xe2\x80\x99t turn out so well. Plenty of people avoided the trap, well done to them. I\xe2\x80\x99ll take my spanking and move on to # GW35 so I can deal with Deeney # FPL'
397: b'Player Status Change Gunnarsson MF CAR 4.4 S\xc3\xa1nchez MF MUN 10.0 Matic MF MUN 5.0 Pereyra MF WAT 6.0 Andr\xc3\xa9 Gomes MF EVE 5.4 # FPL # GW35 http://www.fpl247.com'
398: b"Who all's for a -12 then? # wildcardaftermath # FPL # GW35"
399: b'# gw35 Def taking -4 to get rid of the Brighton # fpl'
400: b"Can I buy another Wildcard? I'll pay anything, lol # FPL # GW34 # GW35"
401: b'# FPL # FPLCommunity # DGW35 , # GW35 Following a disappointing wildcard benching VVD(3rd sub) looking to bounce back strong in the doubles Best replacement for Camarasa(Car) - needs to be \xc2\xa34.9m or under ?'
402: b'NEW POST - fantasy premier league \xe2\x80\x93 underlying stats form tables up to GW35 https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-form-underlying-gw35/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW35 # DGW35 # wildcardpic.twitter.com/KUWaaFygvb'
403: b'@ ffscout_az and @ FFScout_Joe are joined by @ ahopcroft13 to discuss the key issues for FPL managers ahead of Gameweek 35. # FFScout # Scoutcast # FPL # GW35 # FPLCommunityhttps://www.youtube.com/channel/UCKxYKQ8pgJ7V8wwh4hLsSXQ/live \xe2\x80\xa6'
404: b'When should you play your bench boost? With the upcoming double # GW35, we have discussed when managers should play their bench boost, and if a double is the best time http://www.footballadvice.co.uk/fpl-bench-boost/ \xe2\x80\xa6 # FPL # FPLCommunity'
405: b'With Deeney out, we\xe2\x80\x99re going to avoid chasing double gameweekers for a bench boost and save it for a later GW (probably 38) We\xe2\x80\x99re looking at 7DGW players without a hit, plus Salah & Alisson vs Cardiff. # FPL # GW35 # FPLCommunity'
406: b'Most Transferred out Today 1) Deeney FW WAT 5.9 19321 2) Vardy FW LEI 9.2 10133 3) Hazard MF CHE 11.0 6222 4) Richarlison MF EVE 6.5 6005 5) Lacazette FW ARS 9.4 5178 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
407: b'Most Transferred in Today 1) Lucas Moura MF TOT 6.7 12238 2) Wilson FW BOU 6.6 11926 3) Gray FW WAT 5.9 10068 4) Jim\xc3\xa9nez FW WOL 6.9 9725 5) Aubameyang FW ARS 10.9 8878 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
408: b'I am thinking in a wild, wildcard... This # gw35 will have 8 # DGW teams and a Cardiff vs Liverpool, who is number 1 in the tables. This will be a super epic gw! # FPL # queenbangerteam # FPLCommunitypic.twitter.com/dbTP9DzdDu'
409: b"Made hasty decision to replace Deeney with Gray after Deeney red. Can't see red being overturned and Gray's price might rise. I have 0.0ITB! # FPL # GW34 # GW35 # DGW35"
410: b'NEW POST - Fantasy premier league GW34 review \xe2\x80\x93 the best underlying stats from GW34 only We look at how all the players and teams have performed in GW34 https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-gw34-review-only/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fantasypl # GW35 # DGW35 # wildcard # eplfantasy # fplMY # FPLus # fpltreviewpic.twitter.com/HKkRVvf8nr'
411: b'Aguero is my # GW35 captain Big game player 1 home fixture Loves Manchester derby Guaranteed starter # FPL'
412: b'# FPL # FPLCommunity # FantasyPL # GW35 https://twitter.com/FMLFPL/status/1118002102830358528 \xe2\x80\xa6'
413: b'The plan is to BB in # GW35. Thoughts on this move: Deeney Llorente Camarasa Deulofeu (-4) # FPL # FPLCommunity'
414: b'Most Transferred out Today 1) Deeney FW WAT 5.9 9375 2) Vardy FW LEI 9.2 3959 3) Hazard MF CHE 11.0 2517 4) Lacazette FW ARS 9.4 2326 5) Richarlison MF EVE 6.5 2291 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
415: b'Most Transferred in Today 1) Wilson FW BOU 6.6 5299 2) Lucas Moura MF TOT 6.7 4864 3) Gray FW WAT 5.9 4270 4) Jim\xc3\xa9nez FW WOL 6.9 3777 5) Aubameyang FW ARS 10.9 3743 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
416: b'Overnight price fallers Hayden MF NEW 4.3 Paterson MF CAR 4.8 Success FW WAT 4.5 # FPL # GW35 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
417: b'Overnight players unavailable Deeney FW WAT 5.9 Torreira MF ARS 4.7 # FPL # GW35 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
418: b'Overnight players available Xhaka MF ARS 5.2 March MF BHA 4.7 Kiko Femen\xc3\xada DF WAT 4.2 Gro\xc3\x9f MF BHA 6.7 Success FW WAT 4.5 # FPL # GW35 http://www.fpl247.com/player/returning \xe2\x80\xa6'
419: b"Thinking of dropping my bench boost for # GW35 Thoughts? I'm thinking dropping a city asset and probably Duffy as well Not sure who for # FPL # FPLCommunitypic.twitter.com/HJ83P58Z0P"
420: b'Pod #169: While # GW34 messes with our collective head we must turn our attention to mounting # GW35 dilemmas, like Deeney replacements, Liverpool priorities, and standout captains for the doubles. Plus vote for us in the @ TheFBAs! # FPL # hailcheatershttps://soundcloud.com/alwayscheating/ep-169-awesome-players-for-awesome-fixtures-gw34-35 \xe2\x80\xa6'
421: b'Predicting the BB in 35 will be as big a disaster as the WC in 34. Brighton A to Wolves & Spurs Deeney out for Gray who may be Success for a game Rotation for top 6 teams after a European week Where do I sign up? # FPL # GW35'
422: b"If I were ignore DGW players and still play BB, I'd definitely look at BOU assets until the end of the season. # FPL # GW35"
423: b'# FPL # FPLCommunity # GW35 # DGW35 You know what? The more I look at this line-up, the more I like it, and the more I wonder whether rolling my FT might not be a bad idea... Unless I were to (C) Jim\xc3\xa9nez, bring Wilson in for Deeney and bench David Luiz... Views/opinions?pic.twitter.com/WmSZ58Qjfb'
424: b'Watch out for Deeney price drop. # fpl # GW35 pic.twitter.com/ULY3FPVDUF'
425: b"*** Ep. 190 - On to # GW35 Planning for the Worst and Expecting It as Well *** End of the season every1 is sorta on their own paths at this point & well if you're not then yeah, you have to ask yourself what you're doing... Let's get in there. http://fmlfpl.libsyn.com/ep-190-on-to-gw35-planning-for-the-worst-and-expecting-it-as-well \xe2\x80\xa6 # FMLFPL # FPL"
426: b"With the Deeney red, I don't think I will be doing BB on # GW35. # FPL"
427: b'Price Changes (4/16/2019) Risers: - Fallers: Paterson \xc2\xa34.8m Hayden \xc2\xa34.3m Success \xc2\xa34.5m # FPL # GW35 # FPL_Price'
428: b'FPL OFFICIAL Price Changes (4/16/2019) Overnight Risers: None Overnight Fallers: Paterson \xc2\xa34.8m Hayden \xc2\xa34.3m Success \xc2\xa34.5m # FPL # GW35 # FPL_PriceChanges # Aye'
429: b'Player Status Change Torreira MF ARS 4.7 # FPL # GW35 http://www.fpl247.com'
430: b'Predicted Price Risers: None Predicted Price Fallers: Fabianski \xe2\x80\x93 Possibility : 99,8% Etheridge \xe2\x80\x93 99,5% Zaha \xe2\x80\x93 99,6% Success \xe2\x80\x93 112,1% # fpl # fplprice # fplupdate # GW35'
431: b'We are recording tomorrow night for # GW35 with @ fplguy1 who has 3 top 1 k finishes, 6 top 20 k finishes, with the highest being 604th and a current overall rank of 1,795 Please send over your questions and topics to discuss now # upthepod # fpl pic.twitter.com/WaioazHzP3'
432: b'Player Status Change Xhaka MF ARS 5.2 Kiko Femen\xc3\xada DF WAT 4.2 Deeney FW WAT 5.9 Success FW WAT 4.6 # FPL # GW35 http://www.fpl247.com'
433: b"And there goes the template # wildcard front 3 with Deeney's red card! # FPL # WATARS # FPLCommunity # GW34 # GW35 # DGW34 # DGW35 # wildcardfailpic.twitter.com/Mc8Du7XCzG"
434: b"Wow, wasn't rooting for *that* from Deeney Shocking result and huge implications for the double-gameweek. # FPL # GW35 https://twitter.com/hailcheaters/status/1117853342661783552 \xe2\x80\xa6"
435: b'Deeney owners who got him ahead of his tasty # GW35 double right now: # FPL pic.twitter.com/07g5Be3gHn'
436: b'Lucas Moura or Nathan Redmond # fpl # GW35'
437: b'Fantasy Premier League tips Gameweek 35: Captains # FPL # GW35 http://burp.to/7lk'
438: b'Most Transferred out Today 1) Vardy FW LEI 9.2 11212 2) Hazard MF CHE 11.0 7516 3) Richarlison MF EVE 6.5 6815 4) Sigurdsson MF EVE 7.4 5851 5) Maddison MF LEI 6.9 4992 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
439: b'Most Transferred in Today 1) Lucas Moura MF TOT 6.7 14045 2) Wilson FW BOU 6.6 10647 3) Deeney FW WAT 5.9 9397 4) Sterling MF MCI 11.5 8342 5) Jim\xc3\xa9nez FW WOL 6.9 7849 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
440: b'Price Changes (4/15/2019) Risers: - Fallers: Townsend \xc2\xa35.7m Davies \xc2\xa35.0m Bettinelli \xc2\xa34.2m # FPL # GW35 # FPL_Price'
441: b'FPL OFFICIAL Price Changes (4/15/2019) Overnight Risers: None Fallers: Townsend \xc2\xa35.7m Davies \xc2\xa35.0m Bettinelli \xc2\xa34.2m # FPL # GW35 # FPL_PriceChanges # Aye'
442: b'Fantasy Premier League tips Gameweek 35: Forwards # GW35 # FPL http://burp.to/7lj'
443: b'Tonight! New Always Cheating Podcast. Questions? Comments? Rants? Get them in. # FPL # GW35 # hailcheaterspic.twitter.com/hulYcn5Tkn'
444: b'NEW POST - fantasy premier league GW35 \xe2\x80\x93 analysing the teams of 10 top FPL managers - interim article https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-transfer-tips-gw35-10-fpl-managers/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fantasypl # GW35 # DGW35 # wildcard # freehitpic.twitter.com/EfUG0fYRKY'
445: b'Current # GW35 Squad. Honestly really happy with it Anyone think it needs any changes? Open to suggestions! # FPL pic.twitter.com/RqGOBTTtWL'
446: b'Fantasy Premier League tips Gameweek 35: Midfielders # FPL # GW35 http://burp.to/7li'
447: b'Guys, is it too late to consider Lucas Moura? # FPL # FPLCommunity # GW35 Thinking of: Eriksen Lucas Camarasa Mane @ WGTA_FPL @ FPLpistolinas @ FplXI @ Philosopey @ CHAMP20NSFC @ FFScout_Joe'
448: b'Player Status Change March MF BHA 4.7 Gro\xc3\x9f MF BHA 6.7 # FPL # GW35 http://www.fpl247.com'
449: b'# fpl @ OfficialFPL # gw35 Captain choice?'
450: b'Fantasy Premier League tips Gameweek 35: Defenders # GW35 # FPL http://burp.to/7lh'
451: b"GW34 hasn't finished yet, but we are taking questions ahead of # GW35 Let us know what questions you want answered # FPL # FPLCommunity"
452: b'Fantasy Premier League tips Gameweek 35: Goalkeepers # FPL # GW35 http://burp.to/7lg'
453: b'@ OfficialFPL Price Changes (645 am IST - 15th Apr 2019) Price Rises: None Price Drops: Townsend # CPFC \xc2\xa35.7 Davies # EFC \xc2\xa35.0 Bettinelli # FFC \xc2\xa34.2 # FFEPriceChanges # FPL # GW35'
454: b'Most Transferred out Today 1) Vardy FW LEI 9.2 4172 2) Hazard MF CHE 11.0 2973 3) Richarlison MF EVE 6.5 2557 4) Sigurdsson MF EVE 7.4 2352 5) Maddison MF LEI 6.9 1932 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
455: b'Most Transferred in Today 1) Lucas Moura MF TOT 6.7 5295 2) Wilson FW BOU 6.6 4454 3) Deeney FW WAT 5.9 3422 4) Sterling MF MCI 11.5 3205 5) Redmond MF SOU 5.3 2907 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
456: b'Overnight price fallers Bettinelli GK FUL 4.2 Davies MF EVE 5.0 Townsend MF CRY 5.7 # FPL # GW35 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
457: b'Overnight players unavailable R\xc3\xbcdiger DF CHE 5.9 Schlupp DF CRY 4.5 Fernandinho MF MCI 5.3 Henderson MF LIV 5.3 Fosu-Mensah DF FUL 4.5 # FPL # GW35 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
458: b'Overnight players available Bernardo Silva MF MCI 7.6 Young DF MUN 5.7 # FPL # GW35 http://www.fpl247.com/player/returning \xe2\x80\xa6'
459: b'Which # FPL duo would you rather have for a -4 points hit going into # GW35..? # Lucas & # Aguero or # Sterling & # Jimenez I already have # Laporte & # DeBruyne as Man City cover & # Son as Spurs. Basically, I need a candidate for my triple captain hence the move'
460: b'Player Status Change R\xc3\xbcdiger DF CHE 5.9 Henderson MF LIV 5.3 # FPL # GW35 http://www.fpl247.com'
461: b"Let's goooo, finally # GW35 # FPL # LIVCHEpic.twitter.com/Ruf16zRpLR"
462: b'I\xe2\x80\x99m gonna watch that Salah goal on repeat until GW35 # fpl # gw35'
463: b'Most Transferred out Today 1) Vardy FW LEI 9.2 8819 2) Kane FW TOT 12.6 5829 3) Richarlison MF EVE 6.5 5142 4) Sigurdsson MF EVE 7.4 4387 5) Maddison MF LEI 6.9 4204 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
464: b'Most Transferred in Today 1) Lucas Moura MF TOT 6.7 12418 2) Wilson FW BOU 6.6 8731 3) Deeney FW WAT 5.9 6916 4) Ag\xc3\xbcero FW MCI 11.7 6624 5) Sterling MF MCI 11.5 6183 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
465: b'I will be really satisfied if I can remain # FPL Top 50k at the end of this # GW34. Wildcard plans are mainly for # GW35 with BB anyways.'
466: b'Player Status Change Schlupp DF CRY 4.5 Fernandinho MF MCI 5.3 Bernardo Silva MF MCI 7.6 Fosu-Mensah DF FUL 4.5 # FPL # GW35 http://www.fpl247.com'
467: b'If Aguero is confirmed out for the next few games, I might take a hit to do this: Aguero Laca/Firmino Camarasa KDB # GW35 # FPL'
468: b"If you don't have two of them, you play # FPL wrong. # GW34 # GW35 pic.twitter.com/Dmou13jQEm"
469: b'Player Status Change Young DF MUN 5.7 # FPL # GW35 http://www.fpl247.com'
470: b'Most Transferred out Today 1) Vardy FW LEI 9.2 2594 2) Kane FW TOT 12.6 1552 3) Richarlison MF EVE 6.5 1362 4) Sigurdsson MF EVE 7.4 1251 5) Maddison MF LEI 6.9 1250 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
471: b'Most Transferred in Today 1) Lucas Moura MF TOT 6.7 3445 2) Wilson FW BOU 6.6 2469 3) Deeney FW WAT 5.9 2126 4) Ag\xc3\xbcero FW MCI 11.7 1823 5) Redmond MF SOU 5.3 1817 # FPL # GW35 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
472: b'Overnight New Players Elliott MF FUL 4.0 Holland MF WHU 4.0 Marsh MF TOT 4.5 # FPL # GW35 http://www.fpl247.com/player/newplayer \xe2\x80\xa6'
473: b'Re: Valery. Hope he get recover for the DGW. # GW35 # FPL https://twitter.com/BenDinnery/status/1117116413947330560 \xe2\x80\xa6'
474: b'Overnight price fallers David Luiz DF CHE 5.9 # FPL # GW35 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
475: b'Overnight price risers Jim\xc3\xa9nez FW WOL 6.9 # FPL # GW35 http://www.fpl247.com/player/price/weekly?change=rise \xe2\x80\xa6'
476: b'Overnight players unavailable Arnautovic FW WHU 6.8 Knockaert MF BHA 5.2 Valery DF SOU 4.1 Llorente FW TOT 5.1 Cresswell DF WHU 5.0 Zambo Anguissa MF FUL 4.4 Lucas FW WHU 6.2 Lanzini MF WHU 6.4 # FPL # GW35 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
477: b'Overnight players available Steve Cook DF BOU 4.3 Darmian DF MUN 4.6 # FPL # GW35 http://www.fpl247.com/player/returning \xe2\x80\xa6'
478: b'@ OfficialFPL Price Changes (645 am IST - 14th Apr 2019) Price Rises: Jim\xc3\xa9nez # WOL \xc2\xa36.9 Price Drops: David Luiz # CFC \xc2\xa35.9 # FFEPriceChanges # FPL # GW35'
479: b'Price Changes (4/14/2019) Risers: Jim\xc3\xa9nez \xc2\xa36.9m Fallers: David Luiz \xc2\xa35.9m # FPL # GW35 # FPL_Price'
480: b'FPL OFFICIAL Price Changes (4/14/2019) Overnight Risers: Jim\xc3\xa9nez \xc2\xa36.9m Overnight Fallers: David Luiz \xc2\xa35.9m # FPL # GW35 # FPL_PriceChanges # Aye'
