1: b"Fantasy football advice for everyone who's been trying their best all year, but can only dream of finishing anything above fifteenth: https://the4pointhit.wordpress.com/2019/05/02/fantasy-forecast-gameweek-37/ \xe2\x80\xa6 # FPL # FPLCommunity # GW37 # FantasyPL # FRACHL # ARSVAL"
2: b'Who to start in # GW37? # FPL # FPLCommunity'
3: b"With the option of any striker in the Premier League to choose from, we opt for Shane Long. It's the kind of wisdom that's made us the blog other blogs point and laugh at: https://the4pointhit.wordpress.com/2019/05/02/fantasy-forecast-gameweek-37/ \xe2\x80\xa6 # FPL # FPLCommunity # GW37 # FantasyPL # FRACHE # ARSVAL"
4: b'# GW37 locked in Aguero captain Current OR: 47K # FPL pic.twitter.com/wWikEnxr9h'
5: b'# FPL # GW37 Which duo whom do u prefer to have ? @ FFCommunity_ @ WGTA_FPL @ FPLTheAdam @ TheFootyWiz @ FPLCougars'
6: b'GW37 Captains: Home form points to trio via @ premierleague # GW37 # FPL httpss://www.premierleague.com/news/1205294'
7: b'Our # GW37 episode is up! GW36 Bumps Final strategies: or ? CL/EL Review GW37 Essentials GW37 Punts < 5% GW37 Caps Questions https://soundcloud.com/wt-fpl/ep-27-gw37 \xe2\x80\xa6 & appreciated! # WTFPL @ WhatheFPL @ FPLBrit # FPL'
8: b"I would go Pogba but wouldn't make the Eriksen -> Pogba transfer simply coz Eriksen typically gets attacking returns against Bournemouth. # GW37 # FPL https://twitter.com/FPLGeneral/status/1124020713239863298 \xe2\x80\xa6"
9: b'Captain 1. Aguero 2. Sterling 3. Salah Captaincy Punts 1. Wilson 2. Jimenez 3. Arnautovic Differential Punt 1. Antonio 2. Redmond 3. Pogba or Lukaku/Rashford if either are fit # FPL # GW37 # GW37 captain Enjoy the weekend everyone!!'
10: b'Title Race Man City could easily score a few goals in the final 2 games, Liverpool have the harder fixtures but will likely score against Wolves but will face a tough trip at Newcastle. I would not sell any of their assets unless you want to take a gamble. # FPL # GW37'
11: b'Thoughts on some other teams: Chelsea \xe2\x80\x93 Not consistent enough plus Europa League commitments. Arsenal \xe2\x80\x93 Same as Chelsea but do play Brighton at home in GW37 if you fancy a one week punt. # FPL # GW37'
12: b"Anyone has trouble sleeping and thinking about tomorrow's # GW37 deadline? Hit us with any question! # FPL"
13: b'# FPL # FPLCommunity # GW37 1 FT Been planning Duffy to Shaw all week. But now considering AWB having given him zero thought all week. I already have Pogba, Lindelof and Zaha. Playing catch up these next two gameweeks. What do you think?'
14: b'Those are the teams with good 2 fixtures to take a gamble on. Good GW37 fixture (only): Wolves v Fulham The final home game for Wolves is against Fulham, a captaincy punt here could pay-off for chaser\xe2\x80\x99s. Keep in mind Fulham are a lot tighter in defence recently. # FPL # GW37'
15: b'Everton \xe2\x80\x93 BUR(h) & TOT(a) The Everton defence deserves more attention, they have gone under the radar recently with 5 clean sheets in 7 games. At a time when only Liverpool & Man City are providing consistent clean sheets, Everton are doing the same thing. # FPL # GW37'
16: b'Cardiff will need to attack and this will give Zaha plenty of room to operate. Cardiff & Bournemouth have 2 clean sheets in the last 11 & 12 games respectively, so its time for Zaha to deliver # FPL # GW37'
17: b'Crystal Palace CAR(a) & BOU(h) From an attacking perspective Palace have 2 great games for likes to Zaha & Milivojevic to benefit from. Cardiff play in must win game against Palace where anything other the a victory means they are relegated # FPL # GW37'
18: b'However the Bournemouth v Spurs game could also pay dividends as Spurs have a leaky defence at the moment as well as looking a little tired. Spurs will have a lot focus on the mid week champions league game, look for Bournemouth to capitalise # FPL # GW37'
19: b'West Ham \xe2\x80\x93 SOU(h) & Wat(a) We know Southampton can\xe2\x80\x99t defend so West Ham\xe2\x80\x99s final home game could prove to be a goal fest but no West Ham attacker stands out at the moment. Michel Antonio has 2 games in 2 games if you fancy a punt on a form player # FPL # GW37'
20: b'Man Utd - Hud(a) & CAR(h) Form v fixtures is the big question facing FPL managers when it comes to Man Utd, they are in poor form but the final 2 fixtures are great Man Utd could be the team to gamble on if you are chasing with the likes of Pogba, Rashford or Lukaku. # FPL # GW37'
21: b'Amazingly Shane Long has scored 4 goals in 5 games and is priced at a bargain busting 4.7m, he is probably in the goal scoring form of his career. Redmond or Ward-Prowse would still be my preferred choices # FPL # GW37'
22: b'Teams with good/decent fixtures in GW37-38: Southampton \xe2\x80\x93 WHU(a) & HUD(h) You would have fancy Southampton to return some attacking points over these 2 fixtures and maybe a clean sheet. Clean sheet\xe2\x80\x99s is not guaranteed with Southampton with only 2 of them in 15 games. # FPL # GW37'
23: b"Depending on if you are leading or chasing in your mini league\xe2\x80\x99s should determine if you should take any risks or play safe. As I said before if you are leading don't take risks, let your rivals do that. If chasing there are plenty of differentials to make up ground. # FPL # GW37"
24: b'Player Status Change Monreal DF ARS 5.4 \xc3\x96zil MF ARS 7.9 Willian MF CHE 7.1 # FPL # GW37 http://www.fpl247.com'
25: b'FPL GW37 Preview After a great GW36 its time to look forward to final 2 game weeks of the season. In this week\xe2\x80\x99s preview I will look at some player\xe2\x80\x99s from teams that are likely to score some points over the final 2 weeks of the season to enable us to move up the ranks # FPL # GW37'
26: b"Friday deadline this week. Make sure to get those FT's done and set your team! # FPL # GW37"
27: b'# FPL # FPLCommunity # FantasyPL # GW37 preach https://twitter.com/FPLpistolinas/status/1124002151615823873 \xe2\x80\xa6'
28: b'Who should l play this GW? (Not a great choice l know) # GW37 # FPL # FPLCommunity'
29: b'Leaning towards holding, but I could use some help this week! # fpl # GW37'
30: b"# FPL # GW37 @ _FPLtips @ FPL_NZ @ LetsTalk_FPL @ OfficialFPL @ themh95 GW37 Preview : -Pogba & PVA IN -Eriksen & Trippier OUT -Jota \xc2\xa9 -Keeping Vardy Till the end -Good luck all ! *I'll be posting more fpl content so please follow me for more!!!pic.twitter.com/YrcqlHDhEE"
31: b'Register on our website for free, and get free analysis of up to 3 different # FPL teams each gameweek! # GW37 # FPLCommunityhttps://foomnianalytics.com/signup.php'
32: b'Just the 30 odd minutes for Hazard tonight, good news for owners and investors # FPL # GW37 # EINCHE'
33: b'\xd8\xa5\xd8\xae\xd8\xaa\xd9\x8a\xd8\xa7\xd8\xb1\xd8\xa7\xd8\xaa \xd8\xa7\xd9\x84\xd9\x83\xd8\xa7\xd8\xa8\xd8\xaa\xd9\x86 \xd9\x84\xd9\x84\xd8\xa5\xd8\xb3\xd8\xa8\xd9\x88\xd8\xb9 \xd9\xa3\xd9\xa7 Captain choices for # GW37 # fpl 1- Aguerooo...\xd8\xa3\xd8\xac\xd9\x88\xd9\x8a\xd8\xb1\xd9\x88\xd9\x88\xd9\x88 2- Sterliiing...\xd8\xb3\xd8\xaa\xd9\x8a\xd8\xb1\xd8\xb1\xd8\xb1\xd9\x84\xd9\x86\xd8\xac 3- Pogbaaa...\xd8\xa8\xd9\x88\xd8\xac\xd8\xa8\xd8\xa7\xd8\xa7\xd8\xa7\xd8\xa7\xd8\xa7 4- Jimenezzz...\xd8\xae\xd9\x85\xd9\x8a\xd9\x86\xd9\x8a\xd8\xb2\xd8\xb2\xd8\xb2 # \xd9\x81\xd8\xa7\xd9\x86\xd8\xaa\xd8\xb2\xd9\x8a\xd8\xb3\xd8\xaa\xd8\xa7 # \xd9\x81\xd8\xa7\xd9\x86\xd8\xaa\xd8\xb2\xd9\x8a_\xd8\xa7\xd9\x84\xd8\xa8\xd8\xb1\xd9\x8a\xd9\x85\xd9\x8a\xd8\xb1\xd9\x84\xd9\x8a\xd8\xba # FPL # fantasypremierleaguepic.twitter.com/4BUYNe6zsC'
34: b'Week 37 Official FPL Player Picks # FPL # gw37 https://www.nevermanagealone.com/2019/5/2/18527257/epl-week-37-official-fpl-player-picks?utm_campaign=2cents81&utm_content=chorus&utm_medium=social&utm_source=twitter \xe2\x80\xa6'
35: b"The Four Point Hit - the only place you'll find a fantasy football advice column of such indifference. https://the4pointhit.wordpress.com/2019/05/02/fantasy-forecast-gameweek-37/ \xe2\x80\xa6 # FPL # FPLCommunity # GW37 # PremierLeague"
36: b"FPL team and player stats for Gameweek 37: who is catching the eye and which teams are looking vulnerable? We've done the sums and present you with some stand-out figures: https://www.fantasyfootballscout.co.uk/2019/05/02/fpl-gameweek-37-an-analysis-of-the-key-underlying-stats/ \xe2\x80\xa6 # FPL # GW37"
37: b'Advice Shop: Closed! FYI, @ bskbroiler will be rolling out a new podcast tonight for our Patreon supporters - learn more and sign up here: http://patreon.com/alwayscheating # FPL # GW37 # hailcheatershttps://twitter.com/hailcheaters/status/1124045645638189056 \xe2\x80\xa6'
38: b"Recommending Lacazette as differential pick this week. Consider captaining him if you're chasing a rival # FPL # GW37 pic.twitter.com/CZiApRQQC4"
39: b"My ever-optimistic assessment of Spurs' # FPL assets for # GW37 https://twitter.com/FPLMyClub/status/1124045807655817217 \xe2\x80\xa6"
40: b'Tottenham By @ FPLdepression # FPL # THFC # COYS # GW37 pic.twitter.com/Yk4mfY8UA1'
41: b'Advice! I have some. For the next 15 minutes. Got a question for a special pop-up Always Cheating Advice Shop? Send it over. # FPL # GW37 pic.twitter.com/KqqxHwtzDG'
42: b"# GW37 team - Hazard - 15,957 Now I've had the on Sterling all week, but its potentially @ hazardeden10 last game at the Bridge, I wouldn't be able to sleep if I, as a devout Chelsea fan, didn't him. Sometimes it's not just about FPL. Good luck all! # FPL pic.twitter.com/ld0BipzRog"
43: b'# GW37 # FPL pic.twitter.com/ENRBpyFzfH'
44: b'After their recent slump in form, managers have been questioning what to do with Eriksen and Son Check out our thoughts on whether you should stick or twist! http://www.footballadvice.co.uk/gw37-fpl-guest-question-and-answer/ \xe2\x80\xa6 # FPL # FPLCommunity # Son # Eriksen # GW37'
45: b'Wolves By @ OGold80 # FPL # Wolves # wwfc # GW37 pic.twitter.com/qPWRwZwzbc'
46: b'GW37 Review/Preview Thread # FPL # GW37'
47: b"# FPL I have mane,sterling,pogba,Jimenez,son who do you think I should captain I'm leaning towards mane but I need advice you guys!!! # GW37 # FPLcommunity"
48: b'Whom would you Captain for # GW37? # FPL'
49: b"@ paulpogba are you ok? It's been a minute since you tweeted I need you to be on it this weekend. You've received the call # FPL # GW37"
50: b'Rehearsals underway on the # FPL Show. Not many of these left this season! # FantasyPL # GW37 pic.twitter.com/IVtXCnkDLk'
51: b'M\xc3\xb3j kapitan na # GW37 # FPL https://twitter.com/_yaser0_/status/1124023926651260928 \xe2\x80\xa6'
52: b'LEGIONS OF POOM # GW37 Top rope - DCL Count out - Dings Ringleader - Haz OR - 132k The penultimate week. Hoping for big scores to sneak into top - fingers crossed! Last home game for Haz too! # FPL pic.twitter.com/yOk8v0kK8i'
53: b"Well that's me for # GW37 on bench boost. Pereira will become TAA. Hoping to roll the other FT, but if I hear anything on Patricio, I might shaft him. King likely gets one last game before he's gone from my team. # FPL pic.twitter.com/CS5r6OnpEK"
54: b"# GW37 Team locked OR 325K - Target rank top 200K, ambitious rank top 100K Hoping for some fireworks these last two GW's! Thoughts always welcome! How is everyone else lining up? # FPL # FPLCommunitypic.twitter.com/lcGfc6JWDM"
55: b"# FPL POWER RANKINGS - # GW37 Here is another short 5min video which will hopefully offer some transfer advice ahead of Gameweek 37. Please feel free to give it a RT if you can as I'd love as many of the # FPLCommunity to see it as possible. https://www.youtube.com/watch?v=QwrJPQQjM_Y \xe2\x80\xa6"
56: b'Not sure what to do for # GW37 Got one FT Happy to take a hit to move funds out of bench after BB recently Anyone you think im missing? I refuse to even think about Hazard this week I will not be burned again # FPLCommunity # FPL pic.twitter.com/QjlTvRJ3D2'
57: b'# fpl # fplcommunity # gw37 # gw38 # transfers # firmino # greenwood # son # salahhttps://twitter.com/chris_woods/status/1123983441656209408 \xe2\x80\xa6'
58: b"While there's a lot of hype around united midfielders, i think i'll take a trip back to the Garden of Eden # FPL # GW37 pic.twitter.com/glcLoH6lot"
59: b"NEW CAPTAIN METRIC ARTICLE I've crunched the stats on Sterling v Salah v Ag\xc3\xbcero v Hazard and provide 2x differential captain options Find out all the relevant underlying numbers for the captain options and who wins the metric here # GW37 # FPL https://fplconnect.blog/2019/05/02/fpl-captain-metric-gameweek-37/ \xe2\x80\xa6"
60: b'Hazard rested \xe2\x80\x94 Super Sunday set for him? # FPL # GW37 # FPLCommunitypic.twitter.com/L0pmjDOKAL'
61: b"This week's article for the @ fantasy_bet blog Four teams who have favourable fixtures in the final two GWs & the players I like from each of them. # FPL # GW37 # GW38https://www.fantasybet.com/blog/gameweek-37-who-to-pick/ \xe2\x80\xa6"
62: b'A reminder that this GW is a FRIDAY NIGHT deadline \xe2\x80\x94 7PM. # FPL # GW37 # FPLCommunity'
63: b'FISO Preview for # FPL Gameweek 37 # GW37: https://www.fiso.co.uk/fpl-season-2018-19-gameweek-37-preview/ \xe2\x80\xa6'
64: b'EVE / BUR \xe2\x80\x94 Sigurdsson BOU / TOT \xe2\x80\x94 Fraser WHU / SOU \xe2\x80\x94 Antonio WOL / FUL \xe2\x80\x94 Jimenez CAR / CRY \xe2\x80\x94 Milivojevic NEW / LIV \xe2\x80\x94 Salah CHE / WAT \xe2\x80\x94 Hazard HUD / MUN \xe2\x80\x94 Rashford ARS / BHA \xe2\x80\x94 Gross MCI / LEI \xe2\x80\x94 Aguero # FPL # GW37'
65: b'Thinking about investing into United players? Before you decide, check out @ LetsTalkSoccer2 and our thoughts on the topic http://www.footballadvice.co.uk/gw37-fpl-guest-question-and-answer/ \xe2\x80\xa6 # FPL # FPLCommunity # GW37 # Pogba # Rashford'
66: b'The # FPL deadline is just 24 hours away. Have you made your moves yet? Settled on a captain? # gw37'
67: b"Feel free to use our Comparison Tool, where you can easily compare 2 players! It's 100% free! # FPL # GW37 # FPLCommunityhttps://foomnianalytics.com/pcompare.php"
68: b'Transfer strategies for # GW37 Planning on a hit to spring a surprise AND neutralise # FPL ML rivals Do you keep cards close until deadline or roll the dice & spook them into taking hits as well'
69: b'Arsenal XI to play Valencia: Cech, Mustafi, Sokratis, Koscielny, Maitland-Niles, Xhaka, Guendouzi, Kolasinac, Ozil, Aubameyang, Lacazette. # FFScout # FPL # GW37 # ArsenalFC'
70: b'Eriksen out, but who to bring in for GW37? Sterling or Hazard? # FPL # GW37'
71: b'Chelsea XI to play Eintracht Frankfurt: Kepa, Azpilicueta, Christensen, Luiz, Emerson, Kante, Jorginho, Loftus-Cheek, Willian, Giroud, Pedro. Eden Hazard and Gonzalo Higuain are among the substitutes. # FFScout # FPL # GW37 # ChelseaFC'
72: b'https://youtu.be/Fj38RhmlfnU # FPL # GW37 # FPLCommunity # ffscout # FantasyFootball # FantasyPL @ OfficialFPL @ FFScout @ Superbru @ talkSPORTpic.twitter.com/7JXyNwUeF2'
73: b'Do you guys need any help for # GW37? # FPL'
74: b'0.7% TSB We\xe2\x80\x99re got SUPER DIFFERENTIAL right here! Less than 1% owned and playing for the team chasing the title, now is time to take the risk. Since playing further forward, Henderson has returned 27pts (1G, 3A) in 5GW, averaging at 5.4ppg # FPL # GW37 # FPLCommunitypic.twitter.com/JZFZlADvsY'
75: b"In case Rashford doesn't play, who should take the first place on the bench to come on? # FPL # Gw37"
76: b"Feel like doing something crazy for GW 37. I have replaced the injured Vertonghen with a very interesting full back # FPL # GW37 Hint : This player is a legend of last year's GW 38"
77: b'Which option would you go for? # FPL # GW37'
78: b'An update from Spurs on Jan Vertonghen: # FFScout # FPL # GW37 # THFCpic.twitter.com/kqQfXa1a9D'
79: b'Anyone else considering captaining Sterling over Aguero? Seems like a risk worth taking at this stage of the season... # FPL # GW37'
80: b'OR Fail team selection # GW37 These are the selected - the filthy few, fighting for my # FPL glory in the next GW. DuffyShaw Aguero Predicted points: 57 All chips are used. I am 90!! points behind in my Mini-League - any advice welcome. Good luck all pic.twitter.com/pYTSxwknib'
81: b'Interesting "out-of-the-box" stats! # FPL # FPLCommunity # FantasyPL # GW37 https://twitter.com/foomnianalytics/status/1123982993356464130 \xe2\x80\xa6'
82: b'Scott Parker on Denis Odoi head injury: \xe2\x80\x9cHe\xe2\x80\x99s all good now, he\xe2\x80\x99s fine. His wife had a baby as well the other day so that\xe2\x80\x99s probably given him more of a headache than the concussion!\xe2\x80\x9d # wolful # FFC # FPL # GW37 https://twitter.com/FulhamFC/status/1123924857027272709 \xe2\x80\xa6'
83: b'Everton Calvert-Lewin Owned: 42% Last GW: 7.5 Total points: 195.5 Opponent: Burnley (H) Southampton Long Owned: 16% Last GW: 37.5 Total points: 128.5 Opponent: West Ham (A) # GW37 # Fantrax # togga # ToggaTrax # FPL # FantasyFootball # FantasyPL'
84: b'West Ham Snodgrass Owned: 47% Last GW: 5 Total points: 231 Opponent: Southampton (H) Fulham Babel Owned: 57% Last GW: 19 Total points: 155.5 Opponent: Wolves (A) # GW37 # FantasyFootball # FantasyPL # fantrax # FPL # togga'
85: b"| We've put together another panel of # FPL managers to answer your questions on end-of-season strategy... @ drbenmcnair @ FFCommunity_ @ FPL_ZB ANSWERS HERE https://www.fantasyfootballscout.co.uk/2019/05/02/fpl-question-time-how-to-close-out-the-season/ \xe2\x80\xa6 # FantasyPL # GW37"
86: b"Jota and other Wolves assets seem to be everyone's first choice for gw37 for Fulham. BUT, Wolves have a poor record against bottom half teams and Fulham are arguably in good form, playing much better under Scott Parker. Whitewash or red herring? # fpl # FPLCommunity # gw37"
87: b'Wolves Bennett Owned: 47% Last GW: 8.25 Total points: 199.25 Opponent: Fulham (H) Arsenal Sokratis Owned: 42% Last GW: 8.25 Total points: 104.25 Opponent: Brighton (H) # GW37 # fantrax # FantasyFootball # togga # FPL # FantasyPL'
88: b"We have another curious matchup with a referee, this time it's Arnautovic! # FPL # GW37 pic.twitter.com/OjlbvqPvVE"
89: b'Player Status Change Smalling DF MUN 5.6 Valencia DF MUN 6.4 Lingard MF MUN 6.7 Lukaku FW MUN 10.7 # FPL # GW37 http://www.fpl247.com'
90: b'Most Transferred out Today 1) Rashford FW MUN 7.3 9173 2) Son MF TOT 8.9 8806 3) Firmino FW LIV 9.4 4209 4) Duffy DF BHA 4.7 4121 5) Pogba MF MUN 8.5 3951 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
91: b'Most Transferred in Today 1) Pogba MF MUN 8.5 7852 2) Jota MF WOL 6.3 7120 3) Shaw DF MUN 5.0 6884 4) Jim\xc3\xa9nez FW WOL 6.9 6208 5) Wilson FW BOU 6.8 5794 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
92: b'Not given much thought to my squad management this week... any suggestions much appreciated, cheers 1 FT \xc2\xa30.0 ITB TC chip available # GW37 # FPL pic.twitter.com/tEAzXaUlAD'
93: b'Rashford looking good to go for this weekend. # FPL # GW37 https://twitter.com/MarcusRashford/status/1123964839142002693 \xe2\x80\xa6'
94: b'Who is the best replacement for Eriksen? Comments are welcome # FPL # GW37'
95: b'My prediction Son starts, im not selling he plays Bournemouth and they need a win to cement top 4. Its rather Eriksen who is leaving. # FPL # GW37 https://twitter.com/FFScout/status/1123958421911474176 \xe2\x80\xa6'
96: b"Looks like we're 99% settled on our squad for GW37. As it stands, we've got 6/11 players with under 10% ownership. It's either going to be a massive bonus, or an epic fail. Confirmed team will be revealed after last pressers tomorrow # FPL # GW37 # FPLCommunitypic.twitter.com/QWL8eVmALu"
97: b'# GW37 fixture analysis: Man City, LFC (Firmino/TAA), Man Utd & Hazard # FPL @ StatOnScout @ julesbreach @ MattKearney92 @ FPLpistolinas @ fplchancer @ hailcheaters @ BenDinnery @ ahopcroft13 +more # FantasyPL TY to all tagged # FPLCommunity https://www.thestatszone.com/fpl-gameweek-37-fixture-analysis-rested-city-firmino-minutes-man-utd-schedule-hazard-home-form \xe2\x80\xa6pic.twitter.com/DabJo3OjjT'
98: b'Ok guys, try to prioritize to build up a decent bench, could foresee rotations for teams already safe. For that I think I will build up my bench by upgrading Duffy to Shaw, then MAYBE Gray to Rashford if he is 100% fit to go. # FPL # FPLCommunity # FantasyPL # GW37 pic.twitter.com/XtV7TDy9WS'
99: b'The model has made an eyebrow-raising pick for the upcoming # GW37. Player | Club | Opponent | Probability of scoring >= 4 Pts Pierre-Emerick Aubameyang | Arsenal | Brighton & Hove Albion | 91% # FPL # MachineLearninghttps://twitter.com/raghoonandh/status/1044961058257960962 \xe2\x80\xa6'
100: b'Gunn Owners beware. # FPL # FPLCommunity # Fantasy # GW37 https://twitter.com/AdamBlackmore/status/1123953779685175296 \xe2\x80\xa6'
101: b'Pochettino on Vertonghen: "Today at 12pm was an appointment with a specialist, still we didn\'t receive the report. But after the game was good, he was more relaxed, I think he felt better. Now we need to receive the report from the specialist." # FFScout # FPL # GW37 # THFC'
102: b'Pochettino: "We\'re assessing the players today. The most important thing is that we will decide the best team to try to win. On Saturday we\'ll put the best players with the best energy to try to win." # FFScout # FPL # GW37 # THFC'
103: b'Mauricio Pochettino on whether any of his injured players could return for the second leg against Ajax: "I don\'t know. It\'s going to be difficult, yes." # FFScout # FPL # GW37 # THFC'
104: b'Wed\xc5\x82ug https://fplreview.com/team-planner/#forecast_table \xe2\x80\xa6 tak wygl\xc4\x85da prognoza punkt\xc3\xb3w na # gw37 # fpl pic.twitter.com/nhcxjGsoc0'
105: b'Decyzja jeszcze nie podj\xc4\x99ta, ale prawdopodobnie zrobi\xc4\x99 transfer Shaw za Duffyego. Inna opcja to wymiana Vardy -> Rashford. # fpl # gw37'
106: b'Goalscoring Probability for # GW37 from the bookies # FPL # FPLCommunitypic.twitter.com/LvgPgjcJCe'
107: b'Player Status Change Lascelles DF NEW 4.7 McCarthy GK SOU 4.3 # FPL # GW37 http://www.fpl247.com'
108: b'Hasenhuttl: "It\xe2\x80\x99s not necessary to rotate five or six players just because we are safe but for one or two, they will look at this match and the final game as a chance to get in the starting XI.\xe2\x80\x9d # FFScout # FPL # GW37 # SaintsFC'
109: b'# FPL # GW37 # OddsAnalysispic.twitter.com/mMLCJS8NwN'
110: b'Hasenhuttl: "The rest is normally OK, we have no injured players so far except for these two and Michael Obafemi. Lemina is an option for the weekend, Armstrong couldn\'t play from the beginning last game, he\'s an option." # FFScout # FPL # GW37 # SaintsFC'
111: b'Player Status Change Benteke FW CRY 6.3 Odoi DF FUL 4.4 Yoshida DF SOU 4.1 Cresswell DF WHU 5.0 Lanzini MF WHU 6.4 Arnautovic FW WHU 6.7 Sch\xc3\xbcrrle MF FUL 5.5 Carlos S\xc3\xa1nchez MF WHU 4.3 Nasri MF WHU 4.9 # FPL # GW37 http://www.fpl247.com'
112: b'Jamaal Lascelles pictured back in training. # FFScout # FPL # GW37 # NUFChttps://twitter.com/NUFC/status/1123941758746935297 \xe2\x80\xa6'
113: b'# FPL poll. Do you think Rafa Benitez will let Liverpool beat his # NUFC side in # GW37 by fielding a weakened side? Newcastle are safe & would Rafa want to miss out on the chance to be an # LFC legend by helping them potentially win the title'
114: b'Who is the best replacement for Rashford? Thinking Zaha? # FPL # FPLCommunity # GW37'
115: b'Stats pre- # GW37 1. Shots Inside Box 2. Goal Attempt Assists (Chances Created) 3. Goal Attempts Conceded Inside Box 4. Big Chances Conceded Thank you and have fun. # FPL pic.twitter.com/Bp9jFKKzzO'
116: b'Manuel Pellegrini: "We have the injuries for this week, just two players, Yarmolenko and Andy Carroll. All the other players are fit." # FFScout # FPL # GW37 # WHUFC'
117: b'Ralph Hasenhuttl: "Maya [Yoshida] is still not able to play. Jannik Vestergaard, the season is over because he has a small issue." # FFScout # FPL # GW37 # SaintsFC'
118: b'Spurs say that Serge Aurier (hamstring), Harry Kane (ankle), Erik Lamela (hamstring) and Harry Winks (groin) remain out this weekend, while Jan Vertonghen (head) continues to be assessed. # FFScout # FPL # GW37 # THFC'
119: b'CAPTAIN PICKS Summoned by special charter, @ SteveCook9 has the best captain choices for # FPL # GW37 that could well prove to be your own golden ticket in moving up the overall standings! https://fantasyfootball247.co.uk/fantasy-football-captain-picks-gameweek-37-2/ \xe2\x80\xa6'
120: b'WHAT TRANSFER WOULD YOU MAKE. \xc2\xa31m IN THE BANK # FPL # GW37 @ OfficialFPLpic.twitter.com/loujRqVtmN'
121: b'Roy Hodgson says Christian Benteke is "very unlikely" to play on Saturday after damaging his cheekbone. # FFScout # FPL # GW37 # CPFC'
122: b'@ ColmVHayes dives into the Gameweek 37 fixtures - http://bit.ly/2LjRpJr # FPL # GW37'
123: b'Scott Parker confirms that Denis Odoi (concussion) will miss out this weekend but Fulham are otherwise injury-free. # FFScout # FPL # GW37 # FulhamFC'
124: b'Who shall I captain this # GW37? # FPL'
125: b'Who in goal this weekend? # FPL # GW37'
126: b'Ep32 - # GW37 The Vardy Bus The comeback Spurs hate Bitterness European permutations Sell or hold Rashford & Vardy replacements Block or Play The fear of loss # FPL # Fantasyfootball # FantasyPL s & RTshttps://itunes.apple.com/au/podcast/fpl-take-the-hit/id1436811882 \xe2\x80\xa6'
127: b'You just know that @ OfficialFPL will come out with outrageous prices next season Sterling - \xc2\xa313m Salah - \xc2\xa314m Jimenez - \xc2\xa311m Jota - \xc2\xa310m Fraser - \xc2\xa310m Aguero - \xc2\xa313m TAA - \xc2\xa37m Robertson - \xc2\xa38m And STILL give us a \xc2\xa3100m budget. # FPL # GW37'
128: b'3.6% TSB Finally back from his red card ban, we fancy Deeney to make up for those he let down in GW34. 9G & 5A so far, averaging 2.2 shots/90, facing unreliable defences in Chelsea & West Ham. We think he could finish his season on double digit goals. # FPL # GW37 # FPLCommunitypic.twitter.com/JCJwbbz9m9'
129: b'Benteke unlikely to be fit for this weekend # FPL # GW37 https://twitter.com/CPFC/status/1123928878806970371 \xe2\x80\xa6'
130: b'Is Rashford going to be fit for this week? If not, suitable replacements? # GW37 # FPL'
131: b'Cardiff Etheridge Owned: 48% Clean sheets: 9 Saves: 127 Save percentage: 65.8% Last GW: 0.5 Total points: 237.25 Opponent: Palace (H) # GW37 # fanrax # togga # FPL # FantasyPL # FantasyFootball'
132: b'# GW37 benching dilemma! Help! # FPL'
133: b'Gameweek 37 Captaincy Video Join @ DavidMunday815 and @ SkontoRigga live over on our YouTube channel now as they discuss the main contenders for the armband: https://www.youtube.com/channel/UCKxYKQ8pgJ7V8wwh4hLsSXQ/live \xe2\x80\xa6 # FFScout # FPL # GW37 # FantasyPL'
134: b"Trent Alexander-Arnold and Roberto Firmino were benched last night - good news for their owners ahead of Gameweek 37. Here's what Jurgen Klopp had to say about those two players and his team selection at the Nou Camp: https://www.fantasyfootballscout.co.uk/2019/05/02/klopp-explains-team-selection-as-liverpool-impress-in-barca-defeat/ \xe2\x80\xa6 # FPL # GW37 # LiverpoolFC # LFC"
135: b'Manuel Pellegrini says that, other than Andriy Yarmolenko and Andy Carroll, "everyone else is fit". # FFScout # FPL # GW37 # whufc'
136: b'Brendan Rodgers on Leicester\'s team news: "At this moment, everyone is OK." # FFScout # FPL # GW37 # LCFC'
137: b"13 league starts for Aguero at the Etihad this season and he hasn't blanked in one of them (15 goals, eight assists). # FPL # GW37"
138: b'Pts from Goals, Assists, Bonus & Clean Sheets Sterling- 168pts (2590mins) Aguero- 139pts (2281mins) Per 90 Sterling: 5.84pts Aguero: 5.48pts The odds data points in the same direction, yet Serg is the popular pick. Do people think Raz will be rested? # FPL # FPLCommunity # GW37'
139: b'Player Status Change Mina DF EVE 5.4 # FPL # GW37 http://www.fpl247.com'
140: b'Getting ready for # GW37? # FPL'
141: b'NEW # FPL VIDEO @ ffh_will discusses all things # GW37 Man United - Form vs Fixtures Vardy - time to ditch? New OPTA tool preview Captaincy RTs & subs appreciated https://www.youtube.com/watch?v=BO1TRVaOM3A&feature=youtu.be \xe2\x80\xa6'
142: b'# GW37 tips in our latest collab with @ FootballAdvice5. Topics covered... Spurs assets Manchester United players Striker picks for Wilcard teams # FPL # FPLCommunity @ OfficialFPLhttp://www.footballadvice.co.uk/gw37-fpl-guest-question-and-answer/ \xe2\x80\xa6'
143: b'Marco Silva on Yerry Mina and Theo Walcott: "They are OK, they are working with the team, they are fit." # FFScout # FPL # GW37 # EvertonFC'
144: b'NEW POST - fantasy premier league GW37 \xe2\x80\x93 captain options analysed plus transfer poll results We look at bookies odds, the polls, who FFGeek contributors are captaining and a bunch of stats https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-captain-tips-gw37-transfers/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcaptain # fantasypl # GW37 pic.twitter.com/eAUHzNfeUr'
145: b'# GW37 Guest Q&A featuring @ LetsTalkSoccer2 What to do with Son and Eriksen? Time to buy United players? Best Triple Captain options Top strikers http://www.footballadvice.co.uk/gw37-fpl-guest-question-and-answer/ \xe2\x80\xa6 # FPL # FPLCommunity # pogba # rashford # son # eriksen'
146: b'Grant has climbed to the top of influencers list ahead of # GW37! # FPL pic.twitter.com/3VSmlYm1Rt'
147: b'Not sounding good for Lukaku in # GW37 at this stage, Ole Gunnar Solskjaer press conference tomorrow # FPL # HUDMUNhttps://twitter.com/HLNinEngeland/status/1123845540561682432 \xe2\x80\xa6'
148: b'Where to go from here? Need help? # FPL # GW37 # FPLCommunitypic.twitter.com/AlBFYLP4dS'
149: b'As promised; here is the updated version of the Goal Involvement vs Expected Goal Involvement chart # FPL # Stats # GW37 # IsHazardEssentialpic.twitter.com/AlZVB8ujIw'
150: b'Nuno Espirito Santo: "We must give Will [Norris] a chance. Hopefully, I will try. I would like to finish the season with all the players having minutes in the Premier League. I would really, really like that.\xe2\x80\x9d # FFScout # FPL # GW37 https://twitter.com/tim_spiers_Star/status/1123868134635659264 \xe2\x80\xa6'
151: b'# FPL # FPLCommunity # FantasyPL # GW37 # upthepod https://twitter.com/FPLSurgery/status/1123423754443468801 \xe2\x80\xa6'
152: b"We've got a bumper week of Ones to Watch for GW37. With 5 down and 4 more to go, we're giving to plenty of differentials to pick from for this weekend's football. # FPL # GW37 # FPLCommunitypic.twitter.com/64ugiRe7q8"
153: b'Thanks @ FFScout - all over the pressers as usual. # FPL # fplcommunity # GW37 https://twitter.com/FFScout/status/1123842799600898048 \xe2\x80\xa6'
154: b'We replace Tommy P with a bottle of red to discuss the business end of the FPL season. # FPL # FPLCommunity # GW37 https://anchor.fm/four-four-effing-two/episodes/Undisclosed-Greek-Island-e3te3j \xe2\x80\xa6'
155: b"# FPL # GW37 If Hazard really is going to leave this summer will his performances the next two GW's reflect a desire to give everything to get Chelsea into the ECL or to play not to get injured? If the former can someone lend me 0.1 please"
156: b'What are everyone\xe2\x80\x99s thought on # GW37 transfers? Currently I am considering dropping a Liverpool midfielder, Salah or Mane for a united midfielder, big gamble but united have to get goals to close up Chelsea\xe2\x80\x99s goal diff, plus Huds or just poor! # FPL'
157: b'Most Transferred out Today 1) Rashford FW MUN 7.3 2141 2) Son MF TOT 8.9 2133 3) Pogba MF MUN 8.5 1006 4) Duffy DF BHA 4.7 962 5) Firmino FW LIV 9.4 957 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
158: b'Most Transferred in Today 1) Pogba MF MUN 8.5 1916 2) Jota MF WOL 6.3 1651 3) Shaw DF MUN 5.0 1597 4) Wilson FW BOU 6.8 1564 5) Jim\xc3\xa9nez FW WOL 6.9 1430 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
159: b"# FPL CAPTAINCY POLL Who gets the armband for # GW37? Comment if you're on someone else"
160: b'Press conference times Rodgers - 9am Silva - 11am Pochettino - 12:30pm Pellegrini - 12:30pm Hodgson - 1pm Parker - 1pm Hassnh\xc3\xbcttl - 2pm # FPL # FantasyPL # FFScout # GW37'
161: b'IF YOU MISSED LIVE AND WANNA WATCH THE REPLAY OF OUR GW37 PREVIEW THEN SIMPLY CLICK THE LINK BELOW https://youtu.be/Fj38RhmlfnU # fpl # fantasyfootball # gw37 # fplcommunity # FantasyPL # ffscout @ OfficialFPL @ FFScout @ talkSPORT @ Superbrupic.twitter.com/QW6e8wFGNQ'
162: b'The best players for Gameweek 37 according to @ FFScout_Paul, @ ffscout_az, @ SkontoRigga and Peter Kouwenberg. Get well soon, @ FFScout_Joe. https://www.fantasyfootballscout.co.uk/2019/05/02/the-scout-squad-for-fpl-gameweek-37/ \xe2\x80\xa6 # FPL # GW37 # fantasypl'
163: b'Overnight players unavailable Keita MF LIV 7.1 Cahill DF CHE 5.0 # FPL # GW37 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
164: b'Overnight players available Fabinho MF LIV 5.5 # FPL # GW37 http://www.fpl247.com/player/returning \xe2\x80\xa6'
165: b"I think I'm going to stick this week. No transfers - double FT in # GW38. Salah captain to counter top in ML. Long in form, so stays in the XI. Rank = 203k Target = 150k # FPL # FPLCommunity # GW37 @ WGTA_FPL @ LetsTalkSoccer2 @ FPL_Connect @ hailcheaters @ FFScoutpic.twitter.com/eF63aZZju4"
166: b'Ep32 - # GW37 The Vardy Bus The comeback Spurs hate Bitterness European permutations Sell or hold Rashford & Vardy replacements Block or Play # FPL # Fantasyfootball # FantasyPL s & RTshttps://soundcloud.com/fpl-take-the-hit/fpl-take-the-hit \xe2\x80\xa6'
167: b'How much do we think next season? \xc2\xa35.0 or \xc2\xa35.5?? Will he be in your squad? # fpl # gw37 # FPLCommunityhttps://twitter.com/Mark__Bright/status/1123363608916844544 \xe2\x80\xa6'
168: b'Worried about this type of rotation at the end of the season. But not surprising though. I guess I need to fix my bench. It still houses triple BHA defense! # FPLCommunity # FPL # FantasyPL # GW37 https://twitter.com/JoeEdwards_Star/status/1123702785269207042 \xe2\x80\xa6'
169: b'Player Status Change Cahill DF CHE 5.0 # FPL # GW37 http://www.fpl247.com'
170: b'Eden Hazard plays Watford at Stamford Bridge in GW 37 HOME FORM appearances Goal or assist contributions Double digit hauls Blanks For mini league and OR chasers: At 25% ownership he could be a great DIFFERENTIAL CAPTAIN option this week! # fpl # gw37 pic.twitter.com/xolxjiSdki'
171: b'Player Status Change Keita MF LIV 7.1 Firmino FW LIV 9.4 # FPL # GW37 http://www.fpl247.com'
172: b'The two finalists of our FFS Cup revealed: https://www.fantasyfootballscout.co.uk/2019/05/01/the-ffs-cup-final-is-all-set-for-gameweek-37/ \xe2\x80\xa6 # FPL # GW37 # FantasyPL'
173: b'Well I was mulling over Trent v Robertson this week. With Trent not featuring tonight and Gomez offering absolutely nothing against Barcelona, I think that makes my decision quite easy. Gives me a lot more cash to take a punt in GW38 # FPL # GW37'
174: b'I am seriously considering taking a punt on San\xc3\xa9 # GW37 # FPL'
175: b"Tomorrow morning. A brand new episode of our # FPL podcast 'All Out Attack' will be ready for you to download! We chat... Promoted championship players # GW37 fixtures A pick from @ FFPundits A look back at # GW36https://www.spreaker.com/show/all-out-attack-an-fpl-podcast \xe2\x80\xa6"
176: b'Happy new month my # FPLCommunity Here to highlight some exciting picks ahead of # GW37 # FPL pic.twitter.com/afp8LYhNBp'
177: b'# FPL # FPLCommunity # FantasyPL # GW37 https://twitter.com/foomnianalytics/status/1123512017032237056 \xe2\x80\xa6'
178: b'THANK YOU TO ALL THAT JOINED US FOR OUR LIVESTREAM PODCAST PREVIEWING GW37 https://youtu.be/Fj38RhmlfnU @ OfficialFPL @ FFScout # gw37 # FPL # fantasyfootball # FPLCommunity # ffscout # FantasyPL # premierleaguepic.twitter.com/FB30zF2LOi'
179: b'Ok people, this lack of podcasts is really ALL YOUR FAULT. We refuse to accept any responsibility... That said, we accept your apology. Please send over # FPL # GW37 questions AND # TalkinTogga semi-finals & finals questions for @ FantasyYIRMA, @ fantasygaffer & @ BangAverageMikepic.twitter.com/eNk8m7Ubrm'
180: b'Hit or no hit? # FPL # GW37'
181: b'# FPL # GW37 early preps. My assumptions: ->Leicester to score vs City so bench Laporte. ->A Jota party this weekend at home vs Fulham. What do you think? pic.twitter.com/ZnGES8yI4c'
182: b"Right who wants to be the penultimate person to face our # FPL Renegade Squad? An amalgamation of our 3 squads vs your # GW37 squad. Winning margin to beat is 9 pts from @ FPLGreenArrow Winner gets \xe2\x82\xac50 voucher & mug Like/comment/retweet to show your interest & we'll play one"
183: b'# FPL # FPLCommunity # FantasyPL # GW37 # captainpickshttps://twitter.com/fplreview/status/1123568297952333824 \xe2\x80\xa6'
184: b'20 mins till the @ elitefpl live stream previewing everything GW37 claxon!!! tune in if you need some tips and tricks for them all important captaincy/transfer decisions!! # fpl # fantasypremierleague # gw37 # elitefpl https://twitter.com/elitefpl/status/1123638521355546625 \xe2\x80\xa6'
185: b'Captain for # GW37? # FPL'
186: b'http://YOUTUBE.COM/ELITEFPLPODCAST @ OfficialFPL @ FFScout # fpl # fantasyfootball # gw37 # fplcommunity # FantasyPL # ffscoutpic.twitter.com/UaNCI9KDWU'
187: b'If you need any advice for # GW37 let us know, Algo is here to help! # FPL'
188: b"# FPL # FPLCommunity # GW37 Pereira Digne Jota Toyed with dropping Son, but couldn't decide on a replacement. So decided to fix my weakest link to the in-form Digne @home v Burnley. pic.twitter.com/x4PflogtVq"
189: b'GW37 Teamsheet Eriksen Pogba Aguero 18,194 Top 10K # fpl # FantasyPL # GW37 pic.twitter.com/uT4xqHAWEU'
190: b'3.7% TSB Possibly our favourite bargain enabler for the last 2GW \xe2\x80\x94 Valery. With 5 returns in his last 10 appearances, ending with Huddersfield in GW38 in particular, his attacking potential adds to any CS appeal. # FPL # GW37 # FPLCommunitypic.twitter.com/oeoFNXcmFP'
191: b'No goals from open play in almost three months and averaging 3.3 points per match over the last ten Gameweeks - is there any case for Paul Pogba in # GW37 and # GW38? We assess his Fantasy credentials https://www.fantasyfootballscout.co.uk/2019/05/01/the-fpl-digest-is-pogba-worth-buying-for-gameweeks-37-and-38/ \xe2\x80\xa6 # FPL # MUFC'
192: b'So who is/has piled into United players ahead of # GW37? If so, who did you go for? # FPL # FPLCommunity # Pogba # Rashford'
193: b'This also means we can now generate you combinations like this for # GW37 & # GW38, so let us know if you have any questions # FPL pic.twitter.com/YuNMoq1mtK'
194: b'# Eriksen to # Pogba, YES or NO? # FPL # GW37'
195: b'Nice analysis of the # WOLFUL match. # FPL # FPLCommunity # FantasyPL # GW37 https://twitter.com/Fantasy_B0T/status/1123590239979802626 \xe2\x80\xa6'
196: b'Certainly makes you think about him.... Would like to know what is happening with Lukaku first though. # FPL # GW37 https://twitter.com/hailcheaters/status/1123609485954703360 \xe2\x80\xa6'
197: b'Most Transferred out Today 1) Rashford FW MUN 7.3 6949 2) Son MF TOT 8.9 5576 3) Firmino FW LIV 9.4 4844 4) Pogba MF MUN 8.5 3676 5) Fraser MF BOU 6.3 2537 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
198: b'Most Transferred in Today 1) Jota MF WOL 6.3 4847 2) Wilson FW BOU 6.8 4719 3) Jim\xc3\xa9nez FW WOL 6.9 4667 4) Pogba MF MUN 8.5 4069 5) Zaha FW CRY 6.9 3377 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
199: b'GW37 Goalkeeper Poll Who is more likely for a CS in GW37? Alisson \xe2\x80\x94 NEW (A) or Guaita \xe2\x80\x94 CAR (A) # FPL # GW37 # FPLCommunity'
200: b'NEW POST - Rob Reid @ Thefpl_vet with his fantasy premier league GW37 player picks Rob has finished 3 of the last 4 seasons in the top 0.5% of FPL managers https://www.fantasyfootballgeek.co.uk/rob-fantasy-premier-league-gw37-player-picks/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW37 pic.twitter.com/tFxIDHtWuA'
201: b'One. Last. Time. # FPL # GW37 pic.twitter.com/vGXyAjGqu9'
202: b'Player Status Change Lennon MF BUR 4.9 # FPL # GW37 http://www.fpl247.com'
203: b'Crouch is back - away to Everton, home to Arsenal in # GW37 & # GW38 \xc2\xa34.4m | 0.9% owned Differential? # FPL # FPLCommunitypic.twitter.com/WZN6LjrauF'
204: b'Think you can beat our # ScoutPicks? Prove it! One # CommunityChampion is chosen to go against our GW37 # FPL picks Do you have what it takes? # fantasyPL # GW37 For details on how to enter go to @ FFScout:https://www.fantasyfootballscout.co.uk/2019/05/01/the-vertonghen-latest-as-spurs-struggle-for-goals-ahead-of-gameweek-37/?hc_page=4&hc_sort_by=comment_date#hc_comment_20316721 \xe2\x80\xa6'
205: b'\xe2\x80\x9cMarcus Rashford was forced off with a shoulder injury against Chelsea on Sunday but did ball-work this morning and should be available for the Huddersfield game.\xe2\x80\x9d # FPL # GW37 https://twitter.com/samuelluckhurst/status/1123563591926452224 \xe2\x80\xa6'
206: b'http://YOUTUBE.COM/ELITEFPLPODCAST # fpl # fantasyfootball # gw37 # fplcommunity # FantasyPL # ffscout @ OfficialFPL @ FFScoutpic.twitter.com/A5yHaIHp3Q'
207: b'Dyche on Aaron Lennon: "He certainly won\'t make it for the Everton game and I think it\'s unlikely [for the Arsenal game]. I think he\'ll be fit but he wouldn\'t have had a game. It\'s unlikely that we\'ll put him back into action." # FFScout # FPL # GW37 # twitterclarets'
208: b'Dyche: "I think Crouchy will come back into the thinking, he\'s trained last week and looked good. Bardo will hopefully come back into the thinking as well. He\'s only had a couple of days training but it was a cut, so no twists or strains." # FFScout # FPL # GW37 # twitterclarets'
209: b"Looking to bring out Eriksen & Vardy for Milivojevic/Jota & Ag\xc3\xbcero. Or do you have any other suggestions? Considering Shaw for Trippier as well but not sure he's worth the hit... # FPL # GW37 pic.twitter.com/4nrtWK7Yxc"
210: b'Aguero vs Sterling. Part 2. # MCILEI # GW37 # FPL https://twitter.com/rogue_wee/status/1123589292847259650 \xe2\x80\xa6'
211: b"Diogo Jota- 23pts in last 2. 2nd highest xG at WOL and plays up front. A good pick for one game! Again wouldn't recommend bringing him in now though. But worth a place in starting lineup if you have him and not worth moving out! # FPL # FPLCommunity # GW37 # WOLFUL"
212: b'Talked it through extensively on this week\'s podcast but I\'m still debating a "defense vs. attack" approach for # GW37. 2 FTs, .4m available, 780 OR, and a 50+ pt mini-league lead. The sensible move is Duffy to Shaw, but what to do with the other FT? Hold for GW38? # FPL pic.twitter.com/EyQ5nmMGVi'
213: b'Great thread for # GW37! Definitely helped me clear my thoughts! # FPL # FPLCommunityhttps://twitter.com/fplreview/status/1123568297952333824 \xe2\x80\xa6'
214: b'Thoughts? Son > Hazard (C)* Vardy > Zaha -4 I feel like I\xe2\x80\x99ve had my Vardy party and it might be time to jump off. Hazards home form and points are off the charts! *Subject to Europa eye test # fpl # FPLCommunity # gw37'
215: b"Unai Emery adds that Aaron Ramsey won't be fit enough to play for Arsenal again even if the Gunners make the Europa League final. # FFScout # FPL # GW37 # ArsenalFC"
216: b'Sean Dyche says that Peter Crouch (appendix), Phil Bardsley (gashed leg) and Robbie Brady (personal reasons) are in contention ahead of Gameweek 37. # FFScout # FPL # GW37 # twitterclarets'
217: b"[1/6] # GW37 THREAD In this thread I'll summarise the http://www.fplreview.com/team-planner Odds & xG based projections Looking at captains, MCI players are more nailed and Sterling has the highest points projection. Salah, Haz & Serg are great alternative choices # FPL # FPLCommunitypic.twitter.com/RMD6qJNjcB"
218: b'Marcus Rashford and Phil Jones were also spotted in training today. # FFScout # FPL # GW37 # MUFC'
219: b'Rashford has trained today with United to give hopes of him playing at the weekend. No mention of news from Lukaku. # FPL # GW37 # FPLCommunitypic.twitter.com/5YIBsICkqi'
220: b'Average FDRs for remaining FPL Gameweeks (GW37-38) sorted in order of difficulty (easiest to hardest), then team (A-Z): 2.0 - CRY, MUN 2.5 - ARS, FUL, MCI, SOU, TOT, WHU 3.0 - BOU, CAR, CHE, EVE, HUD, LIV, NEW 3.5 - BUR, WAT, WOL 4.0 - BHA 4.5 - LEI # FPL # GW37 # GW38 # FPLCommunitypic.twitter.com/iKFQZ9gefi'
221: b'Antonio Valencia has been pictured back in training with Manchester United today. # FFScout # FPL # GW37 # mufchttps://twitter.com/ManUtd/status/1123555454695686145 \xe2\x80\xa6'
222: b'# FPL # FPLCommunity Huge decision ahead, have chased down my rival from over 100 points behind to 11 clear with 2 GW\xe2\x80\x99s left. Who to captain?! # GW37 # Captain # KingPrawn'
223: b"Press conference times Dyche - 1.15pm ...and that's it, although we'll also get the thoughts of Messrs Sarri and Emery ahead of their Europa League ties. # FPL # FantasyPL # FFScout # GW37"
224: b'4.9% TSB Redmond is a divisive figure in FPL. Often promising much, but delivering little. However, Hasenh\xc3\xbcttl seems to have found a solution to his form. 2 goals & 1 assist in 5GW, amounting to 26pts (5.2ppg) offers good value on a low cost investment # FPL # GW37 # FPLCommunitypic.twitter.com/Q4FkQa0i2c'
225: b'Eriksen to Pogba for # gw37?? Classic case of fixtures over form in the case of the United midfielder - Hud (a) & Car (h) next! # FPL # THFC # MUFC http://fantasyfootballhub.co.uk/fpl-player-comparision-tool \xe2\x80\xa6pic.twitter.com/7DxsfDw8WT'
226: b"An update on Jan Vertonghen's head injury plus a review of Spurs 0-1 Ajax: Alli at the tip of a 4-4-2 diamond Eriksen deeper Son suspended and fresh for Gameweek 37 Pochettino's comments about a lack of energy https://www.fantasyfootballscout.co.uk/2019/05/01/the-vertonghen-latest-as-spurs-struggle-for-goals-ahead-of-gameweek-37/ \xe2\x80\xa6 # FPL # GW37 # THFC"
227: b"3 transfers made so far for # GW37, 2 free and 1 hit. Despite my advice yesterday re: hits. Really hoping they pay off, and that my bench doesn't accumulate double digit points again # FPL"
228: b'So I\xe2\x80\x99m not sure which player to take out. I\xe2\x80\x99m between Ryan and Laca. But I\xe2\x80\x99m fine with rolling a FT this week so I can go all out next week. 0.1 ITB Leading my my mini-league so I don\xe2\x80\x99t need to take risks. What would you do? # FPL # FPLCommunity # GW37 pic.twitter.com/KqREMcfuvL'
229: b"Arsenal confirm that Denis Suarez (groin) will miss the rest of the season. Aaron Ramsey (hamstring) won't be available for Thursday\xe2\x80\x99s match against Valencia, while Nacho Monreal (calf) is being assessed. There was no update on Mesut Ozil (foot). # FFScout # FPL # GW37"
230: b'Captaincy poll alert # FPL # GW37'
231: b'How are your preparations for # GW37 going? # FPL'
232: b'Player Status Change R\xc3\xbcdiger DF CHE 5.9 # FPL # GW37 http://www.fpl247.com'
233: b'Really enjoyed tuning into this lads, very good topic. And well done for chatting about overmanagement, even if it means people take your advice and steer away from reading too much on here. Although the # FPL addict in me would beg to differ!!! Good luck in # GW37 https://twitter.com/WGTA_FPL/status/1123173535260790789 \xe2\x80\xa6'
234: b"I'm up to 200 followers now!! Thanks everyone in the # FPLCommunity! It's nice, because it means I have more people to interact with about # FPL stuff. It's good to have a group of like minded people to chat with. Hope # GW37 goes well for you all"
235: b'Antonio Rudiger underwent knee surgery yesterday and will miss the rest of the season as a result. # FFScout # FPL # GW37 # ChelseaFC'
236: b"I'm looking at SIGURDSSON For # GW37 against Burnley. 11 points in the reverse fixture. An assist and a goal. I reckon it'll be a much more open game and Everton have been in top form. I prefer him to any Man U assets despite the fixtures. Any takers? # FPL # FPLCommunitypic.twitter.com/yXzh2sSFjR"
237: b'A touch of magic is required to harvest points from the two remaining gameweeks. # follo4folloback to concluded 2018/19 # FPL season with a deft finish! # GW37'
238: b'Player Status Change Fabinho MF LIV 5.5 # FPL # GW37 http://www.fpl247.com'
239: b'Check out players leading our Power Index chart ahead of # GW37! # FPL pic.twitter.com/jhxwsMMqzS'
240: b'Sterling or Aguero for # GW37 captaincy? Sterling: more points over last 2 seasons potential clean sheet point extra point for a goal Aguero: more points/shots/expected goals in last 3 games penalty duties Golden Boot race Who are you backing? # FPL'
241: b"CAPTAIN POLL Who's your man for # GW37? If other, please comment. # FPL"
242: b'The Final Countdown | Gameweek 37 | FPL 2018/2019 https://youtu.be/xo2OXEcA9BE The penultimate game of the season! Title to chase, Champions League places to be decided and fixtures are looking good for the top 6. Who will you be backing this weekend? # FPL # FPLCommunity # GW37'
243: b"There's quite a few good captaincy options for # gw37 in # FPL Who are you backing with the armband this weekend?"
244: b'Babak Semifinal # CisewuInvitationLeague # GW37 # FPL @ OmFPL vs @ ClaretsFpl @ pisangij01 vs @ SukaFPL'
245: b'# FPL TIPS In his last article of the season, @ theswirly has, as usual, smashed through the word limit - and then some! Take a break, settle down and have a read through detailed cases for his essential players this # GW37. https://fantasyfootball247.co.uk/fantasy-football-tips-gameweek-37-2/ \xe2\x80\xa6'
246: b'First season on Twitter. So, what do you guys do over the break until the new season starts? # FPL # GW37'
247: b'NEW POST - Fantasy premier league GW37 captain poll \xe2\x80\x93 plus a who are you transferring in and out poll? https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-gw37-captain-poll-transfer/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW37 # eplfantasy # fplMY # fplupdates # fplislife # fantasypremierleagueislife # FPLus # fpltreviewpic.twitter.com/D1PvwMqKuR'
248: b'Best potential for points for the last two fixtures, Duffy/Dunk replacement. # FPL # FPLCommunity # GW37 # GW38'
249: b"Son could be a bit of a differential this week. Don't know why people are selling him. Get this He has scored 5 goals in his last 4 appearances against Bournemouth and he didn't play last night differential captain anyone # FPL # GW37 pic.twitter.com/UhvhDq7gBt"
250: b'This week\xe2\x80\x99s transfer options. Which one? For context I own Aguero and will captain him if no Sterling. If I decide to bring in Sterling I will stick the armband on him. A \xe2\x80\x94 Vertonghen \xe2\x86\x92 Laporte B \xe2\x80\x94 Vertonghen \xe2\x86\x92 Valery and Eriksen \xe2\x86\x92 Sterling (-4) # FPL # GW37'
251: b'# breakfast perfect timing # FPL # FPLCommunity # FantasyPL # GW37 # uptheamigoshttps://twitter.com/3AmigosFPL/status/1123483942714269696 \xe2\x80\xa6'
252: b'# FPL managers, @ KylieFpl, @ marz05 & @ TheMarpleCurse are back for # GW37 to tackle your big questions. We talk options from title chasings candidates, those in a race to avoid Champions League, and more! Note: small GoT spoiler referenced in this episode! https://soundcloud.com/user-37374889/t3a-gw37-fpls-long-knight \xe2\x80\xa6'
253: b'Most Transferred out Today 1) Rashford FW MUN 7.3 1963 2) Son MF TOT 8.9 1725 3) Firmino FW LIV 9.4 1316 4) Pogba MF MUN 8.5 1120 5) Fraser MF BOU 6.3 802 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
254: b'Most Transferred in Today 1) Jota MF WOL 6.3 1490 2) Wilson FW BOU 6.8 1374 3) Jim\xc3\xa9nez FW WOL 6.9 1311 4) Pogba MF MUN 8.5 1203 5) Shaw DF MUN 5.0 990 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
255: b'Fixtures v Form Vardy 81 points in ten Gameweeks, but faces Man City (away) and Chelsea (home) in # GW37 and # GW38. Worth considering? # FPL # FPLCommunitypic.twitter.com/rDlSiX2KDY'
256: b'I look forward to it! Stay tuned # FPL # FPLCommunity # FantasyPL # GW37 # GW38https://twitter.com/FPLwivespodcast/status/1123478441414864898 \xe2\x80\xa6'
257: b'Listened on the way to work Concise, no drama podcast. Excellent - give it a listen... # FPL # FPLCommunity # GW37 # GW38https://twitter.com/FPLGeneral/status/1123286935370436609 \xe2\x80\xa6'
258: b"# gw37 this is how I'm likely to set up? Mitro or Eriksen the only dilemma. # fpl pic.twitter.com/Kqv7FHlDlU"
259: b"In # GW37 & # GW38 Pogba is the classic fixtures v form conundrum! Just one week score over 5 points in the last 10, but, he's playing Huddersfield (away) and Cardiff (home) in the last two matches! Worth considering? # FPL # FPLCommunitypic.twitter.com/WR79hTo1AO"
260: b"We've given time to pass for # FPL # GW37 captaincy options to settle in and we have settled on these 4 options ahead of this weekend. Who gets your vote - Aguero, Salah, Jimenez or Hazard?"
261: b'Overnight price fallers Duffy DF BHA 4.7 # FPL # GW37 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
262: b'Overnight price risers Long FW SOU 4.7 Wan-Bissaka DF CRY 4.6 Wilson FW BOU 6.8 # FPL # GW37 http://www.fpl247.com/player/price/weekly?change=rise \xe2\x80\xa6'
263: b"On this week's Scoutcast we discuss: Vardy form fixtures Man Utd fixtures form End-of-season tactics WATCH HERE https://www.youtube.com/watch?v=DJiBFj9jYCA \xe2\x80\xa6 # FPL # FantasyPL # FFScout # GW37"
264: b'Overnight players unavailable Vertonghen DF TOT 5.9 # FPL # GW37 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
265: b'Overnight players available Sissoko MF TOT 4.9 # FPL # GW37 http://www.fpl247.com/player/returning \xe2\x80\xa6'
266: b'Amazing score from the Plonker Smashed it. Tight # fpl # podcast focused on top picks for # GW37 with the usual saucy delivery. Succinct 20 mins and nicely produced, you should find time to get a bit of the plonker in your life. https://twitter.com/Fantasy_Plonker/status/1122932373832728581 \xe2\x80\xa6'
267: b"Anyone sticking the captain's armband on Jimenez this weekend or bringing in Jota for # WOLFUL? # FPL # GW37"
268: b'Who to bring in? # GW37 # FPL'
269: b'Early transfer plan for GW37 Eriksen \xe3\x80\x8b Pogba Duffy \xe3\x80\x8b Shaw (-4) Lloris Laporte Robertson Shaw Pogba Son Mane Firmino Jimenez Aguero 1 more player either Doherty or JWP Captain either Aguero or Pogba but more likely on Aguero considering form >fixture. # fpl # gw37 pic.twitter.com/gT1J9DGaF8'
270: b"131st EPISODE OF THE # FPL SURGERY PODCAST Who needs the Iceman when you have two of FPL Surgery's finest in @ UtterlyTC and @ FPL_Houghts Here to discuss # Gw37 and guide you through the last 2 GW's of the season https://soundcloud.com/fplsurgery/131stEpi \xe2\x80\xa6 # GW37 # upthepod"
271: b"Dare I say that Felipe, the gloved magician, is a possible punt these last two game weeks? He's starting to get in dgaf mode these last four weeks. Yay or nay? # fpl # gw37 pic.twitter.com/A5BIoPoDkP"
272: b'Top 4 Home & Away: MCI/LIV home ATK/DEF form ARS home scoring form MCI/LIV away DEF form TOT/MUN away ATK form but DEF # GW37: TOT/MU can match MCI/LIV away ATK but DEF are leaky. # FPL # FPLCommunity # FantasyPLpic.twitter.com/BCv30H8XbB'
273: b'Always loved his content. Great graphics and commentary. Check out his # GW37 selection video here. # FPL # FPLCommunity # FantasyPLhttps://twitter.com/_FPLtips/status/1123308580382420993 \xe2\x80\xa6'
274: b'Price Changes (5/1/2019) Risers: Wilson \xc2\xa36.8m Wan-Bissaka \xc2\xa34.6m Long \xc2\xa34.7m Fallers: Duffy \xc2\xa34.7m # FPL # GW37 # FPL_Price'
275: b'FPL OFFICIAL Price Changes (5/1/2019) Overnight Risers: Wilson \xc2\xa36.8m Wan-Bissaka \xc2\xa34.6m Long \xc2\xa34.7m Overnight Fallers: Duffy \xc2\xa34.7m # FPL # GW37 # FPL_PriceChanges # Aye'
276: b'Player Status Change Vertonghen DF TOT 5.9 Sissoko MF TOT 4.9 # FPL # GW37 http://www.fpl247.com'
277: b'# FPL # FPLCommunity # GW37 Eriksen or Moura Babel for a -4...?'
278: b'# FPL # FPLCommunity With Rudiger out for the remainder of the season, does this mean Christensen is nailed on for the final 2 league games? I ask as I am pretty set on Duffy Shaw for # GW37 but would consider and prob should consider Christensen. Any thoughts on this?'
279: b'Lots of differing opinions on Son from our earlier tweet. Does Son start vs BOU? # FPL # GW37 # FPLCommunity'
280: b'Pretty sure I\xe2\x80\x99m moving out Eriksen now but for who? # FPL # FPLCommunity # GW37'
281: b'Awesome time recording this week\xe2\x80\x99s episode of the @ FPLSurgery podcast with the superb @ FPL_Houghts (well worth a follow ), hosted by the always excellent @ thebull2015 - hope the listeners don\xe2\x80\x99t miss The Iceman @ JamesDrewery too much! # UpThePod # RightUpThere # GW37 # FPL'
282: b'GW37 clean sheet odds LIV: 50% MNU: 50% MCI: 49% ARS: 46% CHE:43% EVE: 43% WOL: 43% TOT: 31% CAR: 29% CRY: 27% WHU: 25% SOU: 21% BUR: 18% BOU: 17% FUL: 16% BHA: 13% HUD: 13% NEW: 13% WAT: 13% LEI: 8% https://www.fantasyfootballscout.co.uk/comment/20315054 \xe2\x80\xa6 # FPL # GW37 # xCS # FridayKickOff # Dontgetcaughtout'
283: b'Anyone come across a source for accurate predictions in the Premier League games? A source you always go to without question? # FPL # FF # FPLCommunity 2 FT\xe2\x80\x99s incoming for # GW37 but need to get them right in 1 of my ML\xe2\x80\x99s. And of course better if.... pic.twitter.com/rYUyokfpKy'
284: b'GW37 Transfer Poll Which pays off more here...? Son (bou) Hazard (WAT) or JWP (whu) Antonio (SOU) # FPL # GW37 # FPLCommunity'
285: b"Fancy Hazard at home to Watford. The hornets have nothing to play for and I'm sure they have an eye on the FA Cup final. Hazard could be playing his last game at the bridge and a goal or two is not beyond him. # GW37 # FPL"
286: b'# FPL # FPLCommunity # FantasyPL # GW37 # injury # boutot # wilson?https://twitter.com/BenDinnery/status/1123312717518057476 \xe2\x80\xa6'
287: b'Vertonghen with a possible broken nose (fortuitous headbutt with Alderweirald). Another transfer incoming? # FPL # GW37 # UCL'
288: b'NEW # FPL VIDEO # GW37 | Sterling or Aguero for Captaincy? https://www.youtube.com/watch?v=stGtKmXCCrA \xe2\x80\xa6pic.twitter.com/4IP0QCXkOv'
289: b"We've assembled a panel of # FPL managers to help you with your end-of-season decisions... @ drbenmcnair @ FFCommunity_ @ FPL_ZB SUBMIT HERE https://www.fantasyfootballscout.co.uk/2019/04/30/fpl-question-time-consult-our-panel-ahead-of-gameweek-37/ \xe2\x80\xa6 # FantasyPL # GW37"
290: b'I may have lost the plot. Considering bringing in Vincent Janssen for the last two games.... # FPL # GW37 # GW38'
291: b'5.5% TSB Famous for his relegation goals, van Aanholt likes a late season attacking return. A win against Cardiff could relegate the welsh side, tempting the FPL gods to smile down on the Palace LB. 1.3 shots/game is his current average. # FPL # GW37 # FPLCommunitypic.twitter.com/9O6nmjjrvT'
292: b'\xc2\xa9 # GW37 captain picks # FPL Aguero, Salah, Pogba, Jimenez & Lukaku (diff) @ FPLPlayer_ @ OfficialFPL @ SkySportsStatto @ StatmanDave @ FPLHeskibo @ GKUnion @ fpldare @ lonesomepundit @ AidanWalshMUFC TY all # FPLcommmunity # fantasypl # triplecaptain https://www.thestatszone.com/fpl-gameweek-37-captain-picks-18-19 \xe2\x80\xa6pic.twitter.com/tkcql3YvVg'
293: b'Most Transferred out Today 1) Rashford FW MUN 7.3 9463 2) Firmino FW LIV 9.4 6574 3) Son MF TOT 8.9 5693 4) Pogba MF MUN 8.5 5382 5) Fraser MF BOU 6.3 3094 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
294: b'Most Transferred in Today 1) Wilson FW BOU 6.7 6481 2) Jim\xc3\xa9nez FW WOL 6.9 6197 3) Jota MF WOL 6.3 6051 4) Zaha FW CRY 6.9 4242 5) Pogba MF MUN 8.5 3976 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
295: b'Deulofeu to RLC for Chelsea asset against WAT home game ? # FPL # FPLCommunity # GW37'
296: b'Another Friday 7pm deadline for those in the UK and Saturday 2am for those in Malaysia . # FPL # FPLCommunity # FantasyPL # GW37'
297: b'Thinking Trippier Shaw Then Son Sterling in gw38 Right moves? # FPLCommunity # fpl # GW37 pic.twitter.com/uTrGoI3J3c'
298: b'# FantasyPremierLeague # Gameweek37 CAPTAIN PICKS video is now online on the Polestar Football youtube channel. # PremierLeague # GW37 # FPL # FPLCommunity # FollowThePolestar Click here to watch https://youtu.be/E4FIHnU5NK0 pic.twitter.com/F4ZVrD9Jjf'
299: b'What about this team for # GW38? If I do Son to Pogba for # GW37, then do Gray to Long, and Jimenez to Firmino (-4) for # GW38, I can field: Lloris Valery, Laporte, Robo Mane, Pogba, Sterling, Redmond Aguero, Firmino, Long # FPL # FPLCommunity # FantasyPLpic.twitter.com/QRysJuYICL'
300: b"NEW POST - Fantasy Premier League GW37 \xe2\x80\x93 Analysing The Teams Of 10 Top FPL Managers We look at the teams of 10 top FPL managers who've finished in the top 10k OR the last 3 seasons https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-transfer-tips-gw37-10-top-fpl/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fplcommunity # fantasypl # GW37 # FPLisLifepic.twitter.com/opiiZ0MDTe"
301: b'Do you guys have some dilemmas ahead of # GW37? # FPL'
302: b'Currently in the top 80k of # FPL. Don\xe2\x80\x99t think I\xe2\x80\x99m going to do much tweaking for # GW37 or # GW38. One 4 point hit tops.'
303: b'# FPL # FPLCommunity # FantasyPL # GW37 # upthecheaters https://twitter.com/hailcheaters/status/1123220412199051265 \xe2\x80\xa6'
304: b"A podcast from two top 5k # FPL managers!! Why wouldn't you listen? I know I have and well worth the time invested - do it now... # FPLCommunity # GW37 https://twitter.com/hailcheaters/status/1123220412199051265 \xe2\x80\xa6"
305: b'# GW37 Transfer Thoughts 2 FT \xc2\xa30.5m What transfers would you recommend? # FPL # FPLCommunitypic.twitter.com/QT1odFqsFC'
306: b"ICYMI: new Always Cheating Podcast. The Cheaters are now both in the Top 5K but - with remarkable self-control - don't spend the entire pod talking about it! Instead we discuss key Q's for # GW37: (C)'s, Salah v. Sterling, protecting your rank, etc. https://soundcloud.com/alwayscheating/ep-171-the-weakest-link-gw36-37 \xe2\x80\xa6 # FPL"
307: b'Podcast Alert Episode 38 is now here! Ger and I both used our triple captain chips to great effect this GW and saw more green arrows. We discuss the good and the bad from # GW36 and we look at the # GW37 fixtures and player that strike our fancy # FPL https://soundcloud.com/user-768411468/fplhangoverep38 \xe2\x80\xa6'
308: b'Wymiana Duffy -> Shaw czy Vardy -> Rashford? # fpl # gw37 @ fplpoland'
309: b'Last couple of games against Man City (A) & Chelsea (H). Worth a punt? # FPLCommmunity # FPL # GW37 pic.twitter.com/ewPEDr4wH2'
310: b'# FPL # FPLCommunity # FantasyPL # GW37 # upthegeneralhttps://twitter.com/59thMinutePod/status/1123195690161778688 \xe2\x80\xa6'
311: b'Firmino back in training for Liverpool # FPL # LFC # GW37 # BARLIVhttps://twitter.com/LFC/status/1123187856049094656 \xe2\x80\xa6'
312: b'Pogba > Son on free transfer? # GW37 # FPL # FPLCommunity'
313: b'Excellent podcast - tune in as soon as you can # FPL # FPLCommunity # GW37 https://twitter.com/WGTA_FPL/status/1123173535260790789 \xe2\x80\xa6'
314: b'- @ LucasDigne has created more chances than any other defender in # FPL this season And The Scout expects big things in # GW37 http://preml.ge/TVLUJV pic.twitter.com/j7wI9rGM26'
315: b'GW37 Thoughts Champions League & Europa resumes this week for Liv, Spurs, Che & Ars it will be wise to hold any transfers as injuries might happen prompting line up changes for PL fixtures. # FPL # GW37 pic.twitter.com/arIp234yVz'
316: b'0.6% TSB With Almiron our now for the season, Matt Ritchie takes a greater influence for Newcastle. With two assists in his last 3, Ritchie can offer excellent differential bonus with less than 1% ownership. 1.7 KP/G offers solid attacking potential. # FPL # GW37 # FPLCommunitypic.twitter.com/IcSN7fXvm9'
317: b'I enjoyed this article. Well written and useful (to me at least!). Take a look now... # FPL # FPLCommunity # GW37 https://twitter.com/FootballAdvice5/status/1123134895503675394 \xe2\x80\xa6'
318: b'# FPL # FPLCommunity # GW37 Son Pogba??? # FT'
319: b"Am considering bringing in Hazard for Eriksen and captaining him for # FPL # GW37. So you're all warned - if you own Hazard you'll probably benefit from selling him if my awful judgement over the past few seasons is anything to go by!"
320: b'NEW POST - Andrew Ferguson @ Fergi222 outlines his GW37 teams in FPL, TFF, Sky and Sun Andrew finished top 1k in TFF, Sky and FPL plus 15k in Sun in 17/18. https://www.fantasyfootballgeek.co.uk/gw37-fantasy-football-tips-andrew-ferguson/ \xe2\x80\xa6 # sundreamteam # telegraphfantasyfootball # skysportsfantasyfootball # fpl # gw37 pic.twitter.com/pNLYsLFpy0'
321: b"Gw37 captaincy poll for today's @ 59thMinutePod # FPL # gw37"
322: b"We've updated our preliminary # GW37 Team to watch & Dream team, you can check them out on our website! Bear in mind that it's still Tuseday, so there might be more changes! # FPL https://www.foomnianalytics.com/watch.php"
323: b'A look at how the FPL Review algorithms expectations for GW37 from last week match up with the actual odds from today The learning mechanism has been developed throughout the season and will only be stronger for next year # FPL # FPLCommunity # GW37 pic.twitter.com/MRhoL1cNyM'
324: b'Not looking good for anyone considering united assets.... # FPL # GW37 https://twitter.com/utdxtra/status/1122986987064111104 \xe2\x80\xa6'
325: b"WHO'S YOUR CAPTAIN FOR # GW37? # FPL"
326: b'Captaincy poll # GW37 # FPL # FPLCommunity'
327: b'So Guys the games I will be analyzing are: Wolves vs Fulham Bournemouth vs Spurs Cardiff vs Palace Huddersfield vs United Thanks to everyone who voted and commented! # FPL # FPLCommunity # GW37 https://twitter.com/Fantasy_B0T/status/1122736878481018880 \xe2\x80\xa6'
328: b'# GW37 Squad Preview KDB Plans Eriksen/Son thoughts \xe2\x93\x92 Best captaincy options http://www.footballadvice.co.uk/fpl-gw-37-squad-preview/ \xe2\x80\xa6 # FPL # FPLCommunity'
329: b"It's time to think about the # GW37 captaincy... VOTE HERE https://www.fantasyfootballscout.co.uk/2019/04/30/man-city-options-to-headline-gameweek-36-captaincy/ \xe2\x80\xa6 # FPL # FantasyPL # mcfc # cfc # lfc"
330: b"If you still had a wildcard what 3 strikers would you choose for last 2 GW's ? # FPL # GW37"
331: b'With no United cover at moment, thinking my captain will be Jota (v FUL) next. Or maybe TC him? # GW37 # FPL # FPLCommunity'
332: b'Fixture and form-based # FPL predictions for # GW37 and # GW38https://fantasyfootballpredictions.uk'
333: b'-4 hit to get in Aguero this week or next? Would mean no Pogba if this week, no Mili if next week. Wilson would be the fall guy for Aguero. # FPL # GW37'
334: b'Most Transferred out Today 1) Rashford FW MUN 7.3 3159 2) Firmino FW LIV 9.4 2255 3) Son MF TOT 8.9 1950 4) Pogba MF MUN 8.5 1922 5) Fraser MF BOU 6.3 1053 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
335: b'Most Transferred in Today 1) Wilson FW BOU 6.7 2297 2) Jota MF WOL 6.3 2146 3) Jim\xc3\xa9nez FW WOL 6.9 2088 4) Man\xc3\xa9 MF LIV 10.2 1466 5) Zaha FW CRY 6.9 1418 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
336: b'Overnight price fallers Batshuayi FW CRY 6.2 # FPL # GW37 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
337: b'Overnight price risers Jota MF WOL 6.3 Man\xc3\xa9 MF LIV 10.2 # FPL # GW37 http://www.fpl247.com/player/price/weekly?change=rise \xe2\x80\xa6'
338: b'Pod #171: Form vs. fixtures in # GW37. MUN are woeful, but how kind is the run-in? Can Vardy continue scoring against MCI?. And relegated FUL are good again. Plus our captain picks and ideas for gaining/holding a late-season ML lead. # FPL # hailcheatershttps://soundcloud.com/alwayscheating/ep-171-the-weakest-link-gw36-37 \xe2\x80\xa6'
339: b'# GW37 locked and loaded.... # FPL pic.twitter.com/sVtNITvi5C'
340: b'# GW36, below average this week with the -4pts but still inside the top 600k. Its been a real improvement this season compared to previous seasons. A stead # GW37 and # GW38 will give me a good target to beat next season. # FPL pic.twitter.com/sAmVjxUasW'
341: b'Having doubts over a Pogba transfer now... # FPL # GW37 # HUDMUNhttps://twitter.com/utdxtra/status/1122991791458914306 \xe2\x80\xa6'
342: b'S\xc3\xa1nchez (\xc2\xa310.0m) or Martial (\xc2\xa37.2m) punt? # FPL # GW37 # HUDMUNhttps://twitter.com/utdxtra/status/1122986987064111104 \xe2\x80\xa6'
343: b'This could be the perfect time for Solskj\xc3\xa6r to play Greenwood in the last two games against Huddersfield and Cardiff. Especially with that Martial incident last game, and top 4 out of sight. Massive differential? # FPL # FPLCommmunity # GW37 # G38https://twitter.com/utdxtra/status/1122986987064111104 \xe2\x80\xa6'
344: b'If you are looking for United player ahead of # GW37, I dont think this guy will bring in # FPL points anytime soon. Sad to see this before a must win game. Now we know why OGS brought on Sanchez instead of Martial last night. https://twitter.com/paulsherlock69/status/1122612560178577408 \xe2\x80\xa6'
345: b'# FPL # GW37 https://twitter.com/utdxtra/status/1122986987064111104 \xe2\x80\xa6'
346: b'Match official appointments for the penultimate GW: - Another Friday Deadline!!! - Michael Oliver at # CARCRY overseeing relegation matters. - Anthony Taylor on hand for # ARSBHA. - Marriner & Dean, take MCI & LIV fixtures respectivley. # GW37 # FPL # RefStatshttps://www.premierleague.com/news/1204181'
347: b'Who would you captain? # GW37 # FPLCommunity # FPL pic.twitter.com/rqk5TTDR8R'
348: b"Update: thanks for the thoughts and advice, everyone! Aguero in GW37 seems like the early front-runner. 3 hat tricks at home already this season, competing for the golden boot, a must-win game for MCI. There's a lot to like. # FPL # GW37"
349: b'Which 2 # FPL players for # GW37 & # GW38 respectively?'
350: b'Thoughts for # GW37 Gray and Doucour\xc3\xa9 to Long and Martial (gamblee!) for a -4! Worth the punt or senseless? # FPL # FPLCommunity # transfers'
351: b'# FantasyPremierLeague # Gameweek37 BEST FIXTURES video is now online on the Polestar Football youtube channel # PremierLeague # GW37 # FPL # FPLCommunity # FollowThePolestar Click here to watch https://youtu.be/fdcOGu0M9lw pic.twitter.com/zVQnAJKLYv'
352: b'# FantasyPremierLeague # Gameweek37 TEAM SELECTION is now online on the Polestar Football youtube channel. # PremierLeague # GW37 # FPL # FPLCommunity # FollowThePolestar Click here to watch https://youtu.be/Aiwl1oShM_I pic.twitter.com/M8mfV4T3zN'
353: b'Gameweek 36 Top Teams Transfer Analysis # FPL # GW37 http://fpl247.com/page/a270ff11-54d4-4df1-923d-ed80309d8b5c \xe2\x80\xa6'
354: b'Gameweek 36 Top Teams Player Analysis # FPL # GW37 http://fpl247.com/page/f46b4391-1fd2-4799-a793-811e85e8500c \xe2\x80\xa6'
355: b'Gameweek 36 Top Teams Formation Analysis # FPL # GW37 http://fpl247.com/page/151c225c-9a6f-41dc-832a-7e6064c933b3 \xe2\x80\xa6'
356: b'Remind us: was there someone counting on Leicester pulling something from their sleeve against Man City in # GW37? # FPL pic.twitter.com/KZc6HWMYag'
357: b'# FPL # FPLCommunity # GW37 Currently outside the 10K with 2FT looking for some differentials to secure a top 10K place.. A - Laca/Foster/RyanVardy/De Gea/\xc2\xa33.9GK B - Laca/Foster/ ValeryVardy/Guaita/Shaw C- Laca/Foster/ValeryRashford/De Gea/Kompany'
358: b'But it seems Pogba likes playing with his compatriot! # FPL # GW37 # Pogbapic.twitter.com/54WELgaJrZ'
359: b"Manchester United confirm that Eric Bailly suffered a medial ligament injury during Sunday\xe2\x80\x99s match against Chelsea and the defender will miss United's two remaining league fixtures plus the Africa Cup of Nations. # FFScout # FPL # GW37 # MUFC"
360: b'Or this one? # FPL # GW37 # Pogbapic.twitter.com/xz8VfguI58'
361: b'How about this one then? # FPL # GW37 # Pogbapic.twitter.com/nzEEr0mQMb'
362: b"How do Pogba's teammates affect his returns? # FPL # GW37 Well, this one is not that much surprising, I guess... pic.twitter.com/devxaeYYcq"
363: b'Feels like pre season all over again. Twitter going gaga over Luke Shaw! We all know how that ended. # FPL # GW37 # FPLCommunity'
364: b"5.9% TSB After providing the assist for the opening goal vs Chelsea, Shaw kicks off our <6% TSB picks. Averaging 1.2 Key Passes/90 and two easy fixtures on paper remaining could see him offer returns, even if CS don't look likely at the moment for MUN. # FPL # GW37 # FPLCommunitypic.twitter.com/O6pQpotiXv"
365: b'Most Transferred out Today 1) Rashford FW MUN 7.3 19686 2) Firmino FW LIV 9.4 13706 3) Pogba MF MUN 8.5 12316 4) Son MF TOT 8.9 11949 5) Lacazette FW ARS 9.4 6432 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
366: b'Most Transferred in Today 1) Wilson FW BOU 6.7 13784 2) Jota MF WOL 6.2 13374 3) Jim\xc3\xa9nez FW WOL 6.9 12546 4) Zaha FW CRY 6.9 9091 5) Man\xc3\xa9 MF LIV 10.1 9055 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
367: b'# GW37 Preview We have previewed our team ahead of GW37, chatting De Bruyne plans and what to do with our double Spurs assets http://www.footballadvice.co.uk/fpl-gw-37-squad-preview/ \xe2\x80\xa6 # FPL # FPLCommunity # Debruyne # Son # Eriksen'
368: b'Who should I bring in? # FPL # GW37'
369: b'Heck, I might just do Duffy to Digne/PvA this GW and be done with it. # GW37 # FPL # FPLCommunity # FantasyPL'
370: b'# GW37 Transfer Plan: Eriksen Pogba Dunk Shaw Thoughts # FPL ?'
371: b'Final # FPL podcast guest appearance of the season for me coming up tomorrow, this time on the @ FPLSurgery alongside the excellent @ FPL_Houghts - @ thebull2015 hosting as usual, but unfortunately @ JamesDrewery is on hols. # GW37'
372: b'Am I the only one considering Hazard for # GW37? - Watford at home - Might be his last game at Stamford Bridge (PL) # FPLCommunity # FPL'
373: b'Took a comfy 66 point lead... # FPL @ OfficialFPL # GW36 # GW37 pic.twitter.com/lo4pzgAKhQ'
374: b'# HUDMUN dilemma: - Want Pogba but Son might haul vs BOU. - Want Rashy in place for Gray but he is injured. - Shaw in place of Duffy but might not keep a CS? - Tempted to hold my FT but might miss on a MU haul. # FPL # FPLCommunity # FantasyPL # GW37 pic.twitter.com/ntOeMxTcir'
375: b"Any thoughts on these transfers for the final two GW's? # GW37 # GW38 Also, who would be your Captain Choice? Leaning towards Hazard for now. Current team also posted! # FPL # FPLCommmunitypic.twitter.com/vQP2ctgUxA"
376: b'Thinking Shaw in as a low ownership differential! Surely Utd can keep a clean sheet against Huddersfield, can\xe2\x80\x99t they? # FPL # GW37'
377: b'Player Status Change Bailly DF MUN 5.0 Sissoko MF TOT 4.9 # FPL # GW37 http://www.fpl247.com'
378: b'Fantasy Premier League tips Gameweek 37: Captains # FPL # GW37 http://burp.to/7o2'
379: b'Nice thread! Have a read if you\'re considering United players for # GW37. "Hud are form proof, they can let a struggling team do well." - sums it up quite nicely imo. # FPL https://twitter.com/ClaretFPL/status/1122779342344478721 \xe2\x80\xa6'
380: b'Data data data! For teams who played against HUD. # FPL # FPLCommunity # FantasyPL # GW37 # HUDMUNhttps://twitter.com/Philosopey/status/1122854742420377600 \xe2\x80\xa6'
381: b'New Always Cheating Podcast tonight! Questions, comments, rants, deep thoughts? Send them in. # FPL # GW37 # hailcheaterspic.twitter.com/pg1vBpT9Q1'
382: b'Oh it\xe2\x80\x99s happening ! Bench boost time !! # fpl # gw37 pic.twitter.com/66O0pb1M1w'
383: b"What is everyone's thoughts on Wilf Zaha for the last 2? Cardiff away and B'mouth at home \xe2\x80\xa2 Does well away (esp. Vs dodgy defences) \xe2\x80\xa2 playing a team bad defensively away from home at Selhurst Or is picking him too 'fixtures over form' in # FPL terms? # GW37 # FPLCommunity"
384: b"# GW36 results Simply top performance from my team!! Still not points result, but I'm happy with it Score : 81 pts - green arrow as a result As I was saying previously - # Liverpool and # ManCity assets are must have now # FPL # PFAawards # FPLCommunity # GW37 pic.twitter.com/bKxC6DSHnQ"
385: b'NEW POST - fantasy premier league teams GW37 \xe2\x80\x93 some early thoughts on the FFGeek team https://www.fantasyfootballgeek.co.uk/fantasy-premier-league-teams-gw37-early-ffg/ \xe2\x80\xa6 # fpl # FantasyPremierLeague # fantasypl # GW37 # eplfantasy # fplMY # fplupdates # fplislife # fantasypremierleagueislife # FPLus # fpltreviewpic.twitter.com/RL5Gd7uK5a'
386: b'Good historical stats of those featuring this coming # GW37. Son tops the list! # FPL # FPLCommunity # FantasyPLhttps://twitter.com/ChrisTanFPL/status/1122828224147480576 \xe2\x80\xa6'
387: b'Fantasy Premier League tips Gameweek 37: Forwards # GW37 # FPL http://burp.to/7o1'
388: b"Points in # GW36 were not enough as we still get a arrow this gameweek. Liverpool and Man City assets were the saviours!! Ward-Prowse's 9 points on the bench! Now moving on to # GW37 # FPL Overall Points - 2,180 Overall Rank - 69,086 pic.twitter.com/7ZDAew6f5I"
389: b'Only 2 GWs remaining, and that means only 2 Guest Q&A articles left Let\xe2\x80\x99s make them the best of the season! Comment below what questions you have ahead of # GW37, so we can feature them in our article # FPL # FPLCommunity'
390: b'which team will get more points in the next 2 weeks? # fpl # fantasy # football # gw37'
391: b'which team will get more points in the next 2 weeks? # fpl # fantasy # football # gw37 pic.twitter.com/d2RHO1BncL'
392: b'# FPL # GW37 # FPLCommunity @ OfficialFPL Who among this Manchester United quartet will score the most against " @ htafcdotcom the points genie"??'
393: b'# GW36 Review 87 points 56,015 OR (500 place ) Mane/Robbo/Laporte Spurs 2 FT going into # GW37, one of the Spurs players to leave for sure! Feeling good about a strong finish How did everyone get on? # FPL # FPLCommunitypic.twitter.com/uU6uMad0lT'
394: b'# fpl Man Utd won 3-1 against Huds during their last encounter. Ole had just taken over, Pogba with two goals. Could he be considered as an FPL option this weekend @\xc2\xa38.5 still highly owned. # gw37'
395: b'Fantasy Premier League tips Gameweek 37: Midfielders # FPL # GW37 http://burp.to/7ny'
396: b"Just to remind you guys that you can perform free player comparison on our website as much as you want! You don't have to wait for us to answer your queries. # FPL # GW37 We, however, don't mind doing it at all. https://foomnianalytics.com/pcompare.php"
397: b'Live Scoutcast 9:30pm Tuesday Hosted by @ LetsTalk_FPL What would you like us to cover? Which player and why? Which team and why? What should our talking point be & why? # FPL # FantasyPL # GW37 Subscribe here - https://www.youtube.com/channel/UCKxYKQ8pgJ7V8wwh4hLsSXQ \xe2\x80\xa6'
398: b'# FPL # GW37 Preview 2FT Maddison Sigurdsson Kolasinac Van Aanolt Jiminez OR 38,457 pic.twitter.com/4u7hE4gn7g'
399: b'With Man United playing Huddersfield and Cardiff, managers are considering them. But is this just fixtures over form again? I had a look at Huds last 6 opponents and the 4 matches they played before Hud to see if they were form busters A thread: # FPL # FPLCommunity # GW37 pic.twitter.com/dG3yYwfZI1'
400: b"Players under my radar: Jota, Redmond, JWP, Bernardo, Kompany, Deulofeu... I am not interested in United's defender, no matter they play against HUD. Clown as a goalkeeper, Rashford probably out, no potential Show's assists. The same is valid for Zaha, Babel. 2/2 # FPL # GW37"
401: b'Fantasy Premier League tips Gameweek 37: Defenders # GW37 # FPL http://burp.to/7o0'
402: b'Best captain for GW37 from City. # FPL # mancity # gw37 # FantasyFootball'
403: b'Most Transferred out Today 1) Rashford FW MUN 7.3 7327 2) Firmino FW LIV 9.4 4990 3) Pogba MF MUN 8.5 4944 4) Son MF TOT 8.9 4777 5) Lacazette FW ARS 9.4 2508 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
404: b'Most Transferred in Today 1) Wilson FW BOU 6.7 5442 2) Jota MF WOL 6.2 5437 3) Jim\xc3\xa9nez FW WOL 6.9 4601 4) Man\xc3\xa9 MF LIV 10.1 3708 5) Zaha FW CRY 6.9 3441 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
405: b'Overnight New Players Driscoll-Glennon DF BUR 4.0 # FPL # GW37 http://www.fpl247.com/player/newplayer \xe2\x80\xa6'
406: b'# FPL # GW36 team summary: Triple Captain activated Salah \xc2\xa9\xc2\xa9\xc2\xa9 Man\xc3\xa9, Robbo, Jota Gray, Jim\xc3\xa9nez Best score of my FPL career so far. Jumped from 600k+ to 400k+ too The final climb continues. Bring on # GW37! And a Rodgers win too please. pic.twitter.com/1dcETUQlev'
407: b'Overnight price fallers Alonso DF CHE 6.2 Aubameyang FW ARS 10.8 G\xc3\xbcndogan MF MCI 5.4 Ibe MF BOU 4.9 Kant\xc3\xa9 MF CHE 4.9 # FPL # GW37 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
408: b'Overnight price risers Alexander-Arnold DF LIV 5.7 Salah MF LIV 13.3 # FPL # GW37 http://www.fpl247.com/player/price/weekly?change=rise \xe2\x80\xa6'
409: b'Overnight players unavailable Rashford FW MUN 7.3 Willian MF CHE 7.1 \xc3\x96zil MF ARS 7.9 Monreal DF ARS 5.4 Maitland-Niles MF ARS 4.4 # FPL # GW37 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
410: b'Overnight players available Aubameyang FW ARS 10.8 Alonso DF CHE 6.2 Kant\xc3\xa9 MF CHE 4.9 G\xc3\xbcndogan MF MCI 5.4 Herrera MF MUN 5.0 # FPL # GW37 http://www.fpl247.com/player/returning \xe2\x80\xa6'
411: b'Which Game Would You Guys Most Like To See Analysed For GameWeek 37? If you would like a different game, comment below! # FPL # FPLCommunity # GW37'
412: b'Fantasy Premier League tips Gameweek 37: Goalkeepers # FPL # GW37 http://burp.to/7nz'
413: b'# FPL # FPLCommunity # GW37 Bench one...'
414: b'# GW36 Summary: 93pts! Robo & Mane (c)! Jota & Jimi Kun & Laporte Duffy TOT & Son Gray on bench Great score despite no chips played! Onward to # GW37! OR: 27,302 ( 2,172) # FPL # FPLCommunity # FantasyPL # GW36pic.twitter.com/aifCzrqIlx'
415: b"*** Ep. 192 - On to # GW37 Long in the Tooth *** Things were bad. Things went poorly. Let's find some stuff to talk about and some punts to take. http://fmlfpl.libsyn.com/ep-192-on-to-gw37-long-in-the-tooth \xe2\x80\xa6 # FMLFPL # FPL # FantasyPremierLeague # FantasyPL"
416: b'# GW36 # FPL Summary 96-4 = 92pts nett Green arrows to 106,004 OR # GW37 pic.twitter.com/LIRebCzxlX'
417: b'Thanks to the Vardy party I am up from 17k to 14k OR. I just need to keep it simple in # GW37 and # GW38 to end my 2nd season as an # FPL manager is style. pic.twitter.com/FjoDtNayMI'
418: b'Massive GW36 for some, @ thebull2015 is in the studio Tuesday night with two of our biggest regulars @ UtterlyTC and @ FPL_Houghts for # GW37. Please send over your questions and or topics to discuss # upthepod # fpl pic.twitter.com/WQEG0IMUpP'
419: b'Should I even bother with MU assets? And should I get another LIV defender to triple up? Only have Robo & Mane. # FPL # FPLCommunity # FantasyPL # GW37 # GW36'
420: b"Janssen 4.5m Not registered for the CL, Son suspended midweek... surely he won't start against Bournemouth.... will he?? # FPL # GW37 # BOUTOT"
421: b"Hopefully with the TC chip still intact I can push on next week, had planned to play it in # MCILEI in # GW37 but with Leicester's form now considering other options, who do you think has the best chance of a decent points haul... # FPL"
422: b'# FPL # gw37 Having trouble with who to use my FT with/for this week. Calvert doesn\xe2\x80\x99t seem productive and Ings seems to be in Shane Long\xe2\x80\x99s shadow recently. Any ideas? pic.twitter.com/iI08g9ijeS'
423: b'GW36 is over, and our preliminary projections are updated. Which means our comparison tool is also now prepared for # GW37! # FPL https://foomnianalytics.com/pcompare.php'
424: b"Ahead of # FPL # GW37 we are happy to have @ LetsTalkSoccer2 on board as our Fantasy Forecast guest! They'll be taking The Hype Team on in # PL predictions and in selecting a Scout Picks squad in the upcoming Gameweek. # AllAboardpic.twitter.com/Zr6zudarZq"
425: b"# FPL # GW36 is in the past and we've already reached the penultimate Gameweek of the season, with # GW37's deadline this coming Friday. when Everton host Burnley. Liverpool (vs. Barcelona) and Spurs (vs. Ajax) have to contend with Champions League semi-finals this week and next. pic.twitter.com/MCyEMPZUfd"
426: b'GW35 Pts GW36 Pts Will it be three in a row? # GW37 Thinking of getting Pogba, on paper it looks good tho # FPL # GW36pic.twitter.com/eJ0s3CxDgD'
427: b'We will be back recording Tuesday night, @ TheMarpleCurse , @ marz05 and @ KylieFpl will review # GW36 and preview # GW37. We are full on sprinting now, title race, top 4 , fight for 7th and even relegation. As always we will focus on your questions so send them in! # T3A # GW37 # FPL'
428: b"For the 2nd GW in a row, 3rd time this season and i'm back in the club. 109 pts (-4) OR - 4812 ( 1.8K) My best OR, EVER!!! I hadnt expected a rise with no TC chip and a -4, returns from 8/11 players certainly helped. My bench also delivered too. # GW37 # FPL # 100clubpic.twitter.com/iKpH6kLgwt"
429: b'We enter the final two Gameweeks of the 2018/19 season! Good luck everyone for the run-in! # FPL # GW37 # GW38pic.twitter.com/JyGjFb4iiP'
430: b'Player Status Change Rashford FW MUN 7.3 # FPL # GW37 http://www.fpl247.com'
431: b"What's everyone thinking for # GW37 captaincy then? Currently on this. # FPL pic.twitter.com/HU1Lq6nekb"
432: b'# GW36 - 131(-4) We are in the business end of the season now so no more messing I\xe2\x80\x99m aiming to get Sterling in for # GW37, just need to figure out who to chop Another Green Arrow 67k32k # FPL # FPLCommunitypic.twitter.com/B0hPmvz7fk'
433: b'Onwards and upwards - plans for GW37? # fpl # gw37'
434: b'Player Status Change Alonso DF CHE 6.3 R\xc3\xbcdiger DF CHE 5.9 Willian MF CHE 7.1 Kant\xc3\xa9 MF CHE 5.0 Herrera MF MUN 5.0 McTominay MF MUN 4.2 # FPL # GW37 http://www.fpl247.com'
435: b'# FPL # GW37 @ _FPLtips @ LetsTalk_FPL @ OfficialFPL Early thought, Vardy to Rashford or Rondon to Rashford + Eriksen to Lucas Moura (-4) ?!!'
436: b'Any thoughts on a midfielder \xc2\xa37.8m or below who can outscore Son in # FPL # GW37? Operation Lukaku Last -4 of the season (I hope) before I look to show a bit more restrain in 2019/20.'
437: b'Most Transferred out Today 1) Firmino FW LIV 9.4 7854 2) Son MF TOT 8.9 7600 3) Pogba MF MUN 8.5 5915 4) Aubameyang FW ARS 10.9 5544 5) Lacazette FW ARS 9.4 5148 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
438: b'Most Transferred in Today 1) Jota MF WOL 6.2 8794 2) Wilson FW BOU 6.7 8395 3) Wan-Bissaka DF CRY 4.5 6675 4) Rashford FW MUN 7.3 6473 5) Jim\xc3\xa9nez FW WOL 6.9 6081 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
439: b'# FPLCommmunity # fpl # gw37'
440: b'Back-to-back 100+ point GWs now. Finishing # GW36 on 103 points. Only mistake was keeping Jota as my 1st sub. Could have been 113, but happy with the score. At 10,600 OR, but no coverage from Chelsea and United. Have planned transfers for # GW37 (2FT) & # GW38 already. # FPL'
441: b'Player Status Change G\xc3\xbcndogan MF MCI 5.5 # FPL # GW37 http://www.fpl247.com'
442: b'Player Status Change Maitland-Niles MF ARS 4.4 Aubameyang FW ARS 10.9 # FPL # GW37 http://www.fpl247.com'
443: b'Early thoughts on Jim\xc3\xa9nez (C) for # GW37? # FPL'
444: b'Player Status Change Monreal DF ARS 5.4 \xc3\x96zil MF ARS 7.9 # FPL # GW37 http://www.fpl247.com'
445: b'Man U assets may look unattractive because of poor form but they play Huddlefield!!! Can we ignore? It brings back the arguments fixture v form, what are your thoughts? # FPL # GW37 pic.twitter.com/0WpjczOup3'
446: b'Most Transferred out Today 1) Son MF TOT 8.9 2271 2) Firmino FW LIV 9.4 2001 3) Pogba MF MUN 8.5 1572 4) Aubameyang FW ARS 10.9 1218 5) Fraser MF BOU 6.3 1065 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=out \xe2\x80\xa6'
447: b'Most Transferred in Today 1) Jota MF WOL 6.2 2714 2) Wilson FW BOU 6.7 2288 3) Wan-Bissaka DF CRY 4.5 1958 4) Rashford FW MUN 7.3 1726 5) Digne DF EVE 5.3 1661 # FPL # GW37 http://www.fpl247.com/player/transfer/daily?transfer-type=in \xe2\x80\xa6'
448: b'Overnight price fallers King FW BOU 6.4 Okazaki FW LEI 5.1 Puncheon MF HUD 4.1 Sch\xc3\xa4r DF NEW 4.5 # FPL # GW37 http://www.fpl247.com/player/price/weekly?change=fall \xe2\x80\xa6'
449: b'Overnight players unavailable P\xc3\xa9rez FW NEW 6.2 Arnautovic FW WHU 6.7 Cathcart DF WAT 4.5 Gunnarsson MF CAR 4.4 Gosling MF BOU 4.7 Odoi DF FUL 4.4 Yoshida DF SOU 4.1 Kayal MF BHA 4.4 Zohore FW CAR 4.6 # FPL # GW37 http://www.fpl247.com/player/unavailable \xe2\x80\xa6'
450: b'Overnight players available Clyne DF BOU 4.4 Mawson DF FUL 4.7 Diakhaby MF HUD 4.5 # FPL # GW37 http://www.fpl247.com/player/returning \xe2\x80\xa6'
451: b'Overnight players available Richarlison MF EVE 6.4 Deeney FW WAT 5.8 Walcott MF EVE 5.9 Chicharito FW WHU 6.1 Sch\xc3\xa4r DF NEW 4.5 Armstrong MF SOU 5.1 Long FW SOU 4.6 Bertrand DF SOU 4.8 Targett DF SOU 4.2 # FPL # GW37 http://www.fpl247.com/player/returning \xe2\x80\xa6'
452: b'Well Trippier & Firmino didn\xe2\x80\x99t play in # GW36. In comes Jiminez & Doherty. # GW37 moves are: Son of Odious Salah (Back again) Firmino Bucky Barnes (enables ) Season is my worst ever since I started playing in 2006/07 - but I\xe2\x80\x99ll be back next yr for more # FPL shenanigans'
